[{"summary":"Moving a board to a different list updates the \"last updated\" date on all cards within the same list","key":"TRELLO-1144","url":"https://jira.atlassian.com/browse/TRELLO-1144","type":"Bug","priority":"","description":"h3. Issue Summary\r\nThe 'last updated' date on Trello cards is incorrectly modified when a card is moved between lists, resulting in outdated cards appearing in search results.\r\n\r\nh3. Steps to Reproduce\r\n # Move a card from one list to another.\r\n # Use the Trello search feature (https://trello.com/search) and sort by \"last updated.\"\r\n\r\nh3. Expected Results\r\nOnly the moved card and recently modified cards should appear as recently updated in the search results.\r\n\r\nh3. Actual Results\r\nOld cards within the same list that haven't been recently updated are incorrectly displayed as if they were updated.\r\n\r\nh3. Workaround\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-31T23:36:39.000+0000","comments":[]},{"summary":"People assigned to checklist items, sometimes they are missing as assignee to a checklist from mirror cards.","key":"TRELLO-1142","url":"https://jira.atlassian.com/browse/TRELLO-1142","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nCheck items on a mirror card that are assigned to someone, not on the current board appear unassigned\r\nh3. Steps to Reproduce\r\n # If person is not a member of board, they will not show as assignee on mirror card checklists\r\n\r\nh3. Expected Results\r\n\r\nThe person assigned to a checklist item should be visible in all types of cards, including mirror cards.\r\nh3. Actual Results\r\n\r\nperson is not visible in the mirror card checklist\r\nh3. Workaround\r\n\r\n*We can go back to the original card to see the assignees.*","createDate":"2025-03-31T07:52:09.000+0000","comments":[]},{"summary":"Automation can't distinguish two boards with the same name when selecting a board to do an action","key":"TRELLO-1141","url":"https://jira.atlassian.com/browse/TRELLO-1141","type":"Bug","priority":"","description":"h3. Issue Summary\r\nIf you have a board with the same name in two different Workspace, when selecting a board on the dropdown list on automation, it will display just one name, and it's not possible to know which board the automation is referring to.\r\n\r\nh3. Steps to Reproduce\r\n # Have 2 boards with the same name in 2 different Workspaces (Board01 on WS A, Board01 on WS B)\r\n # Create an automation on Board01 - WS A, selecting Board01 to move cards to . The dropdown list will show only one Board01\r\nExample: every day, copy all the cards in list \"To Do\" on board \"Tasks\" to list \"To do\" on board \"Board01\"\r\n\r\nh3. Expected Results\r\nYou want the cards to be moved on the Board01 WS A you create the automation\r\n\r\nh3. Actual Results\r\nThe cards are copied to Board01 on WS B.\r\n\r\nh3. Workaround\r\nUpdate the board name so they cannot be the same.","createDate":"2025-03-28T21:13:51.000+0000","comments":[]},{"summary":"In Trello IOS app able to add members on the card of a Template board","key":"TRELLO-1140","url":"https://jira.atlassian.com/browse/TRELLO-1140","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nAble to add members on a card on a Template Board in Trello IOS app.\r\nh3. Steps to Reproduce\r\n # Create a Template Board.\r\n # Open Trello mobile app. \r\n # Try to add members to the card\r\n\r\nh3. Expected Results\r\n\r\nShould not see the option to add a member on the card.\r\nh3. Actual Results\r\n\r\nAble to add members on the card in the template board\r\nh3. Workaround\r\n\r\nNone","createDate":"2025-03-28T16:01:08.000+0000","comments":[]},{"summary":"When viewing Guest Workspace boards in the iOS app boards page, they intermittently are missing from the Guest Workspace section","key":"TRELLO-1132","url":"https://jira.atlassian.com/browse/TRELLO-1132","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen viewing Guest Workspace boards in the iOS app boards page, they intermittently are missing from the Guest Workspace boards list.\r\n\r\nh3. Steps to Reproduce\r\n1. On the boards page, scroll down to the Guest Workspaces\r\n2. Select a board to open\r\n3. Go back to the Boards page\r\n4. The board shows in the 'Recent Boards' list, but is missing under the Guest Workspaces section.\r\n\r\nAnother way to reproduce:\r\n1. On the boards page, scroll down to the Guest Workspaces\r\n2. Select the 'Boards >' to view all boards in that Workspace\r\n3. Select one of the boards to open\r\n4. Go back to the Boards page. The board shows in the 'Recent Boards' list, but is missing under the Guest Workspaces section.\r\n\r\nh3. Expected Results\r\nGuest Workspace boards are always displayed on the Boards page\r\n\r\nh3. Actual Results\r\nThe Guest Workspace boards intermittently go missing underneath the 'Guest Workspace' list.\r\n\r\nh3. Workaround\r\n\r\nTo view all Workspace boards, \r\n1. Scroll down the Boards page and find the Workspace.\r\n2. Select 'Boards >' to view all Workspace boards assigned to you.\r\n\r\nOR\r\n1. Navigate to 'Account' \r\n2. Select the 'Guest Workspace'\r\n3. Select the relevant Workspace to view all boards assigned to you.\r\n\r\nTroubleshooting suggestion: Follow this guide to clear Trello app cache on launch. Please check for any unsent changes before proceeding. (https://support.atlassian.com/trello/docs/troubleshooting-for-the-ios-app/)","createDate":"2025-03-26T06:04:33.000+0000","comments":[]},{"summary":"Workspace Table View doesn't show cards without a date assigned to you if you mark the filter \"Not marked as complete\"","key":"TRELLO-1127","url":"https://jira.atlassian.com/browse/TRELLO-1127","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWorkspace Table View doesn't show cards without a date assigned to you if you mark the filter \"Not marked as complete\"\r\nh3. Steps to Reproduce\r\n # Create multiple cards assigned to you without due/start date, others with due dates\r\n # Create a Workspace table view for this board with the filter to cards assigned to you.\r\n # Select the filter \"Not marked as complete\"\r\n # The cards without a due/start date that aren't marked as complete will disappear.\r\n\r\nh3. Expected Results\r\n\r\nThe cards without a due date should be displayed on the Workspace table view with the filter \"Not marked as complete\" selected, as they have not been completed.\r\nh3. Actual Results\r\n\r\nCards without a due date don't show up on the Workspace calendar view if you select the filter \"Not marked as complete\"\r\nh3. Workaround\r\n\r\nNone","createDate":"2025-03-24T14:22:20.000+0000","comments":[]},{"summary":"Missing access-control-allow-origin header for 4xx responses","key":"TRELLO-1104","url":"https://jira.atlassian.com/browse/TRELLO-1104","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nAPI requests that result in 4xx error codes (such as *429* and  \\{*}400{*}) are missing the *access-control-allow-origin* and other *access-control-allow-** headers, preventing the power-up from accessing the *retry-after* and {*}x-rate-limit-{*}* headers.\r\n\r\nThis issue happens on multiple API endpoints, but I'm sharing the *https://api.trello.com/1/batch/* endpoint for reference.\r\nh3. Steps to Reproduce\r\n # Perform an API request to *https://api.trello.com/1/batch/* endpoint that reaches the API rate limit and returns a *429* status code.\r\n\r\nh3. Expected Results\r\n\r\nThe *access-control-allow-** headers are available on the request, allowing the requester to access the response headers.\r\nh3. Actual Results\r\n\r\nThe *access-control-allow-** headers are not available on the request.\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-17T12:45:00.000+0000","comments":[{"text":"Hi all, this is Jireh from the Trello Development team.\r\n\r\nIs anyone experiencing this issue able to post screenshots of logs showing what headers are returned when an API request is rate limited? I'm currently unable to reproduce this issue.\r\n\r\nI have an API key that I've artificially rate limited to test this issue. But despite being rate limited (429 response) and not seeing the {*}access-control-allow-{*}* headers, I can still see \\{*}retry-after-{*}* and {*}x-rate-limit-{*}* headers in the response.\r\n\r\n!Screenshot 2025-03-18 at 12.42.47 PM.png|width=299,height=299!","author":"Jireh"},{"text":"Hi [~jlo@atlassian.com] \r\n\r\nAlthough you can see the {*}retry-after-{*}* and {*}x-rate-limit-{*}* headers in DevTools, you won't be able to access them from your *JS code* if you make a request from different origin. This behavior is part of the browser's [CORS|https://developer.mozilla.org/en-US/docs/Web/HTTP/Guides/CORS] mechanism.\r\n\r\n \r\n\r\nAs I wrote on the original ticket [Missing access-control-allow-origin header for 429 response - Developer and Marketplace Support - Jira Service Management:|https://ecosystem.atlassian.net/servicedesk/customer/portal/34/ECOHELP-58073]\r\n\r\nLack of the {{[access-control-allow-origin|https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Access-Control-Allow-Headers]}} header prevents our code from accessing the response object.\r\n\r\nLack of the {{[access-control-expose-headers|https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Access-Control-Expose-Headers]}} header with retry-after and x-rate-limit-* headers listed does not allow us to calculate appropriate delay before the next retry.","author":"Planyway"},{"text":"[~192198428688] Hi, I believe I've discovered the issue that was causing Trello to not set the headers correctly when returning 429. I've deployed a fix. Can you check again to see if you are still running into the issue? ","author":"Jireh"},{"text":"Hi [~jlo@atlassian.com]!\r\n\r\nI can confirm that both allow-origin and expose-headers are present in 429 response now.\r\n\r\nOne more thing related to this issue. Could you please add the *retry-after* header to exposed headers as well? It works effectively on our backends, I believe it will also help reduce 429 errors on the frontend.\r\n\r\n \r\n\r\nSincerely yours, Planyway Team","author":"Planyway"},{"text":"[~192198428688] Got it. It should be a simple add, but because of current company-wide code freeze which limits which changes can go out for the next 2 weeks, it will be a while until I can deploy this fix. I'll let you know as soon as its out.","author":"Jireh"},{"text":"[~192198428688] Actually, I think my fix was just deployed and managed to sneak in just before our code freeze starts. Could you let me know if you see `retry-after` in the headers now? Thanks.","author":"Jireh"},{"text":"Hi [~jlo@atlassian.com]!\r\n\r\nGreat news! I can confirm that the retry-after header is now available. Thank you.","author":"Planyway"}]},{"summary":"Cursor jumps to end of text after deleting a space in card title on iOS","key":"TRELLO-921","url":"https://jira.atlassian.com/browse/TRELLO-921","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center: (no)\r\n\r\n \r\n\r\nWhen a user deletes a space between two words in a card's title on an iOS device, the space character is correctly removed. However, instead of the cursor positioning itself at the location of the deleted space (between the two words), it automatically jumps to the end of the text. This behavior disrupts the user's editing flow, as they have to manually reposition the cursor to continue editing.\r\nh3. Steps to Reproduce\r\n\r\nOur team is working to better understand how to reproduce the problem.\r\nh3. Expected Results\r\n\r\nOne character (space) is deleted and the cursor is positioned to delete the next character before it.\r\nh3. Actual Results\r\n\r\nOne character is deleted and the cursor jumps to the end of the title.\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-01-17T20:19:03.000+0000","comments":[{"text":"We are unable to reproduce this issue on the latest version of Trello and latest version of iOS.\r\n\r\nWe are going to go ahead and close this issue out.\r\n\r\nIf you are still experiencing an issue here, please reach out to support.\r\n\r\n ","author":"Ron Sharon-Zipser"}]},{"summary":"When typing in a card description that has more than 80 lines in it, the typing cursor starts to lose focus","key":"TRELLO-902","url":"https://jira.atlassian.com/browse/TRELLO-902","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen typing in a card description that has more than 80 lines in it, the typing cursor starts to lose focus, shifting up and down.\r\nThis is reproducible on Data Center: Yes\r\nh3. Steps to Reproduce\r\n # Create a description that has more than 80 lines in a card\r\n # start typing below those lines\r\n\r\nh3. Expected Results\r\nThe cursor follows the path and the experience is not affected.\r\n\r\nh3. Actual Results\r\n\r\nThe cursor shifts up and down, losing focus of what's being written.\r\n\r\nh3. Workaround\r\nCurrently, the best workaround would be creating a separate card.","createDate":"2025-01-03T16:26:13.000+0000","comments":[{"text":"This issue was fixed in the 2025.5 version of the Trello iOS app.\r\n\r\nClosing this issue out now. ","author":"Ron Sharon-Zipser"}]},{"summary":"iOS: Pressing return while editing custom field creates line break","key":"TRELLO-775","url":"https://jira.atlassian.com/browse/TRELLO-775","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nerrant line break in custom fields \r\nh3. Steps to Reproduce\r\n # add a text custom field\r\n # place the cursor anywhere but the end of the text \r\n # press return\r\n\r\nh3. Expected Results\r\n\r\nA custom field is created with no line break\r\nh3. Actual Results\r\n\r\na line break is created in a custom field \r\nh3. Workaround\r\n\r\n!Screenshot 2024-11-01 at 3.39.25 PM.png! move the cursor to the end of the text after editing the custom field ","createDate":"2024-11-01T20:39:57.000+0000","comments":[{"text":"Fixed and released in the 2025.1 version of the Trello iOS app.","author":"Ron Sharon-Zipser"}]},{"summary":"Unable to change start of week in the Custom Fields date picker","key":"TRELLO-770","url":"https://jira.atlassian.com/browse/TRELLO-770","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe date picker for Custom Fields on cards doesn't respect the language setting from the Atlassian Account. Sunday is always shown as the first day of the week regardless of which language is set.\r\nh3. Steps to Reproduce\r\n # Set language on your Atlassian account to English UK\r\n # Add a date Custom Field to a board in Trello\r\n # Open a card on that board\r\n # Open the Due date picker (week starts on Monday)\r\n # Open the date picker for the custom field (week starts on Sunday)\r\n\r\nh3. Expected Results\r\n\r\nThe date picker for Custom Fields should respect the language setting and alter the day the week starts on.\r\nh3. Actual Results\r\n\r\nThe Custom Field date picker always shows Sunday as the first day of the week.\r\nh3. Workaround\r\n\r\nNo workaround available","createDate":"2024-11-01T10:34:43.000+0000","comments":[]},{"summary":"Pasting an image via Clipboard on iOS app results to indefinite loading","key":"TRELLO-735","url":"https://jira.atlassian.com/browse/TRELLO-735","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis works in Android so the bug only exists in iOS app. \r\nh3. Steps to Reproduce\r\n # Copy an image from the internet\r\n # On iOS app, open a card and click paperclip icon to add an attachment\r\n # Select Clipboard option\r\n\r\nh3. Expected Results\r\n\r\nAn image will be uploaded\r\nh3. Actual Results\r\n\r\nThere is a loading icon that takes forever, but the image will still be uploaded. \r\n!IMG_8614.png|width=359,height=777!\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. The only way to stop the loading behavior is to force close the app. But the image will still be uploaded.","createDate":"2024-10-15T06:26:03.000+0000","comments":[]},{"summary":"Using the Cut shortcut (Cmd + X) on a comment or description with formatted text will paste that Card URL instead","key":"TRELLO-698","url":"https://jira.atlassian.com/browse/TRELLO-698","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen attempting to cut (using Command+X) a hyperlink from a card comment, the clipboard stores the card's URL instead of the original hyperlink. There is another scenario below when a description is cut (using Command+X), the clipboard only stores the card's URL instead of the card description. Both of these scenarios only happen when the starting text is formatted in any way (heading text, italic, bold, ordered or undordered list, code block, strikethrough, hyperlink). Unformatted text does not have this issue. \r\nh3. Steps to Reproduce (Command+X a hyperlink in a comment)\r\n # Create a card and add a comment containing a hyperlink.\r\n # Highlight the URL by dragging your cursor over it.\r\n # Use Command+X or right-click and select \"Cut\" to remove the hyperlink.\r\n # Paste the contents of the clipboard into any text field to view the result.\r\n\r\nThis message pops-up when cutting the link:  !image-2024-10-02-10-15-22-996.png|width=426,height=107!\r\nh3. Expected Results\r\n\r\nThe original hyperlink should be removed from the comment and available for pasting elsewhere.\r\nh3. Actual Results\r\n\r\nThe hyperlink is removed from the comment, but pasting results in the Trello card URL instead of the intended hyperlink.\r\n\r\nIssue reproduced: [^Screen Recording 2024-10-02 at 10.07.21.mov]\r\nh3. Workaround\r\n\r\nUse the \"Copy\" function instead of \"Cut\" to retain the original hyperlink for pasting.\r\nh1. ^Another scenario:^\r\n\r\nAnother scenario for the same bug when a description is cut from the card.\r\nh3. Steps to Reproduce (Command+X a formatted text in the description)\r\n\r\n1. Open an existing card.\r\n2. Click in the description area\r\n3. Select some text in that description. The first word in the selection must be bold.\r\n4. Perform a command-x to cut that text\r\nh3. Expected Results\r\n\r\nThe text will disappear (as it should), and when you paste the description to another card, it should paste the exact text that you cut from the original card. \r\nh3. Actual Results\r\n\r\nThe text will disappear (as it should), but you'll see a popup message on the bottom left of the browser window that says \"{*}Card Copied to Clipboard{*}\"\r\n\r\nIf you then paste the contents of the clipboard, you'll actually be pasting the card link, and the text you cut will be gone. \r\nh3. Workaround\r\n\r\nUse the \"Copy\" function instead of \"Cut\" to retain the original description for pasting.","createDate":"2024-10-02T13:19:07.000+0000","comments":[{"text":"The description of this bug and the title do not correlate. The title is accurate to an issue I had, and was referenced by a support rep as a relevant issue. But the description here describes copying a URL from a comment.\r\n\r\nThe titular issue affected me recently as I had attempted to cut and paste the entire contents of the description of one card into another card. The result of the paste action is a link to the source card rather than the contents of the clipboard from the cut action.\r\n\r\nIt's problematic because after having performed the cut command, saved the card, and then performed the paste command in another card, the contents were presumed to be unrecoverable.\r\n\r\nI found this third-party resource that helped me recover the contents of the lost description: [https://foreverhungry.dev/posts/2021-11-24-restore-trello-card-description/]\r\n\r\nAdditionally, depending on the complexity of the description, the contents of the description do not paste properly when using CTRL + V. The actual work around is to use CTRL + SHIFT + V.","author":"DewmGuy"}]},{"summary":"Copying a card with custom fields removes the Custom Fields - already created ones and button to include","key":"TRELLO-657","url":"https://jira.atlassian.com/browse/TRELLO-657","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen you have some custom fields on a given board and copy a card from that board to another one, the button to access the Custom fields are removed from the Board menu and the Card back.\r\nThis is reproducible on Data Center: Yes\r\nh3. Steps to Reproduce\r\n* Create a board A\r\n* Create a list and a card\r\n* Create 4 or 5 different Custom fields\r\n* Create a new board B\r\n* Move the card from board A to board B\r\n\r\nh3. Expected Results\r\nYou see the custom fields, and the custom fields button after moving.\r\nh3. Actual Results\r\nInitially, the button and the custom fields are missing from the board.\r\n\r\nh3. Workaround\r\nFrom testing it internally, you can either:\r\n\r\n* Refresh the browser a few times using cmd + r or ctrl + r\r\n* Reset the browser cache\r\n* Access in incognito window","createDate":"2024-09-16T21:01:45.000+0000","comments":[]},{"summary":"My Cards view not properly displaying all overdue cards","key":"TRELLO-26","url":"https://jira.atlassian.com/browse/TRELLO-26","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nUsers are experiencing inconsistencies in the display of cards with the same name, across different lists and boards, in the new My Cards view, A performance issue arises in scenarios involving a large number of cards. The system limits the display to a maximum of 500 cards, potentially affecting the visibility of cards in the My Cards view.\r\nh3. Steps to Reproduce\r\n # Have a board with several cards assigned to you, some with identical names in lists that are similarly named but in different boards.\r\n # Some of these cards may share due dates.\r\n # Attempt to view these cards in the My Cards view.\r\n\r\nh3. Expected Results\r\n\r\nAll assigned cards should be visible in the My Cards view, regardless of the total number of cards on the board.\r\nh3. Actual Results\r\n\r\nCertain cards assigned to the user are not displayed in the My Cards view.\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available.","createDate":"2024-03-01T20:24:21.000+0000","comments":[{"text":"Hi Nathan can you please help with Planyway via Trello  it is not loading.","author":"Kathy"},{"text":"Hello,\r\n\r\nI would like an update on this ticket ASAP. We have been paying for a product now for 9 months that is not working properly because of the above bug. My ticket numbers are as we follow:\r\n\r\nTRELLO-208102\r\n\r\nTRELLO-208596\r\n\r\nCA-3308450 \r\n\r\nPlease get back to me ASAP as I believe we are owed money due to this product not working and you forcing us to pay for it.\r\n\r\nThanks!","author":"Andrew Haberberger"},{"text":"Hello - I am looking for an update on this ticket. Please reach out ASAP.\r\n\r\nTRELLO-208102\r\n\r\nTRELLO-208596\r\n\r\nCA-3308450 ","author":"Andrew Haberberger"},{"text":"The engineering team is actively investigating the problem and working on a resolution. We understand your frustration and apologize for any inconvenience this may be causing. \r\n\r\nWe anticipate deploying a fix in mid-January due to the holiday change freeze period. We'll provide another update as soon as we have more specific information to share. ","author":"Jinhuan Lei"},{"text":"The engineering team pushed a fix, and we adjusted the strategy to prioritize cards with recent activity for display on the page.","author":"Jinhuan Lei"}]},{"summary":"Clicking \"upload logo\" button during quick-setup of a new page doesn't work","key":"STATUS-972","url":"https://jira.atlassian.com/browse/STATUS-972","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen creating adding a new page, the 2nd step of quick-setup asks customer to upload their logo. However when they click on the \"upload logo\" button, nothing happens.\r\n\r\nBrowser console logs show:\r\n{code:java}\r\nraven.js:447 Uncaught n {text: 'API Key not found', toString: ƒ} d @ raven.js:447 {code}\r\nh3. Steps to Reproduce\r\n # Add a new page in Statuspage\r\n # Skip the add component by clicking next.\r\n # Click \"Upload Logo\" button\r\n\r\nh3. Expected Results\r\n\r\nAbility to upload logo during quick-setup\r\nh3. Actual Results\r\n\r\nThe below exception is thrown in the browser debug console window when the Upload Logo is clicked:\r\n{noformat}\r\nraven.js:447 Uncaught\r\nn {text: 'API Key not found', toString: ƒ}\r\nd @ raven.js:447 {noformat}\r\nh3. Workaround\r\n\r\nSkip the upload logo during quick-setup by clicking next instead, and use the \"customize page and emails\" option to upload a logo.","createDate":"2025-03-28T01:54:02.000+0000","comments":[]},{"summary":"Incident : Heading not defined","key":"STATUS-970","url":"https://jira.atlassian.com/browse/STATUS-970","type":"Bug","priority":"","description":"h3. Issue Summary\r\nThe text elements such as \"www.npmjs.com website, \"Package installation \", \"Package publishing\", \"Package search \" and so on are not defined using heading markup.\r\n\r\nh3. Steps to Reproduce\r\n\r\n# Open Url:https://status.npmjs.org/ and sign in with valid credentials.\r\n# Scroll down to the \"Uptime\" section.\r\n# Scroll down to the \"Past Incidents\" section.\r\n# Navigate onto the mentioned element and observe that it is not defined\r\n# Inspect its source code.\r\n\r\nh3.Screenshot\r\n\r\n\r\nh3. Actual Results\r\nThe heading element used to convey the page structure, there are few text elements which is lacking html heading mark-up.\r\nThe text \"www.npmjs.com website, \"Package installation \", \"Package publishing\", \"Package search \"  and so on are not defined using heading markup.\r\nThis resulted in screen reader users finding it difficult to understand the page content structure.\r\n\r\nh3. Expected Results\r\nMark up the mentioned text using appropriate HTML headings. In addition, use heading levels as per specification such as <h1> should be followed by <h2>, <h3> and so on.\r\n\r\nh3.Code Snippet\r\n{code:java}\r\n<h3>Package installation</h3>\r\n{code}\r\n\r\nh3.Environment\r\nMacBook Pro (14-inch, 2021)\r\nmacOs Ventura  13.3.1 (a) (22E772610a)\r\nChrome - Version 113.0.5672.63 (Official Build) (64-bit)\r\nFirefox- Version 92.0 (64-bit)\r\nSafari- Version 16.4 (18615.1.26.110.1)\r\nJAWS- Version 2021\r\nNVDA- Version 2021.2\r\nVoiceover - Version Latest\r\n\r\n\r\nh3. Workaround\r\n Currently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-27T04:38:49.000+0000","comments":[]},{"summary":"Webhook Payload Missing \"Manage Subscription\" Link","key":"STATUS-969","url":"https://jira.atlassian.com/browse/STATUS-969","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nOn other subscriptions (e.g. Email), if the page has component subscriptions enabled, the notification contains a link to manage the subscription (https://<pageurl>/subscriptions/<subscriberID>/edit) - this allows the receiver to update the components selected for that subscription method. \r\n\r\n>> this is expected as per [https://support.atlassian.com/statuspage/docs/enable-component-subscriptions/] \r\n\r\nHowever, this link is missing in the payload sent to Webhooks. This means a webhook subscriber is unable to easily update their subscription without knowing to copy their subscriber ID from the unsubscribe link, and use it in the above link instead. \r\nh3. Steps to Reproduce\r\n # Ensure page has \"Component Subscriptions\" enabled \r\n # Add a webhook subscriber \r\n # Create/update an incident \r\n # Check the payload sent to the webhook and notice it is missing the edit subscription link that is present in email \r\n\r\nh3. Expected Results\r\n\r\nFor the payload sent to the webhook endpoint to also contain the \"Edit Subscription\" link \r\nh3. Actual Results\r\n\r\nWebhook payload does NOT contain the \"Edit Subscription\" link \r\nh3. Workaround\r\n # Look at the \"unsubscribe\" link to find the webhooks subscriber ID (this is included in the webhook payload)\r\n ** It can be found here: \"unsubscribe\":\"http://<pageURL>/?unsubscribe=<{+}*subscriberID*{+}>\r\n # Formulate the edit subscription link which looks like this: https://{+}*<pageurl>*{+}/subscriptions/{+}*<subscriberID>*{+}/edit","createDate":"2025-03-27T03:43:47.000+0000","comments":[]},{"summary":"Users with the product admin role cannot add new pages","key":"STATUS-859","url":"https://jira.atlassian.com/browse/STATUS-859","type":"Bug","priority":"","description":"h3. Issue Summary\r\nAs per https://support.atlassian.com/statuspage/docs/what-user-permissions-can-i-grant/ a product admin should be able to add a new page. When checking it, product admins are not able to do so, as the option is missing. \r\n\r\nBeing a member of a \"product-admin\" group wasn't sufficient to add a new page within the org. Only after added the user to the \"org-admin\" group the \"+\" sign was visible\r\n\r\nh3. Steps to Reproduce\r\n # As a product admin, navigate to manage.statuspage.io;\r\n # Click on the page to be able to add a new page.\r\n\r\nh3. Expected Results\r\n# There should be an option to add a another page, as product admins should be able to do that. \r\n\r\nh3. Actual Results\r\n# The option is missing\r\n\r\n\r\nh3. Workaround\r\n\r\nAdd product admin as a billing admin","createDate":"2024-09-03T07:30:05.000+0000","comments":[]},{"summary":"Resizing the pane doesn't work, if there is a vertical scrollbar on the commit detail pane","key":"SRCTREEWIN-14539","url":"https://jira.atlassian.com/browse/SRCTREEWIN-14539","type":"Bug","priority":"","description":"Hello, SourceTree support,\r\n\r\n \r\n\r\nI pretty much enjoy using the SourceTree for my daily git works and thanks for making such a good product!\r\n\r\n \r\n\r\nJust one small problem that makes me uncomfortable is that resizing the pane by dragging the border doesn't work, if there is a vertical scroll bar on the right side of the commit detail pane.\r\n\r\nI wasn't sure when this symptom happens, but luckily found how to reproduce it while writing this ticket. :)\r\n\r\nCould you please investigate and fix it? It would be a great help. Thanks!\r\n\r\n \r\n\r\n!image-2025-03-31-17-31-04-975.png!\r\n\r\n ","createDate":"2025-03-31T08:38:11.000+0000","comments":[{"text":"It looks that I can't add a screenshot to the issue description.\r\n\r\nCould you please tell me how I can provide a screenshot with a description?\r\n\r\n ","author":"Oliver Cho"},{"text":"Hi [~caf5b4825f0f] , \r\n\r\nPlease upload screenshots using any of the below links.\r\n\r\n[https://postimages.org|https://postimages.org/] \r\n[https://pasteboard.co|https://pasteboard.co/]\r\n**\r\n\r\n \r\n\r\nThanks,\r\n\r\nReetika","author":"Reetika Narula"},{"text":"Oh, thanks [~73ddb60f0fdb] for letting me know the method.\r\n\r\nPlease check this image.\r\n\r\n!https://i.postimg.cc/90Jmfh8P/Pane-Resizing-Issue.png!","author":"Oliver Cho"}]},{"summary":"Unable to delete a Rovo org level entitlement, if multiple org level entitlements are connected to single site","key":"ROVO-120","url":"https://jira.atlassian.com/browse/ROVO-120","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is an edge case: If a site instance of Rovo gets associated with Multiple org-level instances, it's not possible to delete the unwanted org-level instances.\r\nh3. Steps to Reproduce\r\n # Activate a trial of Rovo on a site in an organisation.\r\n # Transfer the site from one org to the other. (Org consolidation)\r\n # Cancel the trial.\r\n # Try to activate the Rovo again.\r\n # Rovo will not get activated. But an Org-level instance will be created.\r\n # This will happen for each retry, leaving empty org-level instances.\r\n # When Rovo gets activated, the site-level instance will get associated with all these org-level instances.\r\n\r\nh3. Expected Results\r\n\r\nThe unwanted org-level instances can be deleted safely.\r\nh3. Actual Results\r\n\r\nThe unwanted org-level instances can't be deleted as they're all related to the site-level instance.\r\nh3. Workaround\r\n\r\nMake sure to cancel the Rovo subscription, before the org consolidation.","createDate":"2025-03-28T12:17:41.000+0000","comments":[]},{"summary":"Rovo is unable to find similar issues in Jira","key":"ROVO-109","url":"https://jira.atlassian.com/browse/ROVO-109","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen asked to find similar issues to a Rovo agent in Jira, it is unable to locate them, even though similar issues exist.\r\n\r\nh3. Steps to Reproduce\r\n # Create two identical issues in Jira \r\n# Create a Rovo agent in Jira\r\n # In the description, add instructions such as 'find similar bugs in the same Jira project'.\r\n# Add the *Find similar issues* action to the agent\r\n# Once the agent is setup, open one of the Jira issues and ask the agent to find similar issues\r\n\r\nh3. Expected Results\r\nAgent lists similar issues.\r\n\r\nh3. Actual Results\r\n\r\nAgent displays the message 'Sorry, I couldn't find any issues that matched your search criteria'\r\n\r\nUpon manually comparing the issues Rovo is able to find them similar.\r\n\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-11T08:50:19.000+0000","comments":[]},{"summary":"Saving a create rule on integration on the Integration SalesForce throws the error Property [clientId] cannot be empty","key":"OPSGENIE-2515","url":"https://jira.atlassian.com/browse/OPSGENIE-2515","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nUnable to save the Create Alert Rule on the Integration SalesForce Service Cloud. We are getting an error saying \"Something is wrong Property [clientId] cannot be empty.\"\r\nh3. Steps to Reproduce\r\n # Go to Settings -> Integrations -> SalesForce Service Cloud-Test1 -> Edit the Create Alert Rule -> Click on the Save button\r\n\r\nh3. Expected Results\r\n\r\nThere should not be any error.\r\nh3. Actual Results\r\n\r\nThe below exception is thrown in the xxxxxxx.log file:\r\n{noformat}\r\nProperty [clientId] cannot be empty\r\n{noformat}\r\nh3. Workaround\r\n\r\nUse the web UI to create the integration instead of using the REST API for creating the integration ","createDate":"2025-04-01T14:55:30.000+0000","comments":[]},{"summary":"Saving a create rule on integration blocked due to outgoing auth settings not setup","key":"OPSGENIE-2514","url":"https://jira.atlassian.com/browse/OPSGENIE-2514","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nCustomers with integrations where outgoing authentication turned off are running into an issue with saving the integration\r\nh3. Steps to Reproduce\r\n # Locate an old integration with outgoing authentication turned off\r\n # Try saving an integrations create rule by adding a \"test\" tag for example\r\n # observe error \r\n\r\nFull replication can be viewed: [https://app.screencast.com/Liyxwx1SZt63e] \r\nh3. Expected Results\r\n\r\nWith outgoing authentication turned off for the third party it should allow you to save a create rule without complaining about authentication fields set\r\nh3. Actual Results\r\n\r\nUpon trying to save an integration create rule there will be a screenshot displayed demonstrating an error and preventing saving.\r\nh3. Workaround\r\n\r\nIf receiving an error while saving a create rule under the integration you can solve the issue by turning on outgoing authentication,saving, and then turning back off. Feel free to reach out to support.atlassian.com if any issues encountered and follow along with this bug for updates from engineering. Thanks!\r\n\r\nFull work-around can be viewed here: [https://app.screencast.com/Liyxwx1SZt63e] ","createDate":"2025-03-31T18:01:58.000+0000","comments":[]},{"summary":"Opsgenie Subscription plan information is sometimes reflected incorrectly in Atlassian Admin hub","key":"OPSGENIE-2263","url":"https://jira.atlassian.com/browse/OPSGENIE-2263","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nOpsgenie Subscription plan is sometimes showing up as a different plan for the same customer in the Products page in Atlassian Admin hub for the Opsgenie product.\r\nh3. Steps to Reproduce\r\n # Check Opsgenie Settings > Subscription for the customer's Opsgenie plan and user license count\r\n # Check Atlassian Admin hub > Overview or Products pages for the same customer's Opsgenie plan\r\n\r\nh3. Expected Results\r\n\r\nExpecting the Opsgenie subscription plan information to be reflected correctly in the Atlassian Admin hub.\r\nh3. Actual Results\r\n\r\nSometimes, the Atlassian Admin hub shows inaccurate Opsgenie plan information.\r\nh3. Workaround\r\n\r\nFor the Opsgenie product, the correct subscription plan information is found within Opsgenie Settings > Subscription","createDate":"2024-07-25T16:16:41.000+0000","comments":[{"text":"Hi All, \r\n\r\nThis is Deeksha from the product team. We understand that this is something that can lead to confusion and must be synced with admin.atlassian, however the team has added this item to the backlog and for now this will be revisited in 4-6 months. \r\n\r\nWe hope that the current workaround to refer to opsgenie subscription details from the product itself can provide all necessary details.","author":"Deeksha"}]},{"summary":"Forge apps cannot be added to sandbox site for free even when they are already added to production site","key":"MP-329","url":"https://jira.atlassian.com/browse/MP-329","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen customers try to add an app developed with the Forge framework to a sandbox site(via Marketplace) that has already been added to the production site and is paid subscription, they don't see the \"Add to sandbox\" option. Instead, they only get the Trial version option.\r\n\r\nThis only applies to Forge-based apps, Connect-based apps do get the \"Add to sandbox\" option and can be used for free in the sandbox as long as they are installed in the production site as well.\r\n\r\n*Important NOTE:* The issue is *only* with the front end, and the backend rightly recognises the app as already paid in production, thus a free *Standard Sandbox* offering is provisioned for forge apps as well. However, in the UI, we don't get the \"Add to sandbox\" option.\r\nh3. Steps to Reproduce\r\n # Install any forge app to a production site - Ex. Planning Poker\r\n # Open the sandbox site and go \"Find new apps\" and try to add the same app.\r\n # Observe that you get only the \"Free Trial\" button.\r\n\r\nh3. Expected Results\r\n\r\nCustomers should see the \"Add to Sandbox\" button when trying to add the app to the sandbox site.\r\nh3. Actual Results\r\n\r\nWe only see the \"Free Trial\" option.\r\nh3. Workaround\r\n\r\nCurrently, there is no known workaround for this behaviour. A workaround will be added here when available","createDate":"2025-03-20T15:28:10.000+0000","comments":[{"text":"This is the related to Marketplace team. Please reachout to channel [#help-marketplace-upm|https://atlassian.slack.com/archives/CFKUKLUVD]","author":"Abhishyam Chennayipalem"}]},{"summary":"Funnel insights: app_id bug fix","key":"MP-328","url":"https://jira.atlassian.com/browse/MP-328","type":"Bug","priority":"","description":"h3. Issue Summary:\r\n\r\nFor months after Aug 24, the reports generated with funnel insights API are showing installs that happen through EMECC and not able to show the installs done through MPAC portal.","createDate":"2025-03-20T19:30:11.000+0000","comments":[{"text":"Hey @Rodrigo Morette \r\n\r\nthe issue has been fixed, and data has been backfilled  ","author":"Manuj Bhatia"},{"text":"Fix deployed","author":"Vijay S"}]},{"summary":"Space Key not working when typing in under request for Addon","key":"MP-326","url":"https://jira.atlassian.com/browse/MP-326","type":"Bug","priority":"","description":"h3. Issue Summary:\r\nSpace Key not working under Add-On request\r\n \r\nh3. Steps to Reproduce\r\n# In cloud Jira use menu Apps → Explore more apps.\r\n# Find an app that is not installed, click on it.\r\n# Click on \"Try it free\".\r\n# In the \"Request to install\" dialog press cmd+a to select all, backspace to delete selection. \r\n# Try to type in a new request. Try to type in \"want to use addon\" (do it with typing, not copy/paste). Space bar does not work for word separation. \r\n\r\nh3. Expected Results\r\nSpace key should work when typing in under request for an Add-on\r\n\r\nh3. Actual Results\r\nSpace Key not working under Add-On request\r\n\r\n\r\nh3. Workaround\r\nAs a temporary workaround, go back in the middle of typed text and press Space.","createDate":"2025-03-20T15:05:28.000+0000","comments":[{"text":"I assume it has to do with trailing space truncation. Should be done on submit, not while typing. Not a breaking bug, but very visible and very annoying.","author":"Jānis Vanags"}]},{"summary":"Incorrect licenseType, status and maintenanceEndDate for some migrated sandbox licenses","key":"MP-319","url":"https://jira.atlassian.com/browse/MP-319","type":"Bug","priority":"","description":"h3. Issue Summary:\r\n\r\nWe are observing the incorrect values in the [License API|https://developer.atlassian.com/platform/marketplace/rest/v2/api-group-reporting/#api-vendors-vendorid-reporting-licenses-get] for licenseType, status and maintenanceEndDate fields in certain cases where sandbox licenses are migrated from old billing system to new billing system.\r\nh3. Steps to Reproduce\r\n # Get the license detail for the migrated sandbox licenses using Marketplace reporting license API\r\n # Verify licenseType, status and maintenanceEndDate fields are incorrect.\r\n\r\nh3. Expected Results\r\n\r\n       If any active sandbox license is migrated to the new billing system, the license type should be shown as 'Free' and the status as 'Active,' without any maintenance end date.\r\nh3. Actual Results\r\n\r\n     We have seen in some cases where migrated sandbox licenses are showing inactive status with licenseType as COMMERCIAL and older maintenanceEndDate     \r\nh3. Workaround\r\n\r\nNot available at the moment","createDate":"2025-03-14T06:25:03.000+0000","comments":[{"text":"Deployed to production","author":"Vijay S"}]},{"summary":"Feedback and review notification emails are not being sent from Marketplace","key":"MP-302","url":"https://jira.atlassian.com/browse/MP-302","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe email notifications from the Marketplace are not being sent to the partner on different occasion.\r\nh3. Steps to Reproduce\r\n # App uninstalled by the customer. \r\n # The feedback email which is sent to the app owner is not sent.\r\n # Also the same with app review\r\n\r\nh3. Expected Results\r\n\r\nOnce the app is uninstalled and customer gives a feedback, the partner should receive an email.\r\nh3. Actual Results\r\n\r\nThe emails are not triggered.\r\nh3. Workaround\r\n\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-02-18T11:44:50.000+0000","comments":[{"text":"It will be very useful to add a report in marketplace.atlassian.com so that we can view the list of feedbacks and reviews from a single page","author":"Hua Soon SIM [Akeles]"},{"text":"[~c26e17239a7a] I found \"Reports\" > \"Feedback details\" in the Marketplace vendor profile quite helpful. It bundles uninstallation feedback from all apps.","author":"Almuth Boehme [Communardo]"},{"text":"Thanks Almuth :D \r\nThat is useful.\r\n\r\nI will be very happy if a Review details can be added as well.\r\n\r\nFor the benefit of others, the Marketplace team has announced\r\n{panel:title=https://developer.atlassian.com/platform/marketplace/changelog/#CHANGE-2354}\r\nWe have identified an issue within our system that resulted in the absence of customer feedback on churn events via the Feedback APIs between January to February 2025.\r\n\r\nThis issue has now been resolved, and consequently, 167,332 customer feedback records will be made available across all partners. These customer feedbacks were generated during the period from August 2020 to the present date. Effective Feb 20, 2025, partners will gain access to customer feedback regarding churn events from both historical and current feedback through reporting, as well as via the following APIs\r\n{panel}","author":"Hua Soon SIM [Akeles]"},{"text":"I have not noticed emails arriving for feedback again. The marketplace reports tab does show feedback, but seems to omit the message (which is the most helpful part). I'm not sure this is actually fixed yet...","author":"Adam Ahmed"},{"text":"This may be related to ECOHELP-58300 additionally [https://ecosystem.atlassian.net/servicedesk/customer/portal/34/ECOHELP-58300]\r\n\r\n(No auto-links for issues? Can't recall if we had that b/w JAC and EAN during my tenure...)","author":"Nick Wade -Opus Guard-"},{"text":"Could you please provide an update on the timeline for resolving this issue? We appreciate the access to feedback on the marketplace; however, it hasn't completely addressed our concerns. Our support depends heavily on the feedback emails we receive, and the current blockage in this process has created some challenges for us. We would greatly appreciate your assistance in facilitating a resolution. Thank you!","author":"Diana Białoskórska"},{"text":"Looking for updates on this, too :)","author":"Britta Neugebauer [yasoon]"},{"text":"HI there, \r\n\r\nWe have not received any customer installation notices of our apps since the start of the year. Is this issue still ongoing?\r\n\r\nSteve","author":"Steve Morrell"},{"text":"The bug has been fixed","author":"Anjali Chawla"},{"text":"Hello,  \r\n\r\nWe are still not receiving feedback emails, and I would like to confirm whether this issue is still ongoing. Please provide an update. Thank you.\r\n\r\nDiana","author":"Diana Białoskórska"},{"text":"Hello [~achawla@atlassian.com]\r\nWe have also not received any email notifications. Has the fix you mentioned been deployed?","author":"Mattia (bitvoodoo ag)"},{"text":"Still no emails here ... thanks for investigating.","author":"Almuth Boehme [Communardo]"},{"text":"This issue is fixed now. You will be getting the email notifications from now. ","author":"Adarsh Kashyap"}]},{"summary":"AnonPermission preflight shows blank description in saved plan when JCMA or Jira restarted","key":"MIG-2226","url":"https://jira.atlassian.com/browse/MIG-2226","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen running JCMA preflight, sometimes the AnonPermission preflight check description on UI is blank. However on refresh it gets updated.\r\n\r\nThis happens when either JCMA is disabled/uninstalled or Jira instance restarted, and checking the details of an existing plan.\r\n\r\n!image (11).png|width=374,height=205!\r\n\r\n \r\n\r\nAll versions post JCMA 1.12.12 are potentially impacted\r\nh3. Steps to Reproduce\r\n # Create a plan in JCMA, run preflights and save plan.\r\n # Disable JCMA and then enable again.\r\n # Check the saved plan details and blank description will be there.\r\n\r\nh3. Expected Results\r\n\r\nAnonPermission should have a description message present like the other preflights.\r\nh3. Actual Results\r\n\r\nThe description is blank.\r\n\r\n*Cause:*\r\n\r\nThis happens because dashboard check was added recently in AnonPermission and UI message was updated to reflect the same. This message change is also behind a FeatureFlag. When JCMA is restarted, the in memory cache gets reset. So when checking ViewDetails, JCMA relies on getting response again from preflightCheck, but since its behind an FF and FF is not set when directly checking Plan Details, the string remains empty and UI does not show anything.\r\nh3. Workaround\r\n\r\nRefreshing the page or preflight resets the message correctly.\r\n\r\n ","createDate":"2025-04-01T05:45:22.000+0000","comments":[]},{"summary":"'Hide completed issues older than' field is not migrated along with boards ","key":"MIG-2225","url":"https://jira.atlassian.com/browse/MIG-2225","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe field in the Board configuration 'Hide completed issues older than' is not migrated from Server to Cloud migration.\r\nh3. Steps to Reproduce\r\n # Create a Kanban board and Configure it\r\n # In Board Configuration -General, Select a value for 'Hide completed issues older than' ({*}say 4 weeks{*})\r\n # Migrate the Project along with the Board\r\n # Post-migration, in the cloud the field is referred to as  \"Completed issues\" and the value for \"Choose how long completed issues stay on your board\" is by default set to *\"2 weeks\"*\r\n\r\nh3. Expected Results\r\n *  The value for 'Hide completed issues older than'  should be migrated as set in the server\r\n\r\nh3. Actual Results\r\n *  The value \"Completed issues\" is not migrated and is set to the default value of \"2 weeks\" in the cloud \r\n\r\nh3. Workaround\r\n\r\nCurrently, there is no known workaround for this behaviour. A workaround will be added here when available","createDate":"2025-03-28T15:09:08.000+0000","comments":[]},{"summary":"\"Copy production data\" timer is not accurate","key":"MIG-2213","url":"https://jira.atlassian.com/browse/MIG-2213","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen copying production data, especially large ones, the timer does not represent the actual time to complete the whole cloning.\r\nh3. Steps to Reproduce\r\n * Go to [admin.atlassian.com|http://admin.atlassian.com/] Select your organization if you have more than one.\r\n * Select Products > Sandbox.\r\n * Under Actions in the product table, select Copy production data.\r\n * Choose copy with media files or without media files, select Copy data.\r\n\r\nRelated docs of the feature:\r\n[Manage product sandboxes|https://support.atlassian.com/organization-administration/docs/manage-product-sandboxes/]\r\n[Early access feature|https://support.atlassian.com/organization-administration/docs/early-access-feature/]\r\nh3. Expected Results\r\n * The timer should accurately represent the time for the process to complete.\r\n\r\nh3. Actual Results\r\n * Timer does not represent time to completion accurately and may present users with a wrong estimate\r\n\r\nh3. Workaround\r\n\r\nCurrently, there is no known workaround for this behavior. A workaround will be added here when available\r\n\r\n \r\n\r\nAs discussed with @[vjadhav|mailto:vjadhav@atlassian.com] and [~0da2b4edb1fb] \r\n\r\nMCS team fixed the case where estimated time with attachment is turning out lower compared to estimated time without attachment which was a bug in estimation functionality. \r\n\r\nIt is important to note that the estimated time is only an approximation and cannot be made 100% accurate. The actual migration involves factors that cannot be predicted in advance. As a follow-up action, we can request the team responsible for the UI to add a disclaimer indicating that the estimated times might not be entirely accurate and are intended solely as an estimate. So as to not cause any confusion to customer. ","createDate":"2024-02-13T06:21:20.000+0000","comments":[{"text":"Hi [~646205eda384] ,\r\nCan you please reach out to the MCS team?\r\nsince they have an ML model to get the estimates and it might not be working well.","author":"Aksh Patel"},{"text":"I have asked MCS team to assign this ticket to themselves: [https://atlassian.slack.com/archives/C05T2QT3DR9/p1741689439652449]","author":"Sonal Gupta"},{"text":"[~646205eda384] Can you please move this ticket from *CLOUD* to *MIG* and update the component to `{*}Jira - Migration Assistant - Users and Groups Migration Import{*}` as this belongs to Migration platform team -> MCS. \r\n\r\nThanks","author":"Akshay Gupta"},{"text":"Work is in progress for this and will publish PR by today EOD","author":"Manish Richhariya"},{"text":"Refer the comment section for the root cause of the issue : https://hello.jira.atlassian.cloud/browse/HIKARI-672","author":"Manish Richhariya"},{"text":"PR for fix is merged. [https://bitbucket.org/atlassian/migration-catalogue/pull-requests/1699/diff]\r\n\r\nIt is to fix case where estimated time for migration with attachment will be less than estimated time of migration without attachment. We have to verify on prod once the change is deployed over prod. As appeared from below logs. \r\n\r\n!image (4).png!\r\n\r\n ","author":"Manish Richhariya"},{"text":"[~06eb947e2f93] The reporter of the issue's profile is inactive. Do you know someone who can help us in verifying the fix ? It is an edge case which occurs for specific cloudIds or migration. ","author":"Manish Richhariya"},{"text":"We have deployed the fix which will ensure that estimated time with attachment is more or equal to estimated time without attachment. It is an edge case so we need verification from the customer for the fix. \r\n\r\nThe timer might not fully accurate as it is only an estimate which can be off at times as actual migration have factors which are beyond control and estimation cannot be fully accurate.  We should add a disclaimer if it is creating confusion to the end user. ","author":"Manish Richhariya"}]},{"summary":"Customfield in Trash can cause Link Fixing to Fail","key":"MIG-2212","url":"https://jira.atlassian.com/browse/MIG-2212","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on LMS: Yes\r\nh3. Steps to Reproduce\r\n # Setup a custom field value on an jiraissue as Data Center URL\r\n # Migrate to cloud\r\n # Delete the Customfield migrated to cloud\r\n # Run LMS/Product Link Fixes\r\n\r\nh3. Expected Results\r\n\r\nLMS should ignore customfield in the trash. \r\nh3. Actual Results\r\n{noformat}\r\nThis might be caused by a connection issue or problems on our side. Try updating the links again or contact Atlassian support. {noformat}\r\nh3. Workaround\r\n\r\nReach out to Atlassian support for legacy link fixing via [https://confluence.atlassian.com/confkb/legacy-link-fixing-after-a-successful-server-to-cloud-migration-url-links-are-broken-in-the-new-cloud-instance-1271267903.html] ","createDate":"2025-03-12T11:05:40.000+0000","comments":[{"text":"Hi team, it affects our team. Can you consider this as priority as we are currently struggling to update the production links?","author":"Bharadwaj Jannu"},{"text":"[~faaf6070d1ba] We will pick this task on 3rd April 2025. Hopefully, we will be able to release this before the end of next week.","author":"Akshay Gupta"}]},{"summary":"Doing an upgrade to JCMA 1.12.28 removes old Plans from Migration Dashboard","key":"MIG-2206","url":"https://jira.atlassian.com/browse/MIG-2206","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen you migrate to JCMA 1.12.28 all the Completed plans will disappear from Migration Dashboard. This doesn't impact In progress/Saved plans \r\nh3. Steps to Reproduce\r\n # Do Migrations on a JCMA version before JCMA 1.12.28\r\n # Upgrade to JCMA 1.12.28 \r\n\r\nh3. Expected Results\r\n\r\nPre-existing Plans shouldn't be impacted. \r\nh3. Actual Results\r\n\r\n!Screenshot 2025-03-06 at 11.08.42.png|width=688,height=158!\r\n\r\ngets reset with\r\n\r\n!Screenshot 2025-03-06 at 11.08.52.png|width=749,height=320!\r\nh3. Workaround\r\n\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-06T10:10:32.000+0000","comments":[]},{"summary":"App migration fails from 403 errors from calling migration APIs","key":"MIG-2202","url":"https://jira.atlassian.com/browse/MIG-2202","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center: yes\r\nh3. Steps to Reproduce\r\n # Create a plan in JCMA or CCMA with apps that have an automated migration path\r\n # Start migration \r\n # Remove your use from site admins in target cloud site\r\n # JCMA or CCMA will start throwing 403s and app migration fails\r\n\r\nh3. Expected Results\r\n\r\nJCMA and CCMA can gracefully handle scenarios when users temporarily lose site admin access\r\nh3. Actual Results\r\n\r\nApp migration hard fails. Example logs in this scenario\r\n{noformat}\r\ncom.atlassian.jira.migration.httpclient.exceptions.UnexpectedStatusCodeException: Received an unexpected status code; expected [200], but received 403: {\"timestamp\":\"Feb 13, 2025, 7:01:30PM\",\"status\":403,\"error\":\"Forbidden\",\"path\":\"/api/migration/upload/url\"}\r\nat com.atlassian.jira.migration.httpclient.exceptions.ExceptionsKt.unexpectedStatusCode(Exceptions.kt:9)\r\nat {noformat}\r\nh3. Workaround\r\n\r\nEnsure there are no automation rules that may temporarily remove site admin access for the user performing the migration","createDate":"2025-02-22T03:07:08.000+0000","comments":[]},{"summary":"Projects fail due to race conditions","key":"MIG-2187","url":"https://jira.atlassian.com/browse/MIG-2187","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center:No\r\nh3. Steps to Reproduce\r\n # N/A\r\n\r\nh3. Expected Results\r\n\r\nSuccessful migration should happen when the source data is complete\r\nh3. Actual Results\r\n\r\nEven though a successful export happened, the import fails with errors like\r\n\r\n \r\n{noformat}\r\nproject-import We couldn't import Project XXXXX because it references Permission Scheme 'YYYY: Permission Scheme' which is missing from this migration.\r\n\r\nproject-import We couldn't import Screen Scheme 'XXXX' because it references Screen 'YYYYY' which is missing from this migration. To resolve this, identify and add the missing parent entity on your source site or delete all child entities on your source site and re-run the migration. This caused 3000 other item(s) to fail{noformat}\r\nUpon further investigation it is revealed that the referenced entities are present and are even successfully imported to cloud. \r\n\r\nThere is a timeout during the import process which leads to this error. \r\n\r\n \r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior other than to retry. A workaround will be added here when available","createDate":"2025-02-13T09:46:20.000+0000","comments":[{"text":"The fix for this was rolled out on the 24th of February 2025, following testing and validation. Have not since seen any issues with the same root cause.\r\n ","author":"Maggie Pedersen"}]},{"summary":"Failed project import will not trigger app migrations","key":"MIG-2182","url":"https://jira.atlassian.com/browse/MIG-2182","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center: Yes\r\nh3. Steps to Reproduce\r\n # Create a data shape issue where one of the projects fails. \r\n # Trigger a migration of multiple projects along with apps. \r\n\r\nh3. Expected Results\r\n\r\nProject plan should show failed or incomplete\r\nh3. Actual Results\r\n\r\nProject plan shows in progress and apps never trigger and remain in READY state !image (2).png|width=670,height=183!!Screenshot 2025-02-10 at 12.14.36.png!\r\n\r\n!Screenshot 2025-02-10 at 12.15.37.png|width=531,height=143!\r\nh3. Workaround\r\n\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-02-10T11:17:59.000+0000","comments":[{"text":"If you would like to start app migrations you can create a new plan with only apps and run the migration that way. ","author":"David Yu"},{"text":"We have identified and fixed the issue, with the fix being delivered in the next release.","author":"Adam Miritis"},{"text":"This has now been resolved with JCMA 1.12.28","author":"Adam Miritis"}]},{"summary":"Deleted Issues can cause Link Fixing to Fail","key":"MIG-2129","url":"https://jira.atlassian.com/browse/MIG-2129","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on LMS: Yes\r\nh3. Steps to Reproduce\r\n # Setup a custom field value on a jiraissue as Data Center URL\r\n # Migrate to cloud\r\n # Delete the project and move it to trash.\r\n # Run LMS/Product Link Fixes\r\n\r\nh3. Expected Results\r\n\r\nLMS should ignore issues in trash. \r\nh3. Actual Results\r\n\r\nLMS run will fail with\r\n{noformat}\r\nThis might be caused by a connection issue or problems on our side. Try updating the links again or contact Atlassian support. {noformat}\r\nh3. Workaround\r\n\r\nReach out to Atlassian support for legacy link fixing via [https://confluence.atlassian.com/confkb/legacy-link-fixing-after-a-successful-server-to-cloud-migration-url-links-are-broken-in-the-new-cloud-instance-1271267903.html] ","createDate":"2024-12-03T11:51:12.000+0000","comments":[]},{"summary":"Project Picker custom field values may fail to migrate to Cloud","key":"MIG-2098","url":"https://jira.atlassian.com/browse/MIG-2098","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen migrating with JCMA using projects with issue which contain a \"Project Picker (single project)\", the value may fail to migrate if the referred project in the field hasn't finished migrating.\r\n\r\nReproducible on Data Center: Yes\r\n\r\nh3. Steps to Reproduce\r\n\r\n# Start Jira Server/DC;\r\n# Create the projects:\r\n** Project A (PA)\r\n** Project B (PB)\r\n** Project C (PC)\r\n# Create and associate a custom field \"Project Picker (single project)\" and associate with the 3 projects' screens;\r\n# Create an issue in each project, and fill the Project Picker field as such:\r\n** Issue PA-1, links to PB\r\n** Issue PB-1, links to PC\r\n** Issue PC-1, links to PA\r\n# Migrate all 3 projects to Cloud in the same migration.\r\n\r\nh3. Expected Results\r\n\r\nAll 3 issues have the values of the Project Picker field filled with the values configured on Server/DC.\r\nh3. Actual Results\r\n\r\nAt least one issue will have a blank value for the Project Picker field. Which one isn't deterministic, it depends on which project finished migrating first.\r\n\r\nMathematically, using this field would have a 50% chance at best of the values being populated correctly, which will only happen if the issue with the field is not the first to finish migrating.\r\n\r\nh3. Workaround\r\n\r\nMigrate the custom field values using CSV export/import.","createDate":"2024-11-12T18:32:45.000+0000","comments":[]},{"summary":"JCMA throwing the error statusCode=429 when is selected the method Migrate all data at once (MAO)","key":"MIG-1986","url":"https://jira.atlassian.com/browse/MIG-1986","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center: (yes)\r\nh3. Steps to Reproduce\r\n # In Jira Software, install the plugin JCMA 1.11.7 (the latest version at this moment) and try to migrate using the option *Migrate all data at once (MAO).* \r\n\r\nh3. Expected Results\r\n * Complete the migration successfully.\r\n\r\nh3. Actual Results\r\n # The migration plan is stuck on the Jira server with the status of in progress.\r\n # The migration appears to have been completed successfully on the Atlassian side; however, it was completed in less than one minute, and projects are not transferred (status of ready).\r\n # Even rate limiting is disabled the migration assistant keeps throwing the error statusCode=429\r\n # The below exception is thrown in the atlassian-jira.log or atlassian-jira-migration.log files:\r\n ** \r\n{code:java}\r\n./atlassian-jira.log JCMA-MigrationTracker-pool-4-thread-26 ERROR      [c.a.j.migration.httpclient.ServiceUnavailableBackoffRetryStrategy] Request failed with executionCount=2, maxRetries=5, statusCode=429, xFailureCategory=null \r\n\r\n./atlassian-jira-migration.log ERROR admin 1034x339x1 xns4rs 172.29.239.250,172.50.0.2 /migration-cloud-save-action.jspa [jira.migration.httpclient.ServiceUnavailableBackoffRetryStrategy] Request failed with executionCount=1, maxRetries=5, statusCode=429, xFailureCategory=null {code}\r\n\r\nh3. Workaround\r\n # Downgrade the JCMA version. In the test it was downgraded to the JCMA *1.10.17* version and the migration was successfully completed using the method {*}Migrate all data at once (MAO){*}.\r\n ** [How to install a specific version of the Jira Cloud Migration Assistant|https://confluence.atlassian.com/cloudkb/how-to-install-a-specific-version-of-the-jira-cloud-migration-assistant-1097184512.html]","createDate":"2024-08-07T20:44:54.000+0000","comments":[]},{"summary":"After an instance URL rename, the old URL keeps showing in the product links as a destination","key":"MIG-1951","url":"https://jira.atlassian.com/browse/MIG-1951","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nAfter an instance URL rename, the old URL keeps showing in the product links as a destination, from the user experience perspective, the URL should be the new swapped URL regardless if the other URL is kept in the instance history. \r\n\r\nThis is reproducible on Data Center: (no)\r\nh3. Steps to Reproduce\r\n# After a site migration. \r\n# Change the URL. \r\n# Check the Product links.\r\n# The old URL will show as a Destination. \r\n\r\nh3. Expected Results\r\nThe URL in the destination for the product links should always match the current URL of the instance. \r\n\r\nh3. Actual Results\r\nThe URL in the destination for the product links is the old URL instead of the current URL. \r\n\r\nh3. Workaround\r\nAs we keep the URL due to historical redirects, the user can select the old URL in the product links as the redirect will continue working. ","createDate":"2024-05-13T14:24:41.000+0000","comments":[{"text":"Thanks for creating this one. It is a small thing to fix, but would help avoid confusion when selecting the destination :)","author":"Jonathan Cyr"}]},{"summary":"JCMA reopens closed Sprints in Server to Cloud migration","key":"MIG-1925","url":"https://jira.atlassian.com/browse/MIG-1925","type":"Bug","priority":"","description":"{panel:title=Atlassian Update – 19 November 2024|borderStyle=solid|borderColor=#2684ff|titleBGColor=#2684ff|bgColor=#deebff}\r\nHi everyone,\r\n\r\nThis is Aayushi from the JCMA team. We would like to thank you for all the comments and feedback on the bug you've been experiencing with JCMA re-opening closed sprints.\r\n\r\nThis bug and the various ways it occurs (as mentioned in the Description of this bug) is due to {*}Config Drift{*}. JCMA tracks and maintains a record of the entities you have migrated (e.g workflow, custom field etc.), this functionality enables it to reduce the incidence that duplicate entities are created by linking data from entities that have previously been migrated. _*You can learn more about how JCMA links your data [here|https://support.atlassian.com/migration/docs/how-the-jira-cloud-migration-assistant-links-your-data/] & [here|https://confluence.atlassian.com/cloudkb/jira-cloud-migration-assistant-duplicates-and-tracking-entities-1063170066.html]*_\r\n\r\nIn this scenario with the sprint entity if there is a *difference (drift)* in the status of the Sprint we have taken the Server/Data Center status as the source of truth which results in the JCMA behaviour you're experiencing. \r\n\r\nAfter careful consideration of all the scenarios and uses cases we determined the best approach to solve this bug would be to develop a feature that would enable you to choose the source of truth whenever a *Config Drift* scenario is detected. \r\n\r\nWhile this may not be the outcome you were expecting, changing the source of truth to Cloud may also result in another bug for use cases where the Server/Data Center status would be considered the source of truth some customers.\r\n\r\nYou can monitor progress of this feature via [MIG-2100|https://jira.atlassian.com/browse/MIG-2100] we have carried over all your comments and votes there as well.\r\n\r\nPlease share any additional information about your particular use case that you think would help us prioritise building this feature.\r\n\r\nKind regards,\r\nCloud Transitions Team\r\n{panel}\r\nh3. Issue Summary\r\n\r\nWhen migrating Projects from Server to Cloud, the migration assistant can reopen past completed Sprints in some scenarios. Some well-known scenarios are:\r\n * Sprint name already exists in destination Cloud site (expected as per MIG-1339)\r\n * Sprint was previously migrated under a different name after Project data changed\r\n * Sprint contains cross-project issues\r\n * Shared Sprints found in other Boards\r\n * In phased migrations, if migrator selects on every plan to migrate \"All dashboards\", if a gadget/ dashboard references a sprint, although the sprint belongs to a single project board, will be exported in cross project data and the server data will take prevalence over already existing cloud data;\r\n\r\nThis is reproducible on Data Center: (yes)\r\nh3. Steps to Reproduce\r\n\r\nThese steps only account for 1 particular scenario that is very consistent (cross-project issues):\r\n # On Server site, create *Project* A with *Sprint 1* and Issues\r\n # Perform a Server to Cloud migration using JCMA including *Project A*\r\n # On Cloud site, complete *Sprint 1*\r\n # On Server site, create *Project B* with Issues. Assign an Issue to *Sprint 1*\r\n # Perform a Server to Cloud migration using JCMA including only *Project B*\r\n\r\nh3. Expected Results\r\n\r\nConsidering *Project A* was not in the scope of the migration, this should have no impact, OR a new *Sprint 1* should be created in {*}Project B{*}.\r\nh3. Actual Results\r\n\r\n*Sprint 1* from *Project A* is reopened. This is also still applicable if the Sprint was renamed in the Server site where it will update the Sprint name in the Cloud site.\r\nh3. Workaround\r\n\r\nIf migrating in phases with the option to migrate \"All dashboards\" in each phase, prior to the migration, contact Atlassian Migration Support with the result of the below query:\r\n{code:java}\r\nSELECT\r\n    pp.ID AS DashboardID,\r\n    pp.PAGENAME AS DashboardName,\r\n    pc.ID AS GadgetID,\r\n    pc.GADGET_XML AS GadgetKey,\r\n    gup_sprint.USERPREFVALUE AS SprintID,\r\n    aosp.\"NAME\" AS SprintName,\r\n    aosp.\"START_DATE\" AS SprintStartDate,\r\n    aosp.\"COMPLETE_DATE\" AS SprintCompleteDate,\r\n    aosp.\"END_DATE\" AS SprintEndDate,\r\n    aosp.\"CLOSED\" AS SprintClosed,\r\n    aosp.\"STARTED\" AS SprintStarted,\r\n    aosp.\"RAPID_VIEW_ID\" AS RapidViewID \r\n    FROM\r\n       PORTALPAGE pp\r\n   JOIN\r\n       PORTLETCONFIGURATION pc ON pp.ID = pc.PORTALPAGE\r\n   JOIN\r\n       GADGETUSERPREFERENCE gup_sprint ON pc.ID = gup_sprint.PORTLETCONFIGURATION AND gup_sprint.USERPREFKEY = 'sprintId'\r\n   JOIN\r\n       \"AO_60DB71_SPRINT\" aosp ON gup_sprint.USERPREFVALUE = aosp.\"ID\"::text;\r\n{code}\r\nAtlassian support will be able to map the above result with the existing cloud data and will provide you the differences for the potentially impacted sprints. Having this information, migrator can take educated decision on whether to proceed in using the migrate \"All dashboard\" option with impact or not migrating dashboards (as long as all dashboards were migrated in the first migration phase). More than this, the information provided can be leveraged to modify the on premise sprints via REST/ API or database ( by setting to the on prem sprints the values existing on cloud).","createDate":"2024-06-10T13:20:53.000+0000","comments":[{"text":"{panel:title=Atlassian Update – 19 November 2024|borderStyle=solid|borderColor=#2684ff|titleBGColor=#2684ff|bgColor=#deebff}\r\nHi everyone,\r\n\r\nThis is Aayushi from the JCMA team. We would like to thank you for all the comments and feedback on the bug you've been experiencing with JCMA re-opening closed sprints.\r\n\r\nThis bug and the various ways it occurs (as mentioned in the Description of this bug) is due to {*}Config Drift{*}. JCMA tracks and maintains a record of the entities you have migrated (e.g workflow, custom field etc.), this functionality enables it to reduce the incidence that duplicate entities are created by linking data from entities that have previously been migrated. _*You can learn more about how JCMA links your data [here|https://support.atlassian.com/migration/docs/how-the-jira-cloud-migration-assistant-links-your-data/] & [here|https://confluence.atlassian.com/cloudkb/jira-cloud-migration-assistant-duplicates-and-tracking-entities-1063170066.html]*_\r\n\r\nIn this scenario with the sprint entity if there is a *difference (drift)* in the status of the Sprint we have taken the Server/Data Center status as the source of truth which results in the JCMA behaviour you're experiencing. \r\n\r\nAfter careful consideration of all the scenarios and uses cases we determined the best approach to solve this bug would be to develop a feature that would enable you to choose the source of truth whenever a *Config Drift* scenario is detected. \r\n\r\nWhile this may not be the outcome you were expecting, changing the source of truth to Cloud may also result in another bug for use cases where the Sever/Data Center status would be considered the source of truth some customers.\r\n\r\nYou can monitor progress of this feature via [MIG-2100|https://jira.atlassian.com/browse/MIG-2100] we have carried over all your comments and votes there as well.\r\n\r\nPlease share any additional information about your particular use case that you think would help us prioritise building this feature.\r\n\r\nKind regards,\r\nCloud Transitions Team\r\n{panel}","author":"aaggarwal2"}]},{"summary":"JCMA Preflights: JCMA Cross-projects boards and filters preflight does not succeeds if there are filters referencing other filters with WAS or WAS NOT IN operator","key":"MIG-1896","url":"https://jira.atlassian.com/browse/MIG-1896","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nJCMA is not able to finish running the preflights in case it contains a filter with \"WAS NOT IN\" or \"WAS IN\", and other filters have a reference to it.\r\nh3. Steps to Reproduce\r\n # Install any version of JCMA greater than 1.11.0 (could be the latest one).\r\n # Navigate to the Migration Assistant home, create a migration plan including all boards and filters on it\r\n # Run the preflight checks\r\n # Check that cross-project boards and filters preflight check failed  !image-2024-05-14-15-09-06-531.png|width=529,height=107!\r\n\r\nh3. Example Data used to Reproduce the issue\r\n # Create a project with key KANBAN\r\n # Create 4 issues for this project\r\n # Create at least 4 filters with the following configuration:\r\n ** KANBAN_1: filter != KANBAN_2 AND filter != KANBAN_3 AND filter != KANBAN_4 ORDER BY created DESC, updated DESC, status DESC, Rank ASC\r\n ** KANBAN_2: Filter = KANBAN_3 OR Filter = KANBAN_4 OR Filter = KANBAN_3 OR Filter = KANBAN_4 OR Filter = KANBAN_3 OR Filter = KANBAN_4 ORDER BY created DESC, updated DESC, status DESC, Rank ASC\r\n ** KANBAN_3: project = KANBAN AND (resolved >= 2022-01-01 AND resolved < 2025-12-31 OR resolved is EMPTY) AND (resolution != duplicate OR resolution is EMPTY) AND priority in (Highest, High, Medium) AND (labels not in (frictionpoint) OR labels is EMPTY) AND status was not in (Closed, Resolved) ORDER BY created DESC, updated DESC, status DESC, Rank ASC\r\n ** KANBAN_4: project = KANBAN AND (resolved >= 2022-01-01 AND resolved < 2023-12-31 OR resolved is EMPTY) AND Status in (Backlog,Done,\"In Progress\",Open,Resolved) OR project = SCRUM AND (resolved >= 2022-01-01 AND resolved < 2023-01-01 OR resolved is EMPTY) AND Status was in (Backlog,Done,\"In Progress\",Open,Resolved) AND status in (Closed) ORDER BY key ASC, created DESC, updated DESC, status DESC, Rank ASC\r\n\r\nh3. Expected Results\r\n\r\nThe preflights should be able to run successfully on this scenario.\r\nh3. Workaround\r\n\r\nNot include boards and filters on the migration plan, or contact Atlassian support team for additional help.","createDate":"2024-05-14T18:19:56.000+0000","comments":[]},{"summary":"'Create from template' macro don't point to correct template after migration with CCMA","key":"MIG-1872","url":"https://jira.atlassian.com/browse/MIG-1872","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen migrating Confluence spaces via CCMA or Space export/import the 'Create from template' macro don't work and display the follow message when clicked on:\r\n\r\nbq.  The template selected is not available anymore.\r\n\r\nThis is reproducible on Data Center: Yes\r\nh3. Steps to Reproduce\r\n # Create local page template in space \r\n # Create new page and add 'Create from template' macro, point it to page template from previous step\r\n # Migrate space from Server/DC to Cloud via CCMA or via manual space export/import\r\n\r\nh3. Expected Results\r\n\r\n'Create from template' macro button works on destination and a new page is created with the desired template\r\n\r\nh3. Actual Results\r\n\r\nClicking the 'Create from template' macro button causes the following message to show:\r\n\r\nbq.  The template selected is not available anymore.\r\n\r\nIf you edit the macro it'll show pointing to the first template in the list instead of the desired template.\r\n\r\nPage source points to an old Server templateid:\r\n\r\n{code:xml}\r\n<ac:structured-macro ac:name=\"create-from-template\" ac:schema-version=\"1\" ac:macro-id=\"aaaa-bbbbb-cccccc-dddddd\">\r\n<ac:parameter ac:name=\"templateName\">123456789</ac:parameter>\r\n<ac:parameter ac:name=\"templateId\">123456789</ac:parameter>\r\n<ac:parameter ac:name=\"title\">Sample title</ac:parameter>\r\n<ac:parameter ac:name=\"buttonLabel\">Add template page</ac:parameter>\r\n</ac:structured-macro>\r\n{code}\r\n\r\nWhen the actual templateid in Cloud space is different:\r\n\r\n{noformat}\r\nhttps://<cloudsite>.atlassian.net/wiki/templates?space=SPACEKEY&template=987654321\r\n{noformat}\r\n\r\n\r\n\r\nh3. Workaround\r\n\r\nEdit the macro on the page and select the desired page template that should be used and publish the change.","createDate":"2023-12-12T18:38:11.000+0000","comments":[]},{"summary":"Custom field Customer Request Type is not migrated with JCMA and may cause JQLs to break","key":"MIG-1794","url":"https://jira.atlassian.com/browse/MIG-1794","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nMigrating from on-prem JSM, the custom field {*}Customer Request Type{*}, which is a locked field that has its custom field type as _Customer Request Type,_ deliberately gets merged with the locked custom field in Cloud, {*}Request Type{*}, which has the same custom field type _Customer Request Type._\r\n\r\nh3. Steps to Reproduce\r\n\r\n # Create a filter that references the custom field _Customer Request Type_\r\n # Create a JSM Project, add this custom field to that project via association with the project's screen\r\n # Create a Jira issue on that project, and populate the _Customer Request Type_ custom field with any given value\r\n # Migrate that project to an Atlassian cloud site with JCMA\r\n\r\nh3. Expected Results\r\n\r\nFilters have their JQL updated with the new custom field name.\r\n\r\nh3. Actual Results\r\n\r\n * Customer Request Type values gets added to the _Request Type_ custom field (seems intentional)\r\n * Filters break because their JQLs reference the _Customer Request Type_ custom field (seems unintentional)\r\n\r\nThe values of the {*}Customer Request Type{*}, like contexts and screens, are appended into the custom field *Request Type* in Cloud after migration.\r\n\r\nThe custom field _Customer Request Type_ does not get migrated. Instead, its values are copied to the _Request Type_ custom field.\r\nThis might cause JQL/Filters that use this custom field name to not bring the expected results.\r\n\r\nh3. Workaround\r\n\r\nCurrently, there is no automated workaround for this behavior. A workaround will be added here when available.\r\n\r\nMeanwhile, to fix the broken JQLs, users must edit them manually and reference the _Request Type_ custom field instead.\r\n","createDate":"2024-02-23T18:43:56.000+0000","comments":[{"text":"The values were also not migrated to the field \"Request Type\".","author":"Sebastian Wörz"}]},{"summary":"Archived issues linked to an epic migrated as Active when only active issues are migrated","key":"MIG-1769","url":"https://jira.atlassian.com/browse/MIG-1769","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center: Yes\r\nh3. Steps to Reproduce\r\n#  Add a Issue with epic link type.\r\n# Add another issue under that epic and archive that issue.\r\n# Migrate the project to cloud without including Archived Issues in migration.\r\n# Archived Issues in migrated to cloud as active issue.\r\n\r\nh3. Expected Results\r\nArchived Issues under an epic should have archived status after migration to the cloud. \r\n\r\nh3. Actual Results\r\nArchived Issues under an epic become active issues after migration to the cloud. As long as one of the issues related to the Epic are not Archived, the entire Epic and children will be unarchived after the migration. \r\n\r\nh3. Workaround\r\nAfter migration on cloud, change the converted issues to archived issues using [Archiving Issues API|https://developer.atlassian.com/cloud/jira/platform/rest/v3/api-group-issues/#api-rest-api-3-issue-archive-put]. ","createDate":"2024-02-15T08:11:36.000+0000","comments":[]},{"summary":"JCMA export throws java.lang.NullPointerException when trying to get the SLA customfield value ","key":"MIG-1747","url":"https://jira.atlassian.com/browse/MIG-1747","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nJCMA export throws java.lang.NullPointerException when trying to get the corrupted SLA customfield value of an issue.The following stacktrace shows that we are trying get the SLA customfield value.\r\n{code:java}\r\n    at com.atlassian.jira.migration.export.core.customfield.jsd.JsdCustomFieldValueParser.defineSlaCustomFieldValue(JsdCustomFieldValueParser.kt:128)\r\n    at com.atlassian.jira.migration.export.core.customfield.jsd.JsdCustomFieldValueParser.deriveCustomFieldValue(JsdCustomFieldValueParser.kt:93)  {code}\r\nThis is reproducible on Data Center: Yes (with DB tweak)\r\nh3. Steps to Reproduce\r\n* Create a new JSM Project.\r\n*  Configure an SLA for this project.\r\n* Check the customfieldvalue related to one of the Jira issues.\r\n{code:java}\r\nSELECT * from customfieldvalue where issue in (select id from jiraissue where issuenum=<issue_number>and project=<project_id>) {code}\r\n\r\n* Tweak the customfieldvalue entry by assigning null to the textvalue for the field\r\n(In customer environment this value was already corrupted with no root cause)\r\n{code:java}\r\nupdate customfieldvalue set textvalue='null' where issue=<issue_id> {code}\r\n\r\n* Migrate this project.\r\nh3.  \r\n\r\nh3. Expected Results\r\n\r\nA valid/meaningful error should be displayed during the data preparation stage (Null Pointer Exception should be catched)\r\nh3. Actual Results\r\n\r\nThe Data preperation fails with the NPE error.\r\n{noformat}\r\n2024-01-16 15:49:02,646 pool-87-thread-3 ERROR Administrator 947x93539x4 14fepla 84.135.183.239 /rest/migration/latest/check/plan/<Plan_ID> [migration.export.framework.DefaultExportFailureHandler] 275c600697b36423ad6dfffb5c4f81fe47cb52b2: Exporting entity Issue <Issue_Number> failed\r\njava.lang.NullPointerException\r\n    at com.atlassian.jira.migration.export.core.customfield.jsd.JsdCustomFieldValueParser.defineSlaCustomFieldValue(JsdCustomFieldValueParser.kt:128)\r\n    at com.atlassian.jira.migration.export.core.customfield.jsd.JsdCustomFieldValueParser.deriveCustomFieldValue(JsdCustomFieldValueParser.kt:93)\r\n    at com.atlassian.jira.migration.export.core.customfield.CustomFieldValueExportHelper.exportCustomFieldValueForIssue(CustomFieldValueExportHelper.kt:86)\r\n    at com.atlassian.jira.migration.export.core.issue.V2IssueCustomFieldValueExportMapper.mapCustomFieldValues(V2IssueCustomFieldValueExportMapper.kt:62)\r\n    at com.atlassian.jira.migration.export.core.issue.IssueExporter.mapCustomFields(IssueExporter.kt:501)\r\n    at com.atlassian.jira.migration.export.core.issue.IssueExporter.exportData(IssueExporter.kt:187)\r\n    at com.atlassian.jira.migration.export.core.issue.IssueExporter.exportData(IssueExporter.kt:84)\r\n    at com.atlassian.jira.migration.export.framework.ExportService$exportJiraEntity$1$1.invoke(ExportService.kt:304)\r\n    at com.atlassian.jira.migration.export.framework.ExportService$exportJiraEntity$1$1.invoke(ExportService.kt:303)\r\n    at com.atlassian.jira.migration.metrics.TimingMetrics.time(TimingMetrics.kt:24)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportJiraEntity-0E7RQCE(ExportService.kt:303)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportByEntityImpl(ExportService.kt:247)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportByEntityImpl$default(ExportService.kt:225)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportOrThrow(ExportService.kt:125)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportOrThrow$default(ExportService.kt:119)\r\n    at com.atlassian.jira.migration.export.core.project.ProjectExporter.exportIssuesSequential(ProjectExporter.kt:402)\r\n    at com.atlassian.jira.migration.export.core.project.ProjectExporter.exportIssues(ProjectExporter.kt:315)\r\n    at com.atlassian.jira.migration.export.core.project.ProjectExporter.access$exportIssues(ProjectExporter.kt:81)\r\n    at com.atlassian.jira.migration.export.core.project.ProjectExporter$childrenActions$5.invoke(ProjectExporter.kt:207)\r\n    at com.atlassian.jira.migration.export.core.project.ProjectExporter$childrenActions$5.invoke(ProjectExporter.kt:199)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.continueWithChildrenActions(ExportService.kt:321)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportByEntityImpl(ExportService.kt:250)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportByEntityImpl$default(ExportService.kt:225)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportOrThrow(ExportService.kt:125)\r\n    at com.atlassian.jira.migration.export.framework.ExportService.exportOrThrow$default(ExportService.kt:119)\r\n    at com.atlassian.jira.migration.export.ExportFacade.exportProjectReportData(ExportFacade.kt:310)\r\n    at com.atlassian.jira.migration.preflight.reports.DataExtractorFromProjects$gatherReportsDataFromProjectParallel$futures$1$1$1.invoke(DataExtractorFromProjects.kt:170)\r\n    at com.atlassian.jira.migration.preflight.reports.DataExtractorFromProjects$gatherReportsDataFromProjectParallel$futures$1$1$1.invoke(DataExtractorFromProjects.kt:169)\r\n    at com.atlassian.jira.migration.jiraservice.JiraExtensionsKt.wrap(JiraExtensions.kt:19)\r\n    at com.atlassian.jira.migration.preflight.reports.DataExtractorFromProjects.gatherReportsDataFromProjectParallel$lambda$5$lambda$4(DataExtractorFromProjects.kt:169)\r\n    at java.base/java.util.concurrent.FutureTask.run(Unknown Source)\r\n    at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(Unknown Source)\r\n    at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(Unknown Source)\r\n    at java.base/java.lang.Thread.run(Unknown Source) {noformat}\r\nh3. Workaround\r\n\r\nWay to recover, would be to go individually on each affected issue and work on 'Recalculate all SLAs' available on the issue view, right corner.\r\n!image-2024-02-05-13-46-23-142.png|width=430,height=99!","createDate":"2024-02-05T10:47:22.000+0000","comments":[{"text":"The issue has been fixed with JCMA 1.10.17 release.","author":"Tanjot Bhatia"}]},{"summary":"CCMA migrates spaces with “Null” spacestatus","key":"MIG-1715","url":"https://jira.atlassian.com/browse/MIG-1715","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThis is reproducible on Data Center: yes\r\n\r\nMigration Type: server to cloud \r\n\r\nCCMA migrates spaces with “Null” spacestatus\r\nh3. Steps to Reproduce\r\n\r\n1. Use the latest CCMA 3.9.4\r\n2. Create a migration plan with a space having null spacestate. This can be identified using the below query.\r\n{code:java}\r\nselect SPACEID, SPACEKEY, SPACESTATUS FROM SPACES\r\n{code}\r\n3. The Migration will run successfully without any Errors or Warnings.\r\n4. MAUI will show this space to be migrated successfully.\r\nh3. Expected Results\r\n\r\n[Navigate|https://support.atlassian.com/confluence-cloud/docs/navigate-spaces/] to view the migrated space on cloud site. This space should be listed here.\r\nh3. Actual Results\r\n * We will be unable to see the space anywhere on the cloud UI. \r\n * This is because the *spacestatus* of this space is a NULL.\r\n\r\nh3. Workaround\r\n\r\n1. To fix this on the cloud site if the space is already migrated, update the *spacestatus* of the space to current by a DB update using the below query.\r\n{code:java}\r\nupdate spaces set spacestatus = 'CURRENT' where spacekey = ‘<SPACEKEY>’\r\n{code}\r\n2. To fix this on the Confluence server before performing the migration follow the below steps.\r\n * Go to the Space with Null value spacestatus and click on Spacetools -> Overview -> Edit Space Details\r\n * Select “Edit Space Details”\r\n * Change the status to Current and Save it","createDate":"2024-01-22T14:04:59.000+0000","comments":[]},{"summary":"JCMA doesn't migrate all single project filters by default","key":"MIG-1642","url":"https://jira.atlassian.com/browse/MIG-1642","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen migrating *without* using the \"cross-project\" or \r\n{noformat}\r\ncom.atlassian.jira.migration.export.all.filters{noformat}\r\nfilters that have only one project don't get migrated unless they have share permissions set for the project or they are configured to a board.\r\nh3. Steps to Reproduce\r\n # Create a project with no boards\r\n # Create a new private filter that uses only the single project in the JQL\r\n # Migrate the project\r\n\r\nh3. Expected Results\r\n\r\nThe filter is migrated to the destination regardless of configuration as long as it only references a single project.\r\nh3. Actual Results\r\n\r\nThe filter is not migrated at all.\r\nh3. Workaround\r\n * Add the project to the filter's share permissions.\r\n * Use the cross-project boards and filters features","createDate":"2023-11-29T00:29:53.000+0000","comments":[{"text":"https://getsupport.atlassian.com/browse/MOVE-1744027","author":"Vittal Krishna"}]},{"summary":"Migrating sprints from a different project overwrites the board as null","key":"MIG-1392","url":"https://jira.atlassian.com/browse/MIG-1392","type":"Bug","priority":"","description":"*_Issue Summary_*\r\nData integrity checks within the migration flow causes sprint board associations stored on table/column \"AO_60DB71_SPRINT\".\"RAPID_VIEW_ID\" to not migrate as expected. This happens because the data integrity checks can overwrite specific data that impact the sprint board association to a null value when certain conditions are met.\r\n\r\n*_Steps to Reproduce_*\r\n # On data center you have 2 projects, Project A and Project B\r\n # Create a board and sprint (Sprint A) that includes only Project A\r\n # Put a Jira issue (PROJA-1) from Project A into Sprint A.\r\n # Now change the filter for Sprint A to a filter that only includes Project B.\r\n # PROJA-1 has Sprint field = Sprint A, but PROJA-1 is no longer showing in Sprint A (because the filter was changed).\r\n # Now migrate Project B then Project A\r\n\r\n*_Expected Results_*\r\nThe Sprint in \"AO_60DB71_SPRINT\" has a valid \"RAPID_VIEW_ID\".\r\n\r\n_*Actual Results*_\r\nThe Sprint in \"AO_60DB71_SPRINT\" has \"RAPID_VIEW_ID\" as null because PROJA-1 sprints are not treated as valid because they no longer point to Project A. No errors are thrown in the logs.\r\n\r\n*_Workaround_*\r\nNo workaround at the moment, please engage support if this issue is observed.","createDate":"2023-05-16T14:07:01.000+0000","comments":[]},{"summary":"Support the export/import of the workflow UI positioning in a Jira Server to Cloud migration","key":"MIG-217","url":"https://jira.atlassian.com/browse/MIG-217","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen migrating from DC2C, the layout of a workflow diagram is lost. Customers will lose the positioning of the statuses and transitions within a workflow, including the drop-down view of an issue transition on the issue view.\r\n\r\nh3. Steps to Reproduce\r\n# Create a workflow\r\n# Position the statuses and transitions on a set layout\r\n# Associate this workflow with a workflow scheme\r\n# Associate the workflow scheme with a project\r\n# Migrate the project\r\n\r\nh3. Expected Results\r\nThe workflow diagram layout is migrated.\r\n\r\nh3. Actual Results\r\nThe workflow diagram layout is not migrated and all statuses are centerly aligned.\r\n\r\nh3. Workaround\r\nCurrently, there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2020-07-20T21:03:52.000+0000","comments":[{"text":"This bug is going to hit some of our project owners very hard as we have quite a few workflows with 20+ statuses so it will take a lot of work to rearrange them in Jira Cloud after the migration. I have a feeling this bug will go nowhere since it has been open for 20 months with no updates.","author":"Rick Westbrock"},{"text":"we just spent 2 MD in total effort for xxx Workflows with xxxx status, this is completely unacceptable, since it is almost impossible to do this within a migration weekend.\r\n\r\nI really wonder why there are so few votes\r\n\r\nbr\r\n\r\nChristian","author":"Christian Ritter"},{"text":"Looks like layout is just not part of the migration, thus Cloud creates is as it can. Hopefully layout will be added soon, otherwise adjusting complex workflows after the migration (which is often required due to unsupported/incompatible conditions, validator and post-functions) is the very painful and time consuming operation.","author":"Yevgen Lasman"},{"text":"I'm surprised with the number of things that are not supported as standard as part of migration, especially as Atlassian is pushing for people to migrate to cloud so hard... The process should be straight forward and we should not need to do these types of manual workarounds. I guess it is not voted on much as it is only encountered during migration, not day to day usage...","author":"Karin van Driel"},{"text":"Yet another basic feature messing up the view after migration. It's not about changing the UI, atleast persist the old settings","author":"Javish Kathuria"},{"text":"+1","author":"Patrizia Kamp - OLD account"},{"text":"+1","author":"Viktor Sapaiev"},{"text":"+1\r\n\r\nAlso think this is strange that this is not a standard feature. For use-cases outside of the standard software world, it is very common to use Jira to model and track Business Process Flows. These tend to have multiple statuses (20+ not uncommon) and multiple transitions with conditions, validators, and non-linear directions. The current way they get migrated and visualised in could make it impossible to visualise at what stage in the process the issue is really at. It takes many hours to rearrange these (our instance has 40+ complex workflows). As another user posted this cannot be done in a migration weekend, where there are already enough other technical things that need to be done.","author":"Paddy Byrne"},{"text":"https://getsupport.atlassian.com/browse/MOVE-130653\r\n\r\n ","author":"Ashvini Shukla"},{"text":"This is a must-have feature for JCMA. The migrated workflow UI badly impacts us.","author":"Sami Ahmed Shaik"},{"text":"Yeah not surprised this doesn't work... Doubt they will ever fix it either","author":"George G"}]},{"summary":"In business projects the column order set by admins is ignored and columns appear grouped by their Status category (To Do, In Progress, Done) for regular users","key":"JWMCLOUD-877","url":"https://jira.atlassian.com/browse/JWMCLOUD-877","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nIn business projects: the column order set by admins is ignored and columns appear grouped by their Status category (To Do, In Progress, Done) for regular users\r\nh3. Steps to Reproduce\r\n # Create a business project.\r\n # With an admin user, add a few extra columns/statuses with different status categories.\r\n # Shift the columns/status order in the board.\r\n # Access the project board with a non-admin user.\r\n\r\nh3. Expected Results\r\n\r\nThe columns are visualized in the order the admin set them.\r\nh3. Actual Results\r\n\r\nThe column reorder is only visible to the admin that made the change. For regular users, the columns are ordered first by their status category and then by their status ID apparently. For example:  !Column order comparison.png|width=413,height=216!\r\n\r\n*Notes:*\r\nIn addition, there is another bug that prevents regular users from changing the column order for themselves, it might be connected: [JWMCLOUD-873: Regular users are not able to re-order column in Business Board|https://jira.atlassian.com/browse/JWMCLOUD-873]\r\nh3. Workaround\r\n\r\nOnly possible workaround is to temporarily provide project admin privileges to standard users so they can reorder the columns themselves.","createDate":"2025-04-01T08:09:29.000+0000","comments":[]},{"summary":"Unable to see the translated status(i.e. Italian) on the Jira board status where it is clearly seen on the issue view status which is in Italian","key":"JWMCLOUD-876","url":"https://jira.atlassian.com/browse/JWMCLOUD-876","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nUnable to see the translated status(i.e. Italian) on the Jira board status (i.e column) where it is clearly seen on the issue view status which is in Italian.\r\nh3. Steps to Reproduce\r\n # Go to account personal settings\r\n # Change language to Italian\r\n # Open an issue with a transition to a status named 'To Do' and it will show 'Fare' (In Italian language)\r\n # When you see the column or status on the board, the 'To Do' status will be shown which is in the English language.\r\n\r\nPlease refer to the attached screenshot.\r\nh3. Expected Results\r\n\r\nThe board's status or column should show the translated text.\r\nh3. Actual Results\r\n\r\nThe board's status or column is shown in the English language.\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-04-01T10:26:18.000+0000","comments":[{"text":"the translation \"fare\" that i can see in one of your screenshots is not correct.  The To Di status should be translated in \"Da completare\" as it was before","author":"Elena Bertucco"}]},{"summary":"Users without Create Issue permission can't use an Open Form on Team-Mamaned projects","key":"JWMCLOUD-874","url":"https://jira.atlassian.com/browse/JWMCLOUD-874","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nAccording to the documentation [Manage Access and share a form|https://support.atlassian.com/jira-software-cloud/docs/share-your-form/], when the Form is set to Open, it means \"Only people with a Jira license who can log in to your Jira site\". However, if the user doesn't have the Create Issue permission, they can't see the form.\r\n!image-2025-03-31-14-52-17-718.png|width=325,height=247!\r\nh3. Steps to Reproduce\r\n # Create a TM business project and set it to Private.\r\n # Create a Form and set it to Open, and copy the form link for following steps.\r\n # Try creating an issue from the form created on #2 using a licensed random user without access to the project.\r\n # (If step #3 couldn't reproduce the issue) Go to *Project Settings -> Access.* Add someone else from your team as Administrator and remove yourself from the user list. Try open the form again.\r\n\r\n \r\nh3. Expected Results\r\n\r\nSince the permission says, \"Only people with a Jira license can log in to your Jira site,\" all licensed users should be able to create an issue from the Form.\r\nh3. Actual Results\r\n\r\nThe following page is shown:\r\n!image-2025-03-31-14-49-55-994.png|width=323,height=252!\r\nh3. Workaround\r\n\r\nNone at the moment.","createDate":"2025-03-31T12:56:00.000+0000","comments":[]},{"summary":"Regular users are not able to re-order column in Business Board","key":"JWMCLOUD-873","url":"https://jira.atlassian.com/browse/JWMCLOUD-873","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nRegular users are not able to re-order the columns on the business board\r\nh3. Steps to Reproduce\r\n\r\nTry to drag the columns to change the order.\r\nh3. Expected Results\r\n\r\nIn Business projects, users should be able to arrange the column order at their convenience and [any user having access to the business project can rearrange the columns in the board but will only be visible to that user. |https://support.atlassian.com/jira-work-management/docs/workflows-and-statuses-for-the-board/]\r\nh3. Actual Results\r\n\r\nOnly Admins are able to re-arrange the column order. \r\nh3. Workaround\r\n\r\nCurrently, there is no known workaround for this behaviour. A workaround will be added here when available","createDate":"2025-03-28T11:19:34.000+0000","comments":[{"text":"This issue has now been fixed.","author":"Matt Di Berardino"}]},{"summary":"User picker fields (single and multiple) are not available for customize cards on business project board","key":"JWMCLOUD-872","url":"https://jira.atlassian.com/browse/JWMCLOUD-872","type":"Bug","priority":"","description":"h3. Issue Summary\r\nBusiness project board allows to add custom fields via board > [... More] > [Customize cards].\r\nPreviously user picker fields (single and multiple) are listed in this list and users could add the fields to cards.\r\n\r\nRecently it disappeared from the list, so that users can't see the user picker fields in business project board.\r\n\r\nh3. Steps to Reproduce\r\n # Navigate to Business project board\r\n # [... More] > [Customize cards]\r\n# User picker fields are not listed\r\n\r\nh3. Expected Results\r\nUsers can add user picker fields for business project board\r\n\r\nh3. Actual Results\r\nUser picker fields are not listed in customize cards option\r\n\r\nh3. Workaround\r\n\r\n Currently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-28T03:10:05.000+0000","comments":[{"text":"We have a fix for this issue in the deployment pipeline. ETA Tuesday evening AEDT.","author":"Sylvain - Jira - Eng"}]},{"summary":"When adding a category value to a Jira work item through the list view of a JWM team-managed project, the field value dropdown does not close","key":"JWMCLOUD-869","url":"https://jira.atlassian.com/browse/JWMCLOUD-869","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen adding a category value to a Jira work item through the list view of a JWM team-managed project, the field value dropdown does not close\r\n !image-2025-03-26-15-07-43-994.png|thumbnail! \r\n\r\nh3. Steps to Reproduce\r\n # Create a JWM Team-managed project\r\n # Access the List view tab\r\n # Ensure the field category is display as a column\r\n # Ensure the List view is not grouped by Category\r\n # Include a category value in an issue via the dropdown available in the column\r\n # See that the dropdown of the category available values does not close\r\n # A hard refresh in the page is required to see the value persisted.\r\n\r\nh3. Expected Results\r\nDropdown should close upon value selection confirmation.\r\n\r\nh3. Actual Results\r\nDropdown remains open and can't be closed even when clicking outside of it. A hard refresh in the page is required.\r\n\r\nh3. Workaround\r\nRefresh the page to see the value persisted.","createDate":"2025-03-26T18:13:31.000+0000","comments":[]},{"summary":"Unable to sort items in the list view if you are sorting the data on the basis of field","key":"JWMCLOUD-823","url":"https://jira.atlassian.com/browse/JWMCLOUD-823","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nUnable to sort items in the list view if you are sorting the data on the basis of field\r\nh3. Steps to Reproduce\r\n # Login in Team Managed Business JWM project\r\n # Navigate to list view\r\n # Add one column in list view for example Date time field (Actual End)\r\n # Now try to sort the item on the basis of Actual End Field\r\n # You will get following exception message \r\n*_\"We can't handle the current filters, please clear to continue_* \r\n\r\nh3. Expected Results\r\n\r\nIdeally the data should be visible without any issues and it should not through below exception message:\r\n*_\"We can't handle the current filters, please clear to continue_* \r\nh3. Actual Results\r\n\r\nThe below exception is thrown in the list view\r\n{noformat}\r\n\"We can't handle the current filters, please clear to continue  {noformat}\r\nh3. Workaround\r\n\r\nAs a workaround for the user to be able to see the list view again is to update the URL. Post performing the sorting of the actual end field the place where you have *{{sortBy=customfield_XXXX&direction=ASC}}*  change it to `{*}{{sortBy=summary&direction=ASC}}{*}  this will sort the list by summary.","createDate":"2024-11-14T12:48:27.000+0000","comments":[]},{"summary":"The columns in the List View of JWM are reset to default after user logs out and closes the browser","key":"JWMCLOUD-772","url":"https://jira.atlassian.com/browse/JWMCLOUD-772","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe columns in the List View of JWM are reset to default after the user logs out and closes the browser and are not persistent after user logs back in. \r\nh3. Steps to Reproduce\r\n # Open the list view of JWM project\r\n # Add/Remove Columns as needed\r\n # Logout of the Jira session\r\n # Close the browser \r\n # Open the browser again and login to list view\r\n\r\nh3. Expected Results\r\n * Changes made to the columns prior to closing the browser persisted\r\n\r\nh3. Actual Results\r\n * The list view shows default columns and the user loses all the changes they made to the columns\r\n\r\nh3. Workaround\r\n\r\nThe List view is storing column configuration in browser local storage which is why they are not persisting when you change browser or log out of Jira. As an alternative, you can use the \"Issues\" tab in List mode which will persist your preferences - [https://support.atlassian.com/jira-software-cloud/docs/search-for-issues-in-a-project/].","createDate":"2024-08-07T01:58:51.000+0000","comments":[{"text":"The number of people affected is actually growing in out teams, however that may be possible...","author":"Luka Meyli Gömer"},{"text":"We are experiencing the same issue.\r\n\r\nThe problem is that the individual user's settings (filters, grouping, columns etc.) are not saved on user level. They go back to defaults after the session is restored (time has passed, logged out, private mode, using another device, using another web browser).\r\n\r\nIn my opinion keeping the settings on user level is a must have functionality - same as on any internet browser (e.g. chrome, edge) - if you login on any device you'll see all your favourites etc. on any pc you use.\r\n\r\nThis bug was also mentioned in JWMCLOUD-136 (although task got changed from BUG to Suggestion! :() The bug has not been fixed yet despite Ben's comment from 5 Oct {color:#ff0000}2023{color}: +_We've noticed user level persistence has been inconsistent and we're rolling out an update to our persistence model in the coming weeks to fix this._+","author":"mjakubekova"},{"text":"We are also effected by the same issue.\r\n\r\nIs there an update on when this issues is anticipated to be fixed?","author":"Kate Kovtun"},{"text":"This bug has a negative impact on our internal rollout for using Business Projects within our organization. Following for any updates, workarounds & hoping for a fast resolution. TY!","author":"Jaime Shomock"},{"text":"This adds a lot of manual steps to continuously have to recreate the list as desired. And every user has to do this every time they log out.  We would really appreciate for this to be addressed!","author":"Karen Gonzalez"},{"text":"My organization recently changed their policy, so I am logged out now after a certain period of inactivity. For me that equates to logging in to Jira roughly twice a day. So having to continuously recreate the list makes the list view virtually unusable. Please fix ASAP!","author":"Erin Mitchell"},{"text":"Hi everyone,\r\n\r\nThis is Aidan from the Jira team. Thank you for bringing this issue to our attention, but this is the current expected behaviour of the list view.\r\n\r\nTo set the right expectations, we are closing this bug as ‘Won’t Fix' as we do not have any plans to change the behaviour of this feature. As an alternative, you can use the \"Issues\" tab in List mode which will persist your preferences - [https://support.atlassian.com/jira-software-cloud/docs/search-for-issues-in-a-project/].\r\n\r\nThank you again for providing valuable feedback to our team! I will be marking it closed for now.\r\n\r\nAidan","author":"Aidan Hunt"},{"text":"Hello, \r\nHow can you call this expected behaviour?! Our teams have been waiting over 1/2 year for this to be fixed, this is unacceptable!","author":"Luka Meyli Gömer"},{"text":"I agree with Luka, it is unacceptable to not be working on a solution. Jira publicly advertises the list view being customizable: [Customize your list by adding or removing fields | Jira Work Management Cloud | Atlassian Support|https://support.atlassian.com/jira-work-management/docs/customize-your-list-by-adding-or-removing-fields/]. This bug makes that customization unusable. I have not found the \"All Work\" tab list mode that you reference Aidan as an alternative. Please provide more information so I can assess if it is a feasible alternative for my team. Thank you.","author":"Erin Mitchell"}]},{"summary":"Branch deletion webhook faces NullPointerException cluttering the logs ","key":"JSWSERVER-26354","url":"https://jira.atlassian.com/browse/JSWSERVER-26354","type":"Bug","priority":"","description":"h3. Problem\r\n\r\nIn certain conditions mentioned below Jira fails to delete a branch because it already doesn't exist in AO_E8B6CC_BRANCH table therefore a NullPointerException happens filling up the logs without appropriate handling or mention of what repo/branch is missing \r\n{code:java}\r\n2025-03-19 13:09:49,051+0000 http-nio-8080-exec-2356 url: /rest/bitbucket/1.0/webhook/github DEBUG anonymous 789x23101419x3 - 140.82.115.92 /rest/bitbucket/1.0/webhook/github [c.a.j.p.d.r.external.v1.HookResource] Failed to execute web-hook\r\njava.lang.NullPointerException\r\nat com.atlassian.jira.plugins.dvcs.dao.impl.BranchDaoImpl.lambda$asBranches$1(BranchDaoImpl.java:70)\r\nat com.atlassian.jira.plugins.dvcs.dao.impl.BranchDaoImpl.lambda$asBranches$0(BranchDaoImpl.java:59)\r\nat java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:195)\r\nat java.base/java.util.Spliterators$ArraySpliterator.forEachRemaining(Spliterators.java:948)\r\nat java.base/java.util.stream.AbstractPipeline.copyInto(AbstractPipeline.java:484) {code}\r\nConditions that might cause this :\r\n * Running scheduled DVCS synchronization prior to receiving a webhook\r\n * Deletion webhook received twice\r\n\r\nh3. Environment\r\n\r\nJira 9.6.1\r\nh3. Expected Results\r\n\r\nJira doesn't find the branch and optionally report that the branch is already nonexistent or deleted if the user picks a debugging level of logs\r\nh3. Actual Results\r\n\r\nJira throws a null pointer exception at each failing webhook with no helpful information on the impacted repository/branch \r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available. ","createDate":"2025-03-27T09:06:09.000+0000","comments":[]},{"summary":"DVCS Synchronization Enters Infinite Loop Due to Queued Messages for Deleted Branches","key":"JSWSERVER-26329","url":"https://jira.atlassian.com/browse/JSWSERVER-26329","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nDVCS Synchronization Enters Infinite Loop Due to Queued Messages for Deleted Branches\r\n\r\nThis is reproducible on Data Center: (yes)\r\nh3. Steps to Reproduce\r\n # Set up a Jira instance with DVCS functionality enabled, using version *10.2.0* or later. (bulk sync was added in this version).\r\n # Configure a DVCS repository with multiple branches, including some that will be deleted after initial synchronization.\r\n # Initiate a manual soft synchronization to queue messages for all branch heads.\r\n # Delete one of the branches in the GitHub repository after the initial synchronization. It's important that the branch is deleted from the repository after the message is created, but before the message queue processes it.\r\n\r\nh3. Expected Results\r\n - Jira should detect the deleted branch and remove or invalidate any queued messages related to it.\r\n - The synchronization process should complete successfully for all existing branches without errors.\r\n\r\nh3. Actual Results\r\n - Jira attempts to process the message for the deleted branch, resulting in repeated failures and retries.\r\n - The synchronization process for the affected repository does not complete successfully. In the UI we can confirm this by observing that the affected repositoriy is just spinning infinitely.\r\n - The logs will become spammed with very frequent 404 messages for the deleted branch.\r\n\r\nThe below exception is thrown in the {{atlassian-jira.log}} file:\r\n{code:java}\r\n2025-03-06 07:35:36,866+0000 DVCSConnector.MessageExecutor:thread-1 WARN      [c.a.j.p.dvcs.sync.BulkCommitsMessageConsumer] An Not Found (404) exception occurred when obtaining changeset range\r\norg.eclipse.egit.github.core.client.NoSuchPageException: Not Found (404)\r\n\tat org.eclipse.egit.github.core.client.PageIterator.next(PageIterator.java:180)\r\n\tat com.atlassian.jira.plugins.dvcs.spi.github.CustomCommitService.getChangesetPollResultForBranch(CustomCommitService.java:83)\r\n\tat com.atlassian.jira.plugins.dvcs.spi.github.GithubCommunicator.getChangesetsRangeForBranch(GithubCommunicator.java:372)\r\n\tat com.atlassian.jira.plugins.dvcs.service.remote.CachingCommunicator.getChangesetsRangeForBranch(CachingCommunicator.java:168)\r\n\tat com.atlassian.jira.plugins.dvcs.service.remote.DvcsCommunicatorWithStatsImpl.getChangesetsRangeForBranch(DvcsCommunicatorWithStatsImpl.java:156)\r\n\tat com.atlassian.jira.plugins.dvcs.sync.BulkCommitsMessageConsumer.onReceive(BulkCommitsMessageConsumer.java:75)\r\n\tat com.atlassian.jira.plugins.dvcs.service.MessageExecutor$MessageRunnable.doRun(MessageExecutor.java:368)\r\n\tat com.atlassian.jira.plugins.dvcs.service.MessageExecutor$ReleaseTokenAndEnqueueNextMessage.run(MessageExecutor.java:277)\r\n\tat java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1136)\r\n\tat java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:635)\r\n\tat java.base/java.lang.Thread.run(Thread.java:840)\r\nCaused by: org.eclipse.egit.github.core.client.RequestException: Not Found (404)\r\n\tat org.eclipse.egit.github.core.client.GitHubClient.createException(GitHubClient.java:622)\r\n\tat org.eclipse.egit.github.core.client.GitHubClient.get(GitHubClient.java:815)\r\n\tat com.atlassian.jira.plugins.dvcs.spi.github.GithubClientWithTimeout.lambda$get$0(GithubClientWithTimeout.java:77)\r\n\tat com.atlassian.jira.plugins.dvcs.spi.github.GithubClientWithTimeout.executeRequest(GithubClientWithTimeout.java:113)\r\n\tat com.atlassian.jira.plugins.dvcs.spi.github.GithubClientWithTimeout.get(GithubClientWithTimeout.java:77)\r\n\tat org.eclipse.egit.github.core.client.PageIterator.next(PageIterator.java:178)\r\n\t... 10 more\r\n{code}\r\nh3. Workaround 1: Force stop the affected repositories.\r\n\r\n{*}Force Stop and Sync Affected Repositories{*}: Manually abort the running synchronization for the affected repositories and initiate a forced synchronization.\r\n - Use a {{curl}} command or Postman to send a {{POST}} request to Jira's internal API endpoint. This request will abort any running synchronization for the specified repository.\r\n - *API Endpoint:*\r\n{code:java}\r\nPOST <JIRA_BASE_URL>/rest/dvcs-connector-internal/1.0/repository/{id}/abortRunningSync\r\n{code}\r\n\r\n - *Example curl Command:*\r\n{code:java}\r\ncurl -X POST -u your-username\\:your-api-token \\\r\n'<JIRA_BASE_URL>/rest/dvcs-connector-internal/1.0/repository/{id}/abortRunningSync'\r\n{code}\r\n\r\nThis will abort the runing sync for the affected repository. Do note that this is a hard stop. Data that was queued to be processed is also dropped. On next soft sync the data should be queued again and synced properly.\r\nh3. Workaround 2: Revert to Previous Sync Mechanism\r\n\r\nThe bulk commit sync feature in Jira 10.2.0 has a dark feature flag {{dvcs.connector.github.bulk.commit.soft.sync.disabled}} that can be toggled to revert to the previous, slower sync mechanism. This can help avoid the infinite loop issue caused by messages for deleted branches.\r\n\r\n*Steps:*\r\n\r\n1. Access dark feature management using the [Atlassian guide]([https://confluence.atlassian.com/jirakb/how-to-manage-dark-features-in-jira-server-and-data-center-959286331.html]).\r\n2. Add dark feature {{dvcs.connector.github.bulk.commit.soft.sync.disabled}}\r\n\r\nFuture syncs will now work using the older single commit sync mechanisms.","createDate":"2025-03-06T07:44:23.000+0000","comments":[]},{"summary":"Set Required Fields pop up not displaying when committing changes to AR Plans","key":"JSWSERVER-26255","url":"https://jira.atlassian.com/browse/JSWSERVER-26255","type":"Bug","priority":"","description":"h3. Issue Summary\r\nWhen attempting to commit changes, including creating an issue from any Plans view, Jira hangs in the 'Saving in Jira...' progress screen.\r\n\r\nIn previous versions, a pop-up screen would appear prompting the user to fill in required fields, but this no longer happens.\r\n\r\nh3. Steps to Reproduce\r\n# Set required field/s\r\n# Go to the Plan and create an issue within it\r\n# Click on *Review Changes* >> *Save selected changes in Jira*\r\n\r\nh3. Expected Results\r\nThe Set Required Fields window would display\r\nExample from working versions:\r\n !Set_Required_Fields.png|thumbnail! \r\n\r\nh3. Actual Results\r\nJira hangs in the 'Saving in Jira...' progress screen:\r\n !Saving_in_Jira.png|thumbnail! \r\n\r\nh3. Workaround\r\nh4. Option 1\r\n* *Supported Custom fields* -> [Configure custom fields in Advanced Roadmaps|https://confluence.atlassian.com/pages/viewpage.action?pageId=1431244540]\r\n** If the required fields are supported, add them to the Plan settings to fix the problem\r\n** Non-supported fields need to be turned 'optional' in Jira to workaround this bug\r\n\r\nh4. Option 2\r\nEnable {{com.atlassian.portfolio.issueCreation.ShowWorkFlowValidatorFields.disabled}} [dark feature|https://confluence.atlassian.com/jirakb/enable-dark-feature-in-jira-959286331.html]:\r\n# Navigate to {{<BASE_URL>/secure/admin/SiteDarkFeatures!default.jspa}}\r\n# Add {{com.atlassian.portfolio.issueCreation.ShowWorkFlowValidatorFields.disabled}} to *Enable dark feature* and click *Add*\r\n\r\nh4. Option 3\r\n# Download the compressed [Jira Software 9.17.4|https://www.atlassian.com/software/jira/download-archives] and extract it\r\n# Go to the following directory path:\r\n** {{atlassian-jira-software-9.17.4-standalone/atlassian-jira/WEB-INF/application-installation/jira-software-application}}\r\n# Copy the following .jar files:\r\n** {{portfolio-plugin-9.17.4.jar}}\r\n** {{jira-portfolio-9.17.4.jar}}\r\n# On Jira 9.17.5, go to the following locations:\r\n** {{<Jira_Installation>/atlassian-jira/WEB-INF/application-installation/jira-software-application}}\r\n** {{<Jira_home>/plugins/installed-plugins}}\r\n# Replace the .jar below with the 9.17.4 previously copied ones:\r\n** {{portfolio-plugin-9.17.5.jar}}\r\n** {{jira-portfolio-9.17.5.jar}}\r\n\r\nh3. Solution\r\nJira Software 9.17.5 is the only affected version. The bug is fixed on version 10.0.0 onwards.","createDate":"2024-12-19T13:26:38.000+0000","comments":[{"text":"We observed this bug in *Jira V9.12.19* .","author":"AdamH"}]},{"summary":"Status breakdown progress bar shows incorrect status and colour in 9.x","key":"JSWSERVER-25315","url":"https://jira.atlassian.com/browse/JSWSERVER-25315","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe status breakdown progress bar shows all green even though the issue itself is in \"To Do\" status.\r\n\r\nThis is reproducible on Data Center: (yes)\r\nh3. Steps to Reproduce\r\n# Create a sample Scrum software project.\r\n# Create a new plan and linked to the newly created scrum board.\r\n# Create a new program and link to the newly created plan.\r\n# Create a new Epic in plan and submit the changes.\r\n# Open the program and check the status breakdown progress bar is all green:\r\n !jira940.png! \r\n\r\nh3. Expected Results\r\n\r\nThe status breakdown progress bar should calculate based on the issue status and shows the correct status color.\r\n\r\nh3. Actual Results\r\n\r\nThe status breakdown progress bar shows all green status that indicates the issue is completed or resolved even though the issue itself is in \"To Do\" or \"In Progress\" status.\r\n\r\nh3. Workaround\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available\r\n\r\nh3. Note\r\n\r\nThe problem is not happening in 8.22.x and 8.20.20 (LTS version)\r\n !jira82020.png! ","createDate":"2023-04-06T09:44:31.000+0000","comments":[{"text":"Hello,\r\n\r\nWhen do you plan to fix the bug, please?\r\n\r\nBest regards.","author":"Anna Tchevardov"},{"text":"Until a resolution will be provided, find below a workaround ..\r\n\r\nAdd these CSS in the Announce Banner.\r\n{code:java}\r\n<style>\r\n div.jpo-inner.jpo-inner-success{background:#14892c;}\r\n div.jpo-inner.jpo-inner-default{background:#707070;}\r\n div.jpo-inner.jpo-inner-inprogress{background:#de9f0b;}\r\n</style> {code}\r\n \r\n\r\nVincent","author":"Vincent (BleuLemon)"}]},{"summary":"The Parent Link field is not cleared when the Issue Type is changed and the Link isn't valid anymore","key":"JSWSERVER-24811","url":"https://jira.atlassian.com/browse/JSWSERVER-24811","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen an issue has a Parent Link and its issue type is changed to a type on another hierarchy level, the Parent Link data remains. Consequently, the Parent Link is still visible on the issue view with a warning icon that suggests the Parent Link violates the current Hierarchy configuration and should be updated by the user.\r\n\r\nThis issue is worsened when an Epic Link is also present on the Issue that had the Issue Type changed. The presence of an Epic Link makes Jira automatically hide the Parent Link from the Screens and makes it harder to remove the leftover data.\r\n\r\nThis issue can lead to unexpected and unusual behaviour in Jira. For instance, JQL queries may produce results that differ from what is anticipated. For example, 3rd party app that provides JQL functions to iterate over the Issue hierarchy ({*}linkedIssuesOfRecursive{*}) and can return a different set of issues than Jira functions like({*}childIssuesOf{*}).\r\n\r\nh3. Steps to Reproduce\r\n\r\n*Scenario 1*\r\n # Create a new issue type called 'Initiative'\r\n # Configure the hierarchy to be above Epic (at the top level)\r\n # Create a new issue with the issue type 'Initiative'\r\n # Link an Epic to the new Initiative using the parent link\r\n # Open the Epic and use More > Move to change the issue type to 'Initiative'\r\n\r\n*Scenario 2 (inconsistent results returned from childIssuesOf(...) query)*\r\n # Create a new project.\r\n # Configure the hierarchy like this:\r\n{code:java}\r\n- EpicBusiness\r\n-- Capability\r\n--- Epic\r\n----Story \r\n{code}\r\n\r\nA) The experienced Issue follows the below scenario ...\r\n - The Capability CAP-100 has the EpicBusiness EPB-100 as Parent.\r\n - The Epic EP-100 has CAP-100 as Parent\r\n - The JQL\r\nissue in childIssuesOf(EPB-100)\r\nreturns CAP-100 and all its child : Epic (EP-100), User Story (...), Sub-Task (...)\r\n\r\nB) A user move CAP-100 as an EpicBusiness : EPB-110\r\n - The JQL\r\nissue in childIssuesOf(EPB-110)\r\nreturns always same children as when it was CAP-100\r\n - The Epic EP-100 has EPB-110 as direct Parent, an EpicBusiness ! Normally, only Capabilities should be allowed as Parent of Epic\r\n - The JQL\r\nissue in childIssuesOf(EPB-100)\r\nreturns always same children, including EPB-110 (ex-CAP-100) ! Normally, an EpicBusiness can not have a EpicBusiness as Parent.\r\n\r\nIt is causing many inconsistencies in the users activities\r\n\r\n*Scenario 3 (involved 3rd party plugin)*\r\n\r\n*1.* Install a 3rd party app that provides JQL functions to iterate over Issue hierarchy\r\n\r\n*2.* Create Issue Types \"Initiative\" and \"Capability\" and add them to a Project's Scheme\r\n\r\n*3.* Add the Parent Link Custom Field to all Screens on that Project (to make it easier to follow the steps)\r\n\r\n*4.* Configure the Roadmaps Hierarchy so that Initiative > Capability > Epic\r\n\r\n*5.* Create a set of Issues organized as such:\r\n{code:none}\r\nInitiative 1\r\n  Capability 1\r\n    Epic 1\r\n\t  Story 1\r\n  Capability 2\r\n    Epic 2\r\n\t  Story 2\r\n\r\nEpic 3\r\n  Story 3\r\n{code}\r\n*6.* Create a Filter using the 3rd party app JQL function to list the Hierarchy of the top Issue, like:\r\n{code:none}\r\nissue = \"<Initiative 1 Issue Key>\" OR issueFunction in linkedIssuesOfRecursive(\"<Initiative 1 Issue Key>\", \"is parent of\")\r\n{code}\r\n*7.* Confirm all Issues under the hierarchy of \"Initiative 1\" are listed\r\n\r\n*8.* Change the Issue Type of \"Capability 2\" to Story (Move operation also works) and set it's Epic Link to \"Epic 3\"\r\n\r\n*9.* Reload the Filter and see \"Capability 2\" (now a Story) is still being listed, though it's now in the Hierarchy of \"Epic 3\", not under \"Initiative 1\"\r\n\r\nIf you use Jira's native JQL functions, the Epic Link has precedence over the (invalid) Parent Link and \"Capability 2\" is not listed anymore:\r\n{code:none}\r\nissue = \"<Initiative 1 Issue Key>\" OR issue in childIssuesOf(\"<Initiative 1 Issue Key>\")\r\n{code}\r\nh3. Expected Results\r\n\r\n- The parent link will be cleared as you should be able to only link an issue to a parent issue of the _corresponding hierarchy level_ that you've configured for your plan.\r\n- A Move Issue with change of Type (in Roadmap Hierarchy) must break all Parent Links or be blocked while a Parent-Child link exists\r\n- A Move Issue between JSW Issue Types and JPO Issue Types should be follow same rule\r\n- The JQL childIssueOf() should return children in respect of Hierarchies. Parent Link between Issue Type in same Level hierarchy should be ignored.\r\n\r\nh3. Actual Results\r\n * The parent link data remains and the warning below can be seen next to this field:\r\n{code}\r\nThis link is inconsistent with your Portfolio hierarchy.\r\n{code}\r\n * The parent link can't be edited as there is still Epic Link\r\n * The \"Capability\" Issue has a valid Epic Link which is prioritized by Jira and an invalid Parent Link which is ignored.\r\n * The data is still left over in both DB tables:\r\n{code:java}\r\nissuelink\r\nentity_property {code}\r\n* The JQL childIssueOf() return the same results after move the ticket to another parent hierarchy issue type.\r\n\r\n\r\nh3. Workaround\r\nh4. 1. Create an automation to remove the Parent Link\r\n\r\nCreate an automation rule that will automatically clear the *Parent Link* field whenever an issue is moved to a new issue type, as explained in the KB article linked below:\r\n * [Automation For Jira - How to clear the Parent Link field when an issue is moved to a new type|https://confluence.atlassian.com/pages/viewpage.action?pageId=1206795140]\r\n\r\nh4. 2. Remove Parent Link manually\r\n\r\nTo remove the parent link: \r\n * Convert the issue back to its previous issue type(e.g. Epic).\r\n\r\n * Remove the parent link. \r\n\r\n * Convert back to the new issue type.\r\n\r\nh4. 3. Remove existing data directly from the database\r\n\r\nTo clean up existing Issues' Parent Links refer to this documentation:\r\n * [Searching for child or parent Issues using JQL functions report wrong results in Jira|https://confluence.atlassian.com/pages/viewpage.action?pageId=1282250410]","createDate":"2017-11-28T07:03:18.000+0000","comments":[{"text":"We encountered this issue as well. Using Jira Data Center 7.10.2 with Portfolio version 2.21.0.","author":"Alex Christensen"},{"text":"Workaround: Change the hierarchy in  Portfolio Administration, clear the parent link field, revert the changes you previously made. ","author":"Mihai Schwarz"},{"text":"Thanks Mihai! Works perfectly.\r\n\r\nJust created a hierarchy above Initiative and saved changes. (Didn't bother to associate isssue types or change anything else)\r\n\r\nWent to the Initiative and cleared the Parent Link field. Reverted the changes back to original state in portfolio hierarchy.\r\n\r\nWorked like a charm :)","author":"Gowri Kumar"},{"text":"In my situation I fixed by:\r\n # removing the Epic Link from the Story - which revealed the Parent Link (with the warning icon)\r\n # removing Parent Link\r\n # re-assigning Epic Link\r\n\r\n \r\n\r\nBTW, this can't be done via Bulk Edit since, for some reason, the Issue Search and Bulk Edit recognize the fact that the Parent Link is invalid and, therefore, don't show it in search results or allow it to be set to Empty in a Bulk Edit.  \r\n\r\nPreventative medicine... make sure Epics and Stories use different screen schemes (even better, remove issue type from the screens).  That way users won't be able to turn an Epic into a Story, which is what made this issue manifest in our system.\r\n\r\nDefinitely +1ing this one.\r\n\r\n ","author":"Jordan Janis"},{"text":"This definitely causes incorrect outputs in our filters and structures. It is very difficult to repair because I cannot play around with the Portfolio hierarchy while thousands of users are working with that.","author":"Simone Kaiser"},{"text":"I have this same issue and I do not know how to access the Portfolio Admin for the suggested fix nor do I want it changed for all Initiatives. Our Hierarchy is Initiative > Epic -> Story -> Sub-Task.  Someone linked 3 Initiatives under one \"parent\" initiative. We are having trouble removing the 3 initiatives and unlinking them from the parent initiative. ","author":"Kathleen Black"},{"text":"Same issue for me as Kathleen Black above - it looks like a user has created Epics under a parent Initiative... and then converted those Epics to Initiatives.  And now they themselves have Epics underneath them.\r\n\r\nNeither the issue view, issue edit nor bulk edit screens will allow me to clear the field.\r\n\r\nHowever the fix from Mihai Schwarz is quick and works.  You don't even need to assign an issue type to the dummy entry you create.","author":"Richard Cross"},{"text":"*Workaround*\r\n\r\nCreate an automation rule that will automatically clear the Parent Link field whenever an issue is moved to a new issue type, as explained in the KB article linked below:\r\nhttps://confluence.atlassian.com/jirakb/automation-for-jira-how-to-clear-the-parent-link-field-when-an-issue-is-moved-to-a-new-type-1206795140.html","author":"Julien Rey"},{"text":"Dear all,\r\n\r\nI would like to inform you that the Jira DC Development team has reviewed the following issues: [JPOSERVER-2059|https://jira.atlassian.com/browse/JPOSERVER-2059], [JSWSERVER-21939|https://jira.atlassian.com/browse/JSWSERVER-21939], [JPOSERVER-2895|https://jira.atlassian.com/browse/JPOSERVER-2895], [JPOSERVER-4360|https://jira.atlassian.com/browse/JPOSERVER-4360] and [JPOSERVER-7116|https://jira.atlassian.com/browse/JPOSERVER-7116]. After careful consideration, we have determined that they describe the same issue. Therefore, all issues will be merged into [JPOSERVER-2059|https://jira.atlassian.com/browse/JPOSERVER-2059], while the other issues will be closed. If you would like to keep track of the problem, please vote and watch [JPOSERVER-2059|https://jira.atlassian.com/browse/JPOSERVER-2059].\r\n\r\nAtlassian will continue to watch this issue for further updates, so please feel free to share your thoughts or feedback in the comments.\r\n\r\nSincerely,\r\nDaniel Dudziak\r\nJira DC Senior Software Engineer","author":"Stasiu"},{"text":"Dear all,\r\nI would like to inform you that this issue in the project JPOSERVER is being migrated to the new project JSWSERVER. Your votes and comments will remain unchanged.\r\nOur team at Atlassian will continue to monitor this issue for further updates, so please feel free to share your thoughts or feedback in the comments.\r\nSincerely,\r\nAakrity Tibrewal\r\nJira DC","author":"Aakrity Tibrewal"}]},{"summary":"Editing issue type breaks Roadmap hierarchy","key":"JSWSERVER-24805","url":"https://jira.atlassian.com/browse/JSWSERVER-24805","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nIf a user edits an issue (either with the edit button or bulk update) to update the issue type of an issue, Roadmap does not automatically disassociate the issue from existing parent issue even if it does not match the Roadmap hierarchy configuration.\r\n\r\nh3. Steps to Reproduce\r\n\r\n# Create a hierarchy such as : L1 (Level 1 issue), L2 (Level 2 issue), L3 (Epic),...\r\n# Create an issue with Level 1 issue type.\r\n# Create 2 issues with Level 2 issue type.\r\n# Create 2 issues with Epic issue type.\r\n# Access the Roadmap plan which shows the issues.\r\n# Move the newly created Level 2 issues as child issue of Level 1 issue.\r\n# Move each of newly created Epic issues as child issue of Level 2 issues.\r\n# Review and publish the changes from plan.\r\n# Open one of the Level 2 issue in an issue view.\r\n# Edit the issue type of the Level 2 issue to Level 1 issue.\r\n# Access the plan again and we will see the Level 1 issue has an Epic issue as child issue which does not follow the Roadmap hierarchy.\r\n\r\nScreen recording: [^JPO-4277.webm] \r\n\r\nh3. Expected Results\r\n\r\n* Roadmap automatically disassociate the child issue of the parent issue if the configuration is against the Roadmap's hierarchy configuration.\r\n\r\nh3. Actual Results\r\n\r\n* Child issue remains to be associated with the parent issue even though it's against the Roadmap's hierarchy configuration.\r\n\r\nh3. Workaround\r\n\r\n# Expose \"Parent Link\" custom field by following steps [here|https://confluence.atlassian.com/advancedroadmapsserver/showing-advanced-roadmaps-custom-fields-in-jira-857058481.html] and manually remove the invalid child issues from the parent issue.\r\n# Dissociate the child issue from invalid parent issue from the Roadmap plan. Users can drag and drop the issue affected the issue from the plan.","createDate":"2020-06-17T11:00:17.000+0000","comments":[{"text":"Dear all,\r\nI would like to inform you that this issue in the project JPOSERVER is being migrated to the new project JSWSERVER. Your votes and comments will remain unchanged.\r\nOur team at Atlassian will continue to monitor this issue for further updates, so please feel free to share your thoughts or feedback in the comments.\r\nSincerely,\r\nAakrity Tibrewal\r\nJira DC","author":"Aakrity Tibrewal"},{"text":"Closing this ticket as duplicate of JSWSERVER-24811","author":"Julien Rey"}]},{"summary":"When utilizing the sprint name, Jira filter search is rather slow.","key":"JSWSERVER-21918","url":"https://jira.atlassian.com/browse/JSWSERVER-21918","type":"Bug","priority":"","description":"h3. Problem\r\n\r\nWhen a user filter has more than 50+ sprint names selected in the advanced JQL query, it will cause the query to be running slowly. For example:\r\n{code}\r\nproject in (TEST) AND sprint in (Sprint-A, Sprint-B, Sprint-C, Sprint-D and so on....)\r\n{code}\r\n\r\nThe searching does not impact admin users.\r\n\r\nh3. Diagnose\r\n\r\nIn the thread dumps, we can see the long-running stack trace hitting 99% CPU usage is checking the number of sprints for each issue and user permissions:\r\n{code}\r\n13:17:52 - http-nio-8080-exec-6 url: /issues/, /secure/IssueNavAction!default.jspa; user: username\r\nState:RUNNABLE\r\nCPU usage:99.90%\r\nRunning for: 1:35.33\r\nWaiting for\r\nThis thread is not waiting for notification on any lock\r\nLocks held\r\nThis thread holds [0x7fca4dcb0680, 0x7fc988f45820]\r\nStack trace\r\ncom.atlassian.greenhopper.customfield.sprint.IssueCountPerSprintCollector.collect(IssueCountPerSprintCollector.java:45)\r\norg.apache.lucene.search.Weight$DefaultBulkScorer.scoreAll(Weight.java:233)\r\norg.apache.lucene.search.Weight$DefaultBulkScorer.score(Weight.java:184)\r\norg.apache.lucene.search.BulkScorer.score(BulkScorer.java:39)\r\norg.apache.lucene.search.IndexSearcher.search(IndexSearcher.java:660)\r\norg.apache.lucene.search.IndexSearcher.search(IndexSearcher.java:462)\r\ncom.atlassian.jira.index.stats.IndexSearcherWithStats.search(IndexSearcherWithStats.java:88)\r\ncom.atlassian.jira.index.DelegateSearcher.search(DelegateSearcher.java:169)\r\ncom.atlassian.jira.index.DelegateSearcher.search(DelegateSearcher.java:169)\r\ncom.atlassian.jira.index.UnmanagedIndexSearcher.search(UnmanagedIndexSearcher.java:9)\r\ncom.atlassian.jira.index.DelegateSearcher.search(DelegateSearcher.java:169)\r\ncom.atlassian.jira.index.ManagedIndexSearcher.search(ManagedIndexSearcher.java:15)\r\ncom.atlassian.jira.issue.search.providers.LuceneSearchProvider.search(LuceneSearchProvider.java:324)\r\ncom.atlassian.jira.issue.search.providers.LuceneSearchProvider.search(LuceneSearchProvider.java:158)\r\njdk.internal.reflect.GeneratedMethodAccessor2973.invoke(Unknown Source)\r\njdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(java.base@11.0.19/DelegatingMethodAccessorImpl.java:43)\r\njava.lang.reflect.Method.invoke(java.base@11.0.19/Method.java:566)\r\ncom.atlassian.plugin.util.ContextClassLoaderSettingInvocationHandler.invoke(ContextClassLoaderSettingInvocationHandler.java:26)\r\ncom.sun.proxy.$Proxy403.search(Unknown Source)\r\njdk.internal.reflect.GeneratedMethodAccessor2973.invoke(Unknown Source)\r\njdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(java.base@11.0.19/DelegatingMethodAccessorImpl.java:43)\r\njava.lang.reflect.Method.invoke(java.base@11.0.19/Method.java:566)\r\ncom.atlassian.plugin.osgi.bridge.external.HostComponentFactoryBean$DynamicServiceInvocationHandler.invoke(HostComponentFactoryBean.java:130)\r\ncom.sun.proxy.$Proxy403.search(Unknown Source)\r\ncom.atlassian.greenhopper.service.sprint.SprintIssueServiceImpl.getIssuesCountForSprints(SprintIssueServiceImpl.java:382)\r\ncom.atlassian.greenhopper.service.sprint.SprintServiceImpl.getSprintsAccessibleFromIssue(SprintServiceImpl.java:750)\r\ncom.atlassian.greenhopper.service.sprint.SprintServiceImpl.getSprints(SprintServiceImpl.java:190)\r\ncom.atlassian.greenhopper.customfield.sprint.SprintResolver.getSprintsStreamByPredicate(SprintResolver.java:84)\r\ncom.atlassian.greenhopper.customfield.sprint.SprintResolver.findSprintIdsByName(SprintResolver.java:42)\r\ncom.atlassian.greenhopper.customfield.sprint.SprintClauseValidator.validate(SprintClauseValidator.java:70)\r\ncom.atlassian.jira.jql.validator.ValidatorVisitor.validateClause(ValidatorVisitor.java:132)\r\ncom.atlassian.jira.jql.validator.ValidatorVisitor.visit(ValidatorVisitor.java:73)\r\ncom.atlassian.jira.jql.validator.ValidatorVisitor.visit(ValidatorVisitor.java:36)\r\ncom.atlassian.query.clause.TerminalClauseImpl.accept(TerminalClauseImpl.java:143)\r\ncom.atlassian.jira.jql.validator.ValidatorVisitor.getMessagesFromSubClauses(ValidatorVisitor.java:165)\r\ncom.atlassian.jira.jql.validator.ValidatorVisitor.visit(ValidatorVisitor.java:55)\r\ncom.atlassian.jira.jql.validator.ValidatorVisitor.visit(ValidatorVisitor.java:36)\r\ncom.atlassian.query.clause.AndClause.accept(AndClause.java:28)\r\ncom.atlassian.jira.bc.issue.search.DefaultSearchService.validateQuery(DefaultSearchService.java:272)\r\n{code}\r\n\r\nh3. Current Design\r\n\r\nEvery time user asks for sprint we're checking if the user has access to it and it has if the user:\r\n* is an admin,\r\n* OR has access to the board\r\n* OR has access to any issue from this sprint.\r\n\r\nh3. Suggestions\r\n\r\nTo fix that problem by creating a feature flag or cache the results to improve the performance in the future.\r\n\r\nh3. Workaround\r\n\r\nTo speed up the searching process, we recommend a workaround by replacing sprint names with sprint IDs.\r\n\r\nTo find the Sprint ID, please paste the sprint names and run the SQL query:\r\n{code}\r\nSELECT ID, NAME FROM AO_60DB71_SPRINT WHERE NAME like '%SPRINT_NAME%';\r\n{code}\r\n(i) Replace *SPRINT_NAME* with the sprint name from the filter.\r\n\r\nOr you can find the sprint id following the [Jira Software: How to identify the ID of a sprint|https://confluence.atlassian.com/jirakb/jira-software-how-to-identify-the-id-of-a-sprint-779159065.html] KB article.\r\n\r\nUpdate all the sprint names to id from the filter and then saved the filter.\r\n\r\n\r\n\r\n\r\n","createDate":"2023-08-16T12:38:57.000+0000","comments":[]},{"summary":"Adding a condition on a workflow changes the ordering of the status in the board","key":"JSWSERVER-21576","url":"https://jira.atlassian.com/browse/JSWSERVER-21576","type":"Bug","priority":"","description":"h3. Issue Summary\r\nThe status order changes in Jira board after adding a condition to the workflow\r\n\r\nThis is reproducible on Data Center: yes\r\nh3. Steps to Reproduce\r\n # Import the workflow and add a scheme for this workflow  \r\n[^Software-Simplified-Workflow-for-Project-TK.jwb] \r\n # Create a project with this scheme \r\n # Arrange the board columns like below  \r\n!board-columns.png|thumbnail! \r\n # Create a sprint and try to transition the issue, {{In progress}} status appears above {{Rejected}}\r\n !order-before-condition.png|thumbnail! \r\n # Edit the workflow and add a new condition for transition between {{NEW}} and {{TO DO}} \r\n !workflow-condition.png|thumbnail! \r\n # Publish the workflow\r\n !order-after-condition.png|thumbnail! \r\n\r\nh3. Expected Results\r\n{{In progress}} status should still appear above {{Rejected}}\r\nh3. Actual Results\r\n{{In progress}} status appears below {{Rejected}}\r\n\r\nh3. Workaround\r\nTransition the issue to the required status by dropping the issue in the respective box\r\n","createDate":"2022-12-19T08:53:09.000+0000","comments":[{"text":"We just added a condition and since, the cancel status appears before the done status in every boards... customers are not happy.\r\n\r\nTried using opsbar sequence property and it didn't help :(\r\n\r\nJira 9.12.14 affected :(","author":"Jonathan Claveau"},{"text":"Same issue here","author":"larndt"}]},{"summary":"The development status summary panel is timing out when under heavy load even if data is available","key":"JSWSERVER-20977","url":"https://jira.atlassian.com/browse/JSWSERVER-20977","type":"Bug","priority":"","description":"h3. Issue Summary\r\nThe development status summary panel is timing out when under heavy load even if data is available\r\nh3. Steps to Reproduce\r\n# Connect a DVCS integration (Bitbucket, Gitlab or Github) with a linked issue\r\n# Open 30+ tabs that auto-refresh (can use http://www.dummysoftware.com/easy-auto-refresh/?ref=chrome for this)\r\n# In a separate browser open that same issue and refresh a few times until you see an error message about timeout or failure to load under the dev panel:\r\n !Screenshot 2021-06-09 at 16.22.00.png|thumbnail! \r\n\r\nThe following exception is thrown into logs:\r\n{noformat}\r\n2021-06-09 15:02:19,323+0100 http-nio-2990-exec-218 WARN admin 902x36691x25 eeeqnf 127.0.0.1 /rest/dev-status/1.0/issue/summary [c.a.j.p.devstatus.provider.DefaultCoordinator] GitLab (timeout after 5000ms, cached data returned)\r\n{noformat}\r\n\r\nThere’s only 15 threads max that can fetch DVCS data at a time so this is causing contention:\r\n\r\n{code:java}\r\n   this.dvcsDataFetcherExecutor = ThreadPool.builder()\r\n                .name(\"dvcs.\" + dvcsType())\r\n                .maxThreads(15)\r\n                .boundedQueue(QUEUE_SIZE)\r\n                .build();\r\n{code}\r\n\r\nand the call to timeout. Note that increasing the timeout will not help here.\r\n\r\n\r\nh3. Expected Results\r\nDVCS data related to the issue should load in the Dev Panel.\r\nh3. Actual Results\r\nData is not loaded into the dev panel which should return either the cached existing data or the new one stored into DB after soft or hard sync.\r\n\r\nh3. Workaround\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2021-06-09T14:26:43.000+0000","comments":[{"text":"The issue also happens in v9.12.14","author":"olgap"}]},{"summary":"Links in Kanplan acknowledge feature in dashboards are not working","key":"JSWSERVER-19751","url":"https://jira.atlassian.com/browse/JSWSERVER-19751","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen a Kanban backlog board is being used in a gadget on a dashboard, a Kanplan acknowledge section is being rendered on top of it with the following text:\r\n\r\n{quote}A bigger and better backlog has just landed\r\nWe've created a dedicated space for you to plan in the new Kanban backlog. This board will now be a distraction-free zone for your team to focus on work-in-progress.{quote}\r\n\r\nThat acknowledgment has links like \"Take me there\", \"Close\", etc, and none of them are working when viewed on the dashboard. The same links work fine when the acknowledgement is viewed in the board view.\r\n\r\nh3. Steps to Reproduce\r\n# Create a Kanban project\r\n# Create a Kanban board\r\n# Enable Kanban feature by dragging unmapped status to the leftmost column in \"Columns\" configuration of the board\r\n# Use this board in a dashboard gadget\r\n\r\nh3. Expected Results\r\nUsers are able to dismiss the alert when rendered on a dashboard.\r\n\r\nh3. Actual Results\r\nClicking on any links in the alert do nothing. Nothing is logged in the Javascript console either.\r\n \r\nh3. Workaround\r\nIt is possible to disable the banner altogether by modifying {{$JIRA_INSTALL/atlassian-jira/WEB-INF/application-installation/jira-software-installation/jira-greenhopper-plugin-xxxx.jar/atlassian-plugin.xml}} and commenting out all sections referencing KanplanAcknowledge resources:\r\n\r\n{code:xml}<!--<resource type=\"download\" name=\"KanPlanAcknowledge.js\" location=\"includes/js/rapid/ui/kanplan/KanPlanAcknowledge.js\"/>-->\r\n<!--<resource type=\"download\" name=\"KanPlanAcknowledge.soy.js\" location=\"includes/js/rapid/ui/kanplan/KanPlanAcknowledge.soy\"/>-->{code}\r\n\r\nSave the modified file in a JAR file, and restart Jira for change to take effect.","createDate":"2018-11-19T11:36:09.000+0000","comments":[{"text":"As an adminitrator of a Jira Software Server instance, the workaround worked on my Jira v7.13.0 installation.","author":"Valsaa"},{"text":"In 7.6.16 the board will only display an error:\r\n{noformat}\r\nException: Error: No jira-agile/rapid/ui/kanplan/kanplan-acknowledgeResource:\r\n \r\n$BASEURL/s/2b34135516436c66dc4008be143a9a30-CDN/-wzvu94/76018/555d62bf9c44f2f8cb402b18979ce098/c04a1d358299041d8938caf7d7bdee3f/_/download/contextbatch/js/_super/batch.js?locale=en-USLine: 25Column: 983Exception: TypeError: GH.RapidBoard.State is undefinedResource:\r\n \r\n$BASEURL/s/2a1c25626d34b91d7303e3792d9be24e-CDN/-wzvu94/76018/555d62bf9c44f2f8cb402b18979ce098/a7569d1b4834118095b0394249632b3f/_/download/contextbatch/js/greenhopper-rapid-non-gadget,atl.general,gh-rapid,jira.project.sidebar,com.atlassian.jira.projects.sidebar.init,jira.global,jira.general,-_super/batch.js?agile_global_admin_condition=true&healthcheck-resources=true&is-server-instance=true&is-system-admin=true&jag=true&jaguser=true&locale=en-US&nps-not-opted-out=true&richediton=true&whisper-enabled=trueLine: 14595Column: 269\r\n {noformat}","author":"Thomas Weißschuh"},{"text":"We face the same problem here.\r\n\r\nJust wondering: As customers pay for Atlassian support, they should be able to expect a fix for such a bug (honestly, it should be found in Atlassians own tests before the software gets released) at least in the next long term release. Instead, after more than a year Atlassian is still gathering impact. What do you charge for support when so many issues do not get fixed? Most customers are more interested in reliable software than in new features.","author":"Antje Stejskal"},{"text":"This is so crucial and basic. We do not want to look at a redundant message that we can not close or interact with every time we open our dashboard. ","author":"Hannah Bölling"}]},{"summary":"Migrating workflows on existing projects can impact Agile reporting if statuses are changed","key":"JSWSERVER-16687","url":"https://jira.atlassian.com/browse/JSWSERVER-16687","type":"Bug","priority":"","description":"h3. Summary\r\n It appears Jira Software loses viability on an issue's change history when a previously existing status is removed ( changed ) from the project's workflow. This affects the historical reporting on the various agile charts for the affected project.\r\nh3. Steps to Reproduce\r\n # Configure a workflow with the following statuses\r\n ## Open -> In Progress -> Resolved -> Closed\r\n # Create a sprint, add an issue from the backlog, transition every step from Open until Closed, and complete the sprint\r\n # Create new workflow with the following statuses\r\n ## Open -> In Progress -> Status 9\r\n # Migrate workflow, map issues in Resolved and Closed to Status 9\r\n\r\nh3. Expected Results\r\n\r\nAgile reports are unaffected by this change\r\nh3. Actual Results\r\n\r\nSprint report show issues moved from Resolved and Closed to Status 9 as being In Progress and Removed From Sprint. Cycle Time is also incorrectly calculated for these issues as well. See attached screenshots.\r\n\r\nIssue history:\r\n !issue-history.png|thumbnail!\r\n\r\nSprint report:\r\n !sprint-report-bad.png|thumbnail!\r\n\r\nNotice how the Sprint report shows issue 1 as Open instead of Status 9\r\nh3. Notes\r\n\r\nOther Agile reports may be affected from this change.\r\n While the original report comes from Jira 6.4 / Jira Agile 6.7 we reproduced this problem in Jira 7.11 too.\r\n\r\nThis can affect any status on the far right or far left for example if you leave out a to do status from the old workflow, the sprint report will not see that the issues were ever \"started\" and it will negatively affect burndown\r\nh3. Workaround\r\n\r\nModify the affect project's workflow, add changed status back, and map this status to a column in the project's agile board(respective to their position in the old board i.e. far right or far left) They do not need transitions to or from other statuses. In the example above Agile reporting is fixed by adding Resolved and Closed back to the affected project's workflow and mapping the statuses to the Done column accordingly. See attached screenshot.\r\n\r\n!sprint-report-fixed.png|thumbnail!","createDate":"2018-07-16T21:40:59.000+0000","comments":[{"text":"I'm having the exact same issue. Trying a re-index to see if that helps...at its surface this seems like a pretty big bug......we're a VERY LARGE enterprise customer running JIRA v7.6.7","author":"David Phillips"},{"text":"+1 another large enterprise customer running 7.10.1 and seeing this same issue. The work around definitely works, but is certainly inconvenient.","author":"Xaviar Steavenson"},{"text":"Also having this issue (in cloud). This impacted 4 projects during an audit period, and could have had extreme consequences for those teams.","author":"Rabbit Stoddard"},{"text":"This appears to be affecting us as well. Doing more testing but at first glance we are seeing exactly this.","author":"Josh Sisk"},{"text":"Possibly due to the creation of a new workflow and the deleting of the previously used one, the workaround does not appear to work for my organization.","author":"Mark Holden"},{"text":"I think that this problem should be a bit higher.  If they are encouraging a healthy Jira environment, but implementing unification changes for states across the instance (if you have 40 statuses that mean nearly the same thing), when you attempt to convert a workflow to utilize one and remove the old state off of the board, it messes with the area's sprint and velocity reports. In my mind, this should have snapshot of what it was when the work was done on the sprint, not how the board's current state is.","author":"Christina Robinson"},{"text":"This is affecting us as well (another very large enterprise customer). Agree that this should be ranked higher.","author":"astravalters"},{"text":"We've also seen the mismatch, do we have an idea when this issue will be better handled?","author":"William.falconer"},{"text":"Just happened to me as well with the workflow change. It's a concerning result.","author":"Logan Marks"},{"text":"We created company templates and slowly moving projects to our new template, after migrating old sprint reports does not show any story points since closing statutes haved change a lot compared to very old templates.\r\n\r\nThe workaround is not a good idea, we would have to keep old statutes in our new templates, Jira should manage this properly by itself.\r\n\r\nWe have over 9000 users and more and more are complaining about this problem, will Atlassian do something about it?","author":"Jonathan Claveau"},{"text":"Significant impact as well. We updated our workflow to add future steps, and all issues from previously closed sprints moved into our backlog. ","author":"Brendan Cannon"},{"text":"Hi Team , any solution for this issue  .  ","author":"Priyanka sharma"},{"text":"This is happening to my team, however we're on CLOUD and not server.  I added an additional workflow step (in the done category), however now Sprint Reports see them as In Progress, and not in the new status.  If you go into the query (in the sprint report) it appears in the correct status.  \r\n\r\nTLDR - if you change a workflow for issues in sprint, some may not appear to map correctly to the new statuses inside sprint reports","author":"Chris Buzon"},{"text":"We have this problem on 8.11.0 Data center.","author":"Pascal Robert"},{"text":"Can we get prioritize this issue please? Don't think *Symptom Severity: Severity 2 - Major* means it can be open for 2 years. Cmon Atlassian. ","author":"Sid"},{"text":"We have a project to cleanup the workflow statuses on our Jira instance running on 8.5.8, however, due to this issue we are unable to achieve our requirement. Please provide a solution to this issue.","author":"Sreedevi Raman Pisharody"},{"text":"This is a {color:#ff0000}SEVERE{color} and {color:#ff0000}MAJOR{color} problem with the basic functionality of Jira that renders the system useless.  If we can't make workflow changes for any reason whatsoever this is a {color:#ff0000}show stopping{color} BUG!  Using Jira Datacenter\r\n * v8.14.0#814001","author":"Recurly Operations"},{"text":"We too suffer from this problem. A recent fix in our workflow renders all reports of previous sprints useless. Detemination of velocity for multiple teams is impacted.","author":"Alex van Zanten"},{"text":"We recently made a status change in our default workfow, used by a couple of hundred teams. This known error really caught us off guard. The teams are negatively affected by this: they are missing crucial steering- and report information.\r\n\r\n- Velocity cannot be determined anymore for current sprints / releases;\r\n- Data can not be compared anymore to previous sprints;\r\n- All in all, the report information now feels 'inrealiable\" to our users.\r\n\r\nI'm really surprised, that this major error is still \"gathering impact\" and prioritized as Low. As our Jira users grow rapidly (>5000), we are continuously optimising our configuration. And we should be able to make changes - like this status change - without losing information along the way, and without users losing confidence in the tool.\r\n\r\nPlease, implement a solution for this error and give it more priority.","author":"Michelle de Bruijn"},{"text":"Hi Atlassian,\r\n\r\nI think you should read this great article I found on the web: [https://www.atlassian.com/agile/scrum/scrum-metrics]\r\n\r\nIt says:\r\n{quote}*Summary:* _Scrum metrics are specific data points that scrum teams track and use to improve efficiency and effectiveness. Scrum teams use metrics to inform decision-making and become more efficient in planning and execution, as well as set target goals and improvement plans._\r\n\r\n“If you can’t measure it, you can’t improve it,” noted famous management thinker Peter Drucker. While this isn’t a statement that applies to every facet of life, it does apply to teams practicing agile scrum. By using certain metrics, scrum teams can adjust, pivot, and refine team effectiveness.\r\n{quote}\r\nLooks like your teams don't really understand the importance of having reliable data with which to measure, track, and improve. It's possibly one the most important aspects of agile methodologies, in my (and your) opinion. Such a bizarre disconnect between your marketing/outreach and dev teams...","author":"Desmond Cox"},{"text":"Can we please get movement on this bug? It is impacting nearly a dozen of our engineering teams","author":"Abiy Kaltiso"},{"text":"Look at the logic for the BURNUP Charts which work before and after conversion with historical data!\r\n\r\n!image-2023-01-11-14-00-16-407.png!\r\n\r\n ","author":"2Manyc0des!"},{"text":"{panel:title=Atlassian Update – 07 June 2023|borderStyle=solid|borderColor=#deebff | titleBGColor=#deebff | bgColor=#deebff}\r\n\r\nDear Customers,\r\n\r\nThank you for taking the time to file and comment on this issue. We realize it still occurs and impacts your organization. We are now working on multiple customer requests and on new features, so we have to postpone our resolution of this issue. We’ve decided to move this issue to our long-term backlog.\r\n\r\nThe workaround for this bug is as follows:\r\nModify the affected project's workflow, add the changed status back with no transitions, and map this status to a column in the project's agile board (respective to their position in the old board i.e. far right or far left)\r\n\r\nPlease continue watching this ticket for future updates and changes in the timeline that impacts your work.\r\n\r\nBest regards\r\n\r\nSławomir Zaraziński\r\n\r\nJira Developer\r\n\r\n{panel}","author":"Sławomir Zaraziński"},{"text":"We came across this bug on 7th of June 2023, just when this update comment was made.\r\n\r\nOur testing to put the status back (and bulk migrate issues back to that old status) did not resolve the problem - and we're not happy to apply this workaround en-mass unless it works for our testing.\r\n\r\nAny other things to try?\r\n\r\nCan devs tell us what the fields that the reporting is reading off - for sure they are fields we can't see with frontend - but people might be able to fix data in the database directly - if there's documentation on how the reporting functions work.","author":"Eric Lee"},{"text":"Found a quick and easy fix for this- at least in the server version.  Since the reports are based off the columns in the board instead of the issue statuses themselves (take a look at the cumulative report- you see column headings- not statuses) simply delete and re-create your columns.  \r\n\r\nWe were standardizing projects where some had the final status of \"Done\" and others \"Closed\". We wanted them all as \"Closed\", so created standard schemes and moved all projects to those schemes.  Where Done was changed to Closed, we lost all of our completed issues in our reports.\r\n\r\nWent into the board settings and deleted the column for \"done\", and replaced it with a new column \"closed\".  Viola!  All of our completed issues magically re-appeared!","author":"Michael Ballenger"},{"text":"Why has this Jira product defect has not been fixed yet? We are now encountering this issue after we renamed a few Jira statuses for standardization. We can not revert the Jira statuses that were not renamed...... ","author":"John.Morales"},{"text":"It's been 6 years since this software defect has been reported. Why isn't this defect resolved by now. Where is our Atlassian Jira Product Manager / Owner who is representing the voice of the customer. Please prioritize this product software defect instead of working on dark mode feature.","author":"John.Morales"},{"text":"HI Daniel Dudziak, this product defect has been reported for several years without a resolution. Why is Atlassian Jira Software product support not prioritizing this major product defect? All of our reports are now inaccurate and the workaround solution is not optimal. I am requesting to revisit this product defect and discuss further with your senior management and product management.","author":"John.Morales"}]},{"summary":"Timeout errors can occur when completing sprints in Scrum boards","key":"JSWSERVER-16329","url":"https://jira.atlassian.com/browse/JSWSERVER-16329","type":"Bug","priority":"","description":"h3. Summary\r\nIf completing a sprint takes longer than 60 seconds one will experience a timeout message similar to the following:\r\n !release_timeout.png|thumbnail! \r\n\r\nh3. Environment\r\n* Bulk editing large amount of issues ( 200+ ) takes longer than 60 seconds\r\n\r\nh3. Steps to Reproduce\r\n# To reproduce artificially, lower the [AJAX timeout |https://confluence.atlassian.com/jirakb/how-to-change-the-default-ajax-timeout-in-jira-server-824345485.html]to something like 10 seconds and do a sprint release on 3,000 issues\r\n# Have a large number of issues in a sprint ( 200+ )\r\n# Use remote fields, other customizations, or poor performance that results in bulk editing these issues to take longer than 60 seconds\r\n# Attempt to complete sprint, receive error message\r\n\r\n\r\nh3. Expected Results\r\nA more descriptive error message is displayed like the one we implemented for Kanban boards, https://jira.atlassian.com/browse/JSWSERVER-11775\r\n\r\nh3. Actual Results\r\nA generic timeout error is displayed\r\n \r\nh3. Notes\r\nEven though a timeout error is displayed the process does continue and issues within the sprint are completed successfully ","createDate":"2018-01-10T19:34:53.000+0000","comments":[{"text":"I experience similar issue on 7.12.3.","author":"Krzysztof Krajewski"},{"text":"We have this issue in 7.13.8, even with a small amount bulk edits to a sprint","author":"Joel Berman"},{"text":"We have on 7.13.11","author":"Gonchik Tsymzhitov"},{"text":"We have 8.5.1 and we get a timeout error when releasing issues from a Kanban board.\r\n\r\n!image-2020-05-19-13-02-41-684.png!","author":"Luís GÓIS"},{"text":"I've 8.5.0, all time when I close sprint, go timeout. When I close, I put all issue to next sprint, if Jira go time, it put them in backlog","author":"Stefano Falasca"},{"text":"We are experiencing this when clicking \"Release\" in a Kanban board. We are getting a timeout and tickets are not removed from the \"DONE\" column. This occurs for us in Jira Datacenter 8.5.5","author":"Heather Ungarten"},{"text":"Got the same going on here - running 8.7.1.  I just hit \"Complete Sprint\" and chose to move 662 issues that are not yet complete to the new move.  That timed out.  This happens every month.","author":"Mark Haller"},{"text":"Hello, \r\n\r\nwe are facing the same issues on Jira 8.13.1 and even with 50-100 issues!\r\n\r\nLuckily sometimes the process is completed, but the Banner Error is quite annoying. :)\r\n\r\n \r\n\r\nAny ETA on this?\r\n\r\nThank you!","author":"Roberto Martignano"},{"text":"We are hitting this occasionally as well in 8.13.2. \r\n\r\nThank you,\r\nDarin","author":"Darin Klein"},{"text":"We see this on Jira 8.20.6.  It really messed up the completed sprint value on the completed issues and seemed to pull in a load of issues not associated with the sprint into the Done column on the next sprint.","author":"Cyril Egan"},{"text":"Jira 8.20.2 is also affected, but this could be a temporary workaround: [https://confluence.atlassian.com/jirakb/how-to-change-the-default-ajax-timeout-in-jira-server-824345485.html]","author":"Andreas Morgner"},{"text":"Hi Team,\r\n\r\n \r\n\r\nThis really annoys our users, please try to give a fix ASAP.\r\n\r\n \r\n\r\nThanks","author":"VIMAL RAJ"},{"text":"We need this to be solved urgently as we cannot minimize a number of incomplete issues in Sprint when it's closing. Timeouts caused more and more attempts by a user to complete the current sprint. Thus, there is kind of mess in DB and hours of work to actually make the Sprint look completed successfully.","author":"Yana Stoliarova"},{"text":"v.8.20.14 also have the same error","author":"GI"},{"text":"8.20.17 as well","author":"Alexander Garanin"},{"text":"8.22.6 also have the same error.","author":"Praveen Kumar Tupakula"},{"text":"https://getsupport.atlassian.com/browse/PSSRV-67899\r\n","author":"Barış Türkkal"},{"text":"{panel:title=Atlassian Update – 25 April 2023|borderStyle=solid|borderColor=#deebff | titleBGColor=#deebff | bgColor=#deebff}\r\n\r\nDear Customers,\r\n\r\nThank you for taking the time to file and comment on this issue. Feedback like yours helps us release valuable Jira features that solve problems for a greater customer base. To that end, we aim to keep our issues up-to-date so they accurately reflect current customer needs. Based on the impact, we’ve decided to move this issue to our short-term backlog. \r\n\r\nPlease continue watching this ticket for future updates and changes in the timeline that impacts your work.\r\n\r\nBest regards\r\n\r\nDaniel Dudziak\r\nSenior Software Engineer\r\n\r\n{panel}","author":"Stasiu"},{"text":"{panel:title=Atlassian Update – 17 July 2023|borderStyle=solid|borderColor=#deebff | titleBGColor=#deebff | bgColor=#deebff}\r\n\r\nDear Customers,\r\n\r\nThank you for taking the time to file and comment on this issue. We realize it still occurs and impacts your organization. We are now working on multiple customer requests and on new features, so we have to postpone our resolution of this issue. We’ve decided to move this issue to our long-term backlog. \r\n\r\nPlease continue watching this ticket for future updates and changes in the timeline that impacts your work.\r\n\r\nBest regards\r\n\r\nSławomir Zaraziński\r\nJira DC Developer\r\n{panel}","author":"Sławomir Zaraziński"},{"text":"This issue is in 9.3.4 too, as well in sprint having less than 20 tickets even. ","author":"MRANJ"},{"text":"We are running Jira DC V9.4.9 and we are affected by this Bug. Could you please prioritize fixing the Bug?","author":"Mohana Sundar J"},{"text":"Still repro in 9.4.9","author":"Cedric Lavoie"},{"text":"+v8.5.4","author":"Nirmani.Kalakheti"},{"text":"+9.4.14","author":"Cedric Lavoie"},{"text":"The workaround isn't a perfect one, as Jira takes 8-10 minutes to migrate all the data to the next sprint, which means, you cannot do this during a meeting and get a live report without making everyone wait, which isn't efficient","author":"Cedric Lavoie"},{"text":"+9.4.14","author":"Cristina Axentoi"},{"text":"- 9.12.8 also have this issue, even with only 1 or 2 issues in the sprint we are getting similar issue.","author":"sai kumar"},{"text":"Maybe someone will share profiling log? \r\nwhich can help to easier detect an issue? \r\n[~77db90677e1d] how many tickets were in that sprint? \r\n\r\n","author":"Gonchik Tsymzhitov"},{"text":"[~4555db5a5f8f] the sprint has 2 issues or 20 issues the behavior is same time-out issues. I have uploaded the profiling logs to ticket PSSRV-127031","author":"sai kumar"},{"text":"[~jcurry] I cannot reproduce this step:\r\nbq. Use remote fields, other customizations, or poor performance that results in bulk editing these issues to take longer than 60 seconds\r\n\r\nCould you provide specific steps to repro?\r\nWe missed that during triage. I'm closing as \"cannot reproduce\". Feel free to reopen when repro steps are updated.\r\n\r\nWRT the \"Expected Results\", do we actually expect just a different timeout error message? My gut tells me DFTC: avoid the timeout. Either by speeding up the operation or adding a progress bar.\r\n","author":"Maciej Kwidziński"},{"text":"How was this CLOSED as CANNOT REPRODUCE?! This is still VERY ACTIVE on 9.4.23!\r\n\r\n[~mkwidzinski] ?!","author":"Cedric Lavoie"},{"text":"Hello [~0a53cb671019],\r\nI am really sorry for the inconvenience, my team is trying to escalate the issue internally to clarify steps to reproduce. I have changed the status of the bug once again, and right now it is opened in proper state. When we finish the triage process, I will make an update once again.\r\n\r\nBest regards\r\nDaniel Dudziak\r\nJira DC Developer","author":"Stasiu"},{"text":"[~ddudziak] , thank you for the update.\r\n\r\nIt literally just happened to me again, 3 minutes ago:\r\n!image-2024-07-17-10-49-21-851.png|width=497,height=254!","author":"Cedric Lavoie"},{"text":"This is affecting my users as well. Please confirm the plan to fix this.","author":"John Roberts-Davies"},{"text":"The link provided in the Steps to Repro - [https://confluence.atlassian.com/jirakb/how-to-change-the-default-ajax-timeout-in-jira-server-824345485.html] for Ajax timeout does not work anymore and looks like dead. Can you please update?","author":"Aswin Pola"},{"text":"Any progress on that? It's not a minor issue","author":"Jordi Beltran"}]},{"summary":"Remaining Estimate not updated with Split issue feature","key":"JSWSERVER-16204","url":"https://jira.atlassian.com/browse/JSWSERVER-16204","type":"Bug","priority":"","description":"Summary\r\n\r\nWhen an issue is split, the remaining estimate of the issue is not adjusted to reflect the changes in the Original Estimate.\r\n\r\nSteps to reproduce:\r\n\r\n# Set a Scrum board to use Original Estimate with Remaining Estimate as Estimate option.\r\n# Access the backlog and set an estimate of an issue to 2weeks (example). Both Original & Remaining Estimates will be 2w.\r\n# Right-click on the issue and click Split.\r\n# Set the name of the split issue and adjust the estimate of the issue (1w + 1w as an example).\r\n# Click save and check issue detail view of both issues. The remaining estimate of the original issue will remain at 2w. \r\n\r\n \r\nh3. Environment\r\n\r\nJIRA 7.5 and above. \r\n\r\n\r\nh3. Expected Results\r\n\r\nThe Remaining Estimate is updated to reflect the changes with the Original Estimate\r\n\r\nPossible solutions:\r\n* Automatically adjust the remaining estimate\r\n* Let the user input the remaining estimate during the split action\r\n\r\n \r\nh3. Actual Results\r\n\r\nThe Remaining Estimate is not updated to reflect the changes with the Original Estimate\r\n \r\n\r\nh3.Workaround\r\n\r\nManually edit the Remaining Estimate","createDate":"2017-11-17T09:22:35.000+0000","comments":[{"text":"Hello All!\r\n\r\nAlthough this bug seems minor and not really important I would like to emphasize how much it affects our users. We're using Jira as our main ALM tool. About 400 users are planning their work quarterly. Each issue is estimated original to some amount of time. Then assigned to a sprint. If estimation is higher then sprint capacity it's splitted into smaller chunks and estimations are updated accordingly. Users find themselves browsing  and searching for the original issues and correcting the original estimation manually. This makes them feel annoyed and confused. Also, a lot of times, they just forget to update the estimation and this, of course, is shown later in the sprint report. \r\n\r\nPlease find a way to fix this bug, or find a better workaround for it (maybe using a script via script runner add on?..)\r\n\r\nThanks,\r\nTanya.","author":"Tanya Gordon"},{"text":"Split issue is very helpful for future workflow and break down of early estimates in the backlog.\r\n\r\nWithout the update to remaining estimate when splitting a task this feature has low value.","author":"JOCUO"}]},{"summary":"Sprint goal field does not support/handle multi-line texts","key":"JSWSERVER-16161","url":"https://jira.atlassian.com/browse/JSWSERVER-16161","type":"Bug","priority":"","description":"When inputting a multi-line text in the Sprint Goal field, it either does not show the entire text or overlaps with the top of the backlog (see screenshots attached).\r\n\r\nh3. Steps to reproduce.\r\nEnter a text that spans multiple lines in the Sprint Goal field in an Agile Board.\r\n\r\nh3. Expected results.\r\nThe field expands and the page adjusts to show the entire text without overlapping/covering other page elements.\r\n\r\nh3. Actual results.\r\nThe field either shows a single line that does not fit the entire text or expands down covering the top of the backlog.\r\n\r\nh3. Workarounds\r\nNone","createDate":"2017-10-20T20:42:55.000+0000","comments":[{"text":"Updates?","author":"Azfar Masut"},{"text":"I need this too.  I'm very surprised this was overlooked as part of the original implementation.","author":"Phillip Saindon"},{"text":"Do you have an ETA for the fix? Why offering this new UI if its not properly supported....","author":"olga rolf"},{"text":"any update on this one?","author":"Michal Dery"},{"text":":(","author":"Lars Rieger"},{"text":"any update on this please","author":"Tony Doan"},{"text":"Any updates for this?","author":"Kari Kauppi"},{"text":" *eagerly waiting!*\r\n ","author":"Mohsen Mehrafrouz"},{"text":"Are the screenshots from Jira data centre flavor? if yes, what version of Jira data centre are you guys running? We can only type in a single line? how did you get it to accept multi line input to expose this bug? We can't get this bug to surface in V 7.13.5 of Jira data centre.","author":"Omar Rashid"},{"text":"Please vote on https://jira.atlassian.com/browse/JSWSERVER-20433","author":"Omar Rashid"},{"text":"definitely find this limitation to be quite puzzling and unfortunate.","author":"Ilya Bass"},{"text":"I would like to see this feature added as well.  Seems like a simple fix, and we often have more than one goal per sprint.","author":"Patrick McCauley"},{"text":"I like the attitude of commenters above. Not knowing Atlassian takes about 14 years to actually implement customer requests. See you in 10 years. 😄","author":"Martin Dulák"},{"text":"우선 순위가 Row임에 따라 개선되지 않는 것 같습니다.\r\n\r\n다중 라인이 꼭 되길 희망합니다.\r\n\r\n ","author":"Kwon JinYoung"},{"text":"Seriously! This bug is opened for two years and no one wants to take up the monumental effort of converting a single line text box to a multi-line box? Is the impact on the customer so non-obvious that it takes two years of time to Gather impact?","author":"Shree Kumar"},{"text":"It's really frustrated when our team want to check the sprint goal with the current UI. We have couple goals to check, from UI they're messed up","author":"Long Tran"},{"text":"+1 \r\n\r\nwell, this issue has only 2 years, they really tend to implement this kind of request in sprints of 5 years =D\r\n\r\n ","author":"julio_freitas"},{"text":"Has anyone figured out what to do about this instead of waiting for Atlassian to fix this? I don't expect to be using Jira in 10 years time to see this being addressed. Obviously they have higher priorities with more value to address on their backlog!","author":"Anand Krishnaswamy"},{"text":"Not sure the priority mechanism, but priority \"low\" given so many people complaining about this issue?","author":"严兰涛"},{"text":"Any timeline for this one? ","author":"Paweł Gdula"},{"text":"How hard would it be to add the basic styling afforded descriptions and comments to Goals. I can see why this particular change is a low priority compared to other issues. But given the number of users following this and what would seem to me like a low level of effort it is surprising this is not just getting knocked out. Just add CK editor to the goal input and you are done.\r\n\r\n{color:#FF0000}*Very annoying!!*{color}\r\n\r\n ","author":"Joel Eiholzer"},{"text":"{color:#ff0000}*Very annoying!!*{color}","author":"严兰涛"},{"text":"Agree with \"Joel Eiholzer\", it is open for nearly 4 years? I wonder Jira team is working in misplaced priorities. \r\n\r\ncould you get this fixed ASAP.","author":"Kiran Vasu"},{"text":"Totally Agree. With the depreciation of the Sprint Boards on the Dashboard we now need to revert back to the Boards. Having squad goals in a better format would enrich this page.\r\n\r\nAnother option would be to add them to the insights feature which has just shown up","author":"Paul Garratt"},{"text":"I do agree with what was said, this seems like a pretty low key issue, but a nice addition for the teams working with those boards. #upvote","author":"Julian"},{"text":"*Workaround*: \r\n Add this to the announcement banner:\r\n{code:css}\r\n<style type=\"text/css\">\r\n[data-fieldname=\"sprintGoal\"] {\r\n    white-space: pre-line; \r\n}\r\n</style>\r\n{code}","author":"Kirill Kamenkov"},{"text":"Yes please.  Just enable the simple markup already available for issue descriptions.","author":"Richard Johnson"},{"text":"How can it be possible to still be opened ?\r\n\r\nIt's only 1 line of CSS to change to make it works.\r\n\r\nSprint of 2 weeks = several objectives (I mean, sure !), I can't list my objectives as a list, but I can have a stupid smiley in my comments.\r\n\r\nIt's crazy. (x)(off)(*g)(flag)(?)(n)(n)(n)(n)(n)(n)(n)(n) ( <= this I can do !)","author":"Vincent DECAUX"},{"text":"This is really annoying to see the goals in one line, it is very cheap to fix it!!","author":"Ekaterina Pantaz"},{"text":"Please fix asap ","author":"Julia Eden"},{"text":"Please fix! It's been 5 years...","author":"jcountryman"},{"text":"wow, that's agile as hell","author":"Julian"},{"text":"Any news? ","author":"ÉricH"},{"text":"Can it be fixed? It is not a big deal","author":"Grzegorz.Ryznar"},{"text":"Please fix as this is really annoying and causes consternation with the teams working on several features concurrently. ","author":"Paul Fraser"},{"text":"Hey team, is there any update? Could anybody please take care of this issue?","author":"이동훈"},{"text":"Is there a Cloud version for this bug? I'd like this functionality available there, which is what my company uses.","author":"Melanie C"},{"text":"Please fix this, during daily stand up when we walk the Jira board we should be referring to our sprint goal but we cant read it on screen. It should be the core focus of our meeting but it appears as one long line that is cut off and incomplete. ","author":"Mac McAvoy"},{"text":"Hi everyone, as you know, this is the issue ticket for the Server version. As Atlassian is transitioning to a Cloud model, and the server support will not be available starting 2024 (if I'm not wrong), I'm pretty sure there is no effort spent anymore on features or small improvements on the Server version. Aeven if they were fixing this, you still have your admin to upgrade your version installed on your server. \r\n\r\nIt's not fixed on the Cloud version, but a safe bet is to move to the cloud if you want to have this fixed.\r\n\r\n ","author":"ÉricH"},{"text":"We recently transitioned to Jira cloud, and this is an issue there as well. The Jira dev team should just move this to the Jira cloud focus backlog instead of creating a new one there and gathering dust (ahem, impact) again.","author":"Anand Krishnaswamy"},{"text":"I agree - any issues that are still existing on the cloud should be moved instead of being re-created and appearing to be new. This ticket was created 5 years ago so it should be prioritised.","author":"Lea Cairns"},{"text":"We have wanted this for years on the cloud version of Jira. \r\n\r\nPlease prioritize this :)","author":"Jens Christian Morten Laursen"},{"text":"[~37b6eef0b215], you are mistaken because you seem to have forgotten about Data Center. Atlassian is not solely transitioning to the cloud; they have instead consolidated two server versions into one.","author":"Kirill Kamenkov"},{"text":"Can we get a fix on this? It's been quite some years and this shouldn't be a big deal...","author":"Pedro Silva"},{"text":"+1 for implementation of this change. Also to allow formatting of the sprint goals field.","author":"Nicole Santamaria"}]},{"summary":"Sprint End date disregards date picker advanced setting when duration is not custom","key":"JSWSERVER-15811","url":"https://jira.atlassian.com/browse/JSWSERVER-15811","type":"Bug","priority":"","description":"h4. Summary\r\n\r\nSprint End date disregards date picker advanced setting when duration is not custom\r\nh4. Steps to reproduce the problem\r\n # Configure advanced configuration datepicker as follow:\r\n ** {{jira.date.time.picker.java.format : dd.MM.yyyy HH:mm}}\r\n ** {{jira.date.time.picker.javascript.format : %d.%m.%y %I:%M}}\r\n # Create a sprint > allocate issues\r\n # Start sprint > choose duration of 1 week (any option other than custom)\r\n\r\nh4. Expected Result\r\n\r\nDate picker will show the date following the advanced configuration\r\nh4. Actual Result\r\n\r\nDate picker does not follow the date picker format\r\n !notcustom.png|thumbnail!\r\n\r\nThis problem does not happen if user choose custom duration as default:\r\n !custom.png|thumbnail!\r\n\r\n(!) If the user chooses non-custom duration initially, and then switch back to custom, the end date will still show the wrong format of the year.\r\n\r\n \r\nh4. Workaround\r\n # Select \"Custom\" duration.\r\n # In some cases, user will have to remove the AM or PM in the Start/End date.","createDate":"2017-04-14T12:44:45.000+0000","comments":[{"text":"When I switch to custom, the year still doesn't change to 2017 (still 17). Even when using the datepicker, it returns 17.\r\n\r\n!image-2017-04-14-16-24-48-363.png!\r\n\r\nInterestingly, I cannot start the sprint, neither in custom nor in week duration setting.\r\n\r\n!image-2017-04-14-16-32-16-743.png!\r\n\r\nAs we were able to start sprints during some days, I suspect there is an issue with JIRA mixing up month and day. Having erroneous dates in the database (negative values) is a major issue as these need to be manually corrected (and we don't know how yet).\r\n\r\nPlease escalate, this renders the sprint functionality completely broken. Thank you!\r\n\r\n ","author":"FrankTrautwein"},{"text":"Workaround is to create the sprint using the custom option and set it for 11 days so the end date is on a Saturday and only uses 10 working days. \r\n\r\n ","author":"Richard Bone"}]},{"summary":"Configuring a board's Issue Details View to include custom fields with specific issue type contexts causes SafePluginPointAccess errors in the logs","key":"JSWSERVER-15307","url":"https://jira.atlassian.com/browse/JSWSERVER-15307","type":"Bug","priority":"","description":"h3. Summary\r\n\r\nIf you configured your custom field context to only certain specific issue type, and you configure the Agile Board's 'Issue Details View' to call this custom field, {{c.atlassian.ozymandias.SafePluginPointAccess}} will be throwing error\r\nh3. Steps to Reproduce\r\n # Configure a new JIRA KANBAN board. With the filter set to one particular project\r\n # Create a custom field called 'Test'\r\n # Set the context for the field for 'Bug' issue type only\r\n # Go to the Board's configuration > Issue Detail View and add this field\r\n # Create a new issue on the board, with Task issue type\r\n # On the board, click on the issue to trigger the right details issue view panel\r\n\r\nh3. Expected Results\r\n\r\nNo error is thrown in the logs\r\nh3. Actual Results\r\n\r\nBelow exception is thrown in the atlassian.log file:\r\n{noformat}\r\n/rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\ncom.atlassian.jira.util.dbc.Assertions$NullArgumentException: config should not be null!\r\n\tat com.atlassian.jira.util.dbc.Assertions.notNull(Assertions.java:25)\r\n\tat com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl$2.call(CustomFieldTypeModuleDescriptorImpl.java:175)\r\n\tat com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl$2.call(CustomFieldTypeModuleDescriptorImpl.java:172)\r\n\tat com.atlassian.ozymandias.SafePluginPointAccess.call(SafePluginPointAccess.java:187)\r\n\tat com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl.getSupplierValueOrHtmlErrorMessage(CustomFieldTypeModuleDescriptorImpl.java:372)\r\n\tat com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl.getEditHtml(CustomFieldTypeModuleDescriptorImpl.java:172)\r\n\tat com.atlassian.jira.issue.fields.ImmutableCustomField.getEditHtml(ImmutableCustomField.java:889)\r\n\tat com.atlassian.greenhopper.web.rapid.view.detailview.DetailViewInlineEditableFieldFactory.getFieldHtmlBean(DetailViewInlineEditableFieldFactory.java:263)\r\n\tat com.atlassian.greenhopper.web.rapid.view.detailview.DetailViewInlineEditableFieldFactory.lambda$getDetailViewEditableFields$54(DetailViewInlineEditableFieldFactory.java:162)\r\n\tat java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:193)\r\n{noformat}\r\nh3. Notes\r\n\r\nThis is not impacting any functionality. Just on logging\r\n\r\n \r\nh3. *Workaround*\r\n\r\nJira Administrators can hide logging on the package by increasing logging level to ERROR.\r\n\r\nYou can achieve this by adding these lines into *log4j.properties*:\r\n{code:java}\r\nlog4j.logger.com.atlassian.ozymandias  = ERROR, console, filelog\r\nlog4j.additivity.com.atlassian.ozymandias = false\r\n{code}\r\nFor changes to make an effect, Jira restart is required.\r\n\r\nThe file log4j.properties is located at JIRA_INSTALL_DIR/atlassian-jira/WEB-INF/classes (as of Jira 7.12.x)\r\n\r\n(on) Mind, this would make the log lines disappear, yet would not address the root cause.\r\n The actual case had to be addressed by the plug-in vendor.","createDate":"2016-12-08T08:19:04.000+0000","comments":[{"text":"Occurs in  7.3.0 as well","author":"Tom Moore"},{"text":"Occurs in 7.3.1 too.","author":"plonnroth"},{"text":"+1 JIRA 7.3.1","author":"AndreH"},{"text":"+1 JIRA 7.3.6","author":"Robb Breckenridge"},{"text":"+1 JIRA 7.3.4","author":"Suhas P"},{"text":"+ JIRA 7.3.6","author":"Yevgen Lasman"},{"text":"+7.3.3","author":"Stefan Bittner"},{"text":"+7.4.1","author":"John Rebelos"},{"text":"+7.3.7","author":"Christian Pascher"},{"text":"+7.4.2 (lots of logging) may wish to hide it using log4j.properties file modification...","author":"Craig Solinski"},{"text":"+7.5.0 is also affected. Can this warning be hidden somehow?","author":"Anna Henke"},{"text":"Affects 7.5.0 for us as well. This is making logs very busy... ","author":"Jonathan Chatwin"},{"text":"We have a 500 users installation, all users use boards all the time. Logs are full of these warnings that bring no added value.\r\n\r\nThis issue is open for more than a year now ??? At least Atlassian should provide a work around to hide these messages ?","author":"Marc Minten (EVS)"},{"text":"Affects 7.6.2 as well.","author":"Alexis Pruitt"},{"text":"Affects 7.6.3 as well.","author":"Tarun Sapra"},{"text":"+7.4.4","author":"Kevin"},{"text":"Affects 7.8.0 as well.","author":"Christoph Schötz"},{"text":"As well as 7.8.1","author":"Yossi Zinger"},{"text":"+ 7.6.4 confirmed too.","author":"Tomas Karas"},{"text":"7.8.2 confirmed.\r\n\r\n \r\n\r\n2018-04-05 21:36:30,637 http-nio-127.0.0.1-8081-exec-25 WARN someuser 1296x7987x1 12605pv 10.111.11.218,127.0.0.1 /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\n\r\n2018-04-05 21:36:30,638 http-nio-127.0.0.1-8081-exec-25 WARN someuser 1296x7987x1 12605pv 10.111.11.218,127.0.0.1 /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\n\r\n2018-04-05 21:36:30,641 http-nio-127.0.0.1-8081-exec-25 WARN someuser 1296x7987x1 12605pv 10.111.11.218,127.0.0.1 /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\n\r\n2018-04-05 21:36:30,641 http-nio-127.0.0.1-8081-exec-25 WARN someuser 1296x7987x1 12605pv 10.111.11.218,127.0.0.1 /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.","author":"Deon Rodden"},{"text":"Yeah, really annoying... :(","author":"Matthias Schwellenberg"},{"text":"Confirmed on 7.8.2 -> /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'. ","author":"mendurim"},{"text":"Confirmed 7.10.1\r\n\r\nSure wish I knew how to block this message that causing stacktraces and filling up log rapidly...","author":"Craig Solinski"},{"text":"spotted in 7.11.2 as well.","author":"GI"},{"text":"Spotted on 7.10.2 too.","author":"Fanny Mendez"},{"text":"As seen and flooding my logs on 7.10.2 also.","author":"Steve Rhodes"},{"text":"Spotted on 7.12.1","author":"Kai Ehlig"},{"text":"Spotted on 7.7.2","author":"Mohammad Fakih"},{"text":"+1 version 7.12.1","author":"Ricardo da Silva"},{"text":"Observed in 7.11.1 as well.","author":"Sateesh Chandra"},{"text":"Seen in 7.6.6 as well. ","author":"Mike Wise"},{"text":"+1 v7.7.1#77002-sha1:e75ca93","author":"Pranjal Shukla"},{"text":"+7.12.3","author":"Pavels Avens"},{"text":"Observed in Jira Software 7.5.1 as well. ","author":"Christoffer Karlsson"},{"text":"+7.12.1","author":"Fredrik Ivansson Flinta"},{"text":"+7.10.1","author":"Jonathan Chatwin"},{"text":"Guys, it's obvious that the bug won't fix itself. Stop adding comments with affected versions - just vote for the issue and put pressure on Atlassian Support about it.","author":"Pavel Boev"},{"text":"Seen on 7.6.12 ","author":"Gonchik Tsymzhitov"},{"text":"Seen on 7.13.9","author":"korney"},{"text":"Seen on 8.5.3","author":"Tomas"},{"text":"Seen on 8.5.4","author":"Gunnar Kalb"},{"text":"Error in Servicedesk 4.19/Jira 8.19.\r\n\r\n2021-09-16 13:08:03,161+0200 http-nio-8080-exec-14 WARN h.rojahn 788x27964x1 njwtk0 172.23.0.124,172.29.96.20 /rest/servicedesk/automation/servicedeskmodules/1/then/edit-issue/27800/field [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\n\r\n \r\n\r\nAny Suggestions ?\r\n\r\n!image-2021-09-16-13-07-47-497.png!","author":"Holger Rojahn"},{"text":"Seen in 8.20.11:\r\n\r\n2022-10-19 07:44:18,520+0200 http-nio-8080-exec-147 WARN .... /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.","author":"Karsten Hain"},{"text":"seeing it on 9.6 \r\n\r\n2023-03-09 14:09:29,967+0000 http-nio-8080-exec-1436 WARN diln_epires 849x2295226x1 u4lqib 87.103.114.15,192.168.66.166 /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\n2023-03-09 14:09:29,967+0000 http-nio-8080-exec-1436 DEBUG diln_epires 849x2295226x1 u4lqib 87.103.114.15,192.168.66.166 /rest/greenhopper/1.0/xboard/issue/details.json [c.atlassian.ozymandias.SafePluginPointAccess] Unable to run plugin code because of 'com.atlassian.jira.util.dbc.Assertions$NullArgumentException - config should not be null!'.\r\ncom.atlassian.jira.util.dbc.Assertions$NullArgumentException: config should not be null!\r\n        at com.atlassian.jira.util.dbc.Assertions.notNull(Assertions.java:25)\r\n        at com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl$2.call(CustomFieldTypeModuleDescriptorImpl.java:175)\r\n        at com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl$2.call(CustomFieldTypeModuleDescriptorImpl.java:172)\r\n        at com.atlassian.ozymandias.SafePluginPointAccess.call(SafePluginPointAccess.java:390)\r\n        at com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl.getSupplierValueOrHtmlErrorMessage(CustomFieldTypeModuleDescriptorImpl.java:372)\r\n        at com.atlassian.jira.plugin.customfield.CustomFieldTypeModuleDescriptorImpl.getEditHtml(CustomFieldTypeModuleDescriptorImpl.java:172)\r\n        at com.atlassian.jira.issue.fields.ImmutableCustomField.getEditHtml(ImmutableCustomField.java:871)\r\n        at com.atlassian.greenhopper.web.rapid.view.detailview.DetailViewInlineEditableFieldFactory.getFieldHtmlBean(DetailViewInlineEditableFieldFactory.java:239)\r\n        at com.atlassian.greenhopper.web.rapid.view.detailview.DetailViewInlineEditableFieldFactory.lambda$getDetailViewEditableFields$2(DetailViewInlineEditableFieldFactory.java:157)","author":"Prometheus"},{"text":"{panel:title=Atlassian Update – 25 April 2023|borderStyle=solid|borderColor=#deebff | titleBGColor=#deebff | bgColor=#deebff}\r\n\r\nDear Customers,\r\n\r\nThank you for taking the time to file and comment on this issue. Feedback like yours helps us release valuable Jira features that solve problems for a greater customer base. To that end, we aim to keep our issues up-to-date so they accurately reflect current customer needs. Based on the impact, we’ve decided to move this issue to our short-term backlog. \r\n\r\nThe workaround for this bug is in the issue description.\r\n\r\nPlease continue watching this ticket for future updates and changes in the timeline that impacts your work.\r\n\r\nBest regards\r\n\r\nDaniel Dudziak\r\nSenior Software Engineer\r\n\r\n{panel}","author":"Stasiu"},{"text":"{panel:title=Atlassian Update – 11 September 2023|borderStyle=solid|borderColor=#deebff | titleBGColor=#deebff | bgColor=#deebff}\r\nDear Customers,\r\n\r\nWe appreciate your input which helps us to continuously improve Jira. Regarding the bug you've reported, it remains in our short-term backlog due to unforeseen delays. We apologize for any inconvenience.\r\n\r\nThe workaround for this bug is still applicable and can be found in the issue description.\r\n\r\nPlease continue watching this ticket for updates and changes that may impact your work.\r\n\r\nBest regards\r\n\r\nSławomir Zaraziński\r\nSoftware Engineer, Jira DC\r\n{panel}","author":"Sławomir Zaraziński"},{"text":"9.12 affected","author":"Arkadiusz Baka"}]},{"summary":"Searching for Sprint names with numbers through JQL returns other issues that start with the same number","key":"JSWSERVER-14856","url":"https://jira.atlassian.com/browse/JSWSERVER-14856","type":"Bug","priority":"","description":"h3. Summary\r\n\r\nWhen searching for the issues in a particular Sprint (eg Sprint 1) using the Sprint name in the JQL (eg Sprint = \"Sprint 1\"), it will display other issues in other sprints that start with 1 (Sprint 10, Sprint 11, Sprint 12 etc)\r\n\r\nh3. Steps to Reproduce\r\n# Create a few Sprints up to 10 or more, so that the Sprint name will be 10 or more.\r\n# Go to the Issue Navigator.\r\n# Search using the JQL (replace project name and sprint name accordingly with your own.) {code}project = \"project name\" AND Sprint = \"sprint name 1\"{code}\r\n\r\nh3. Expected Results\r\nThe Issue navigator will ONLY return issues that are in \"sprint name 1\".\r\n\r\nh3. Actual Results\r\nThe Issue navigator will also return issues that are in \"sprint name 10\", \"sprint name 11\", \"sprint name 12\" and so on.\r\n\r\nh3.Workaround\r\nSearch for the issues using the Sprint ID instead of the Sprint Name for more accurate results. \r\n\r\nYou can refer to [JIRA Software: How to search for a Sprint using JQL|https://confluence.atlassian.com/display/JIRAKB/JIRA+Software%3A+How+to+search+for+a+Sprint+using+JQL] on how to retrieve the Sprint ID.","createDate":"2016-09-13T08:23:08.000+0000","comments":[{"text":"- Affects 7.2.1 Server as well","author":"Chander Inguva"},{"text":"7.13.1 also affected","author":"Daniel Zauner"},{"text":"8.13.8 also affected. \r\n\r\n ","author":"Cloud Services"},{"text":"h3. Jira v8.20.13 also affected","author":"Stefan Matzdorf"}]},{"summary":"Changing calendar settings doesn't affect calendars within JIRA Agile","key":"JSWSERVER-12331","url":"https://jira.atlassian.com/browse/JSWSERVER-12331","type":"Bug","priority":"","description":"h3. Summary\r\nWhen changing configuration related to the calendars at *JIRA Administration > System*, some changes doesn't take place within JIRA Agile. \r\n\r\nh3. Environment\r\nJIRA Cloud\r\n\r\nh3. Steps to Reproduce\r\nChange calendar configuration format as per [Customizing the Look and Feel|https://confluence.atlassian.com/display/JIRA/Customizing+the+Look+and+Feel], in the section Date/Time format:\r\n# Go to *JIRA Administration > System > Look and Feel*\r\n# Set Date/Time format to 24 hours yyyy-MM-dd HH:mm  \r\n# Check the box at the bottom to make Monday first day of the week, as per [How to set Monday as First Day of Week|https://confluence.atlassian.com/display/JIRA063/How+to+Set+Monday+as+First+Day+of+Week+in+Date+Picker+Calendar]\r\n# Go to *JIRA Administration > System > General Configuration > Advanced Settings* and enter the format (_sysadmin_ only):\r\n- jira.date.time.picker.java.format: yyyy-MM-dd HH:mm\r\n- jira.date.time.picker.javascript.format: %Y-%m-%d %H:%M\r\n\r\nh3. Expected Results\r\nCalendars will be showing Monday as first day of the week, and time will be displayed in 24 hours format\r\n\r\nh3. Actual Results\r\nCalendars within JIRA Agile are still showing Sunday as first day of the week and am/pm format (see screenshots). The way date is displayed will change, but time seems to have no effect. In JIRA all changes have taken place correctly.\r\n\r\nh3.Workaround\r\nThere's no workaround at the moment.","createDate":"2015-07-28T10:44:24.000+0000","comments":[{"text":"*Please implement this soon*. It is very annoying for environments using ISO 8601, especially because for us 2015 has 53 weeks while the Agile (Gregorian) calendar does not allow that. This takes us to different week numbers for 2016 depending which Calendar we are checking (JIRA or Agile). For example, today should be wk. 1 but in Agile it appears to be wk. 2.","author":"Alexandra Sesovici"},{"text":"+1","author":"Kostantin Stambolov"},{"text":"Many thanks for raising this bug. Since there has not been any customer activity on this issue in over a year, we’re closing it as Timed out.\r\nIf you feel that the bug is still relevant to your needs, please leave a comment and we'll reassess it.\r\n\r\nKind regards,\r\nDong Hoang\r\nJIRA Software","author":"Hoang Dong"},{"text":"Hi @Dong Hoang,\r\nWhat do you mean by \"there has not been any customer activity on this issue in over a year\"? I am a customer and I just voted and commented on it less than 8 months ago....And yes, I am a customer.....\r\nI would very much appreciate if this is issue is reopened *and* solved.\r\nThank you.","author":"Alexandra Sesovici"},{"text":"Hi Alex,\r\n\r\nThank you very much for your correction. You are right. \r\nThis was closed by mistake and I reopened it. We will reassess it soon.\r\n\r\nRegards,\r\nDong Hoang","author":"Hoang Dong"},{"text":"To whomever it might concern:\r\n\r\nAre you really gathering impact for almost 5 years? Instead of fixing it?\r\nThere might be no \"customer activity\" here in Jira but it is discussed in forums etc on the internet. At least here in Europe we are using Monday as the beginning of the week, you know, the way it was intended.. since Sa and Su are a weekEND.\r\n\r\nSo what is the situation here, please?","author":"Tomáš Vojvoda"},{"text":"me too - this is a pain in the **** not having standard 24hour datepicker","author":"Mike Catmur"}]},{"summary":"Issues closed in future sprints do not show up in the Backlog until the Sprint is started","key":"JSWSERVER-11877","url":"https://jira.atlassian.com/browse/JSWSERVER-11877","type":"Bug","priority":"","description":"{panel:bgColor=#e7f4fa}\n  *NOTE:* This bug report is for *JIRA Software Server*. Using *JIRA Software Cloud*? [See the corresponding bug report|http://jira.atlassian.com/browse/JSWCLOUD-11877].\n  {panel}\n\nSteps to reproduce :\r\n\r\n# Create an issue and add it to a future Sprint.\r\n# Notice that it shows up on the backlog view of the Rapid board\r\n# Now close that issue\r\n# Notice that it disappears from the backlog view\r\n# Now start the Sprint\r\n# Notice that the issue suddenly appears in the Sprint as a closed issue\r\n\r\n\r\nThis is confusing for the users.\r\n\r\n","createDate":"2015-03-19T12:27:43.000+0000","comments":[{"text":"This is not only confusing, it will wrongly report a higher commitment of story points in the velocity report.","author":"Nabil Sayegh"},{"text":"The expected behaviour should be as follows:\r\n\r\nIf an issue is closed and is not in an active sprint, it will not be shown in the Backlog (plan mode).\r\nIf an issue is in a future sprint and is closed, it will be removed from the Backlog and will not be present if/when that sprint is started.\r\nIf is it required that an issue is to be closed in a future sprint then that sprint must be started with the issue included (prior to the issue being closed).\r\n\r\nKind regards,\r\nMartin\r\nJIRA Agile","author":"Martin"},{"text":"Many thanks for raising this bug. Since there has not been any customer activity on this issue in over a year, we’re closing it as Timed out.\r\nIf you feel that the bug is still relevant to your needs, please leave a comment and we'll reassess it.\r\n\r\nKind regards,\r\nDong Hoang\r\nJIRA Software","author":"Hoang Dong"},{"text":"Still relevant for me. \r\n\r\nBest Regards\r\nDaniela","author":"Daniela Neske"},{"text":"This bug still affects us, and has for a long time. We're accustomed to working around the issue by asking our teams to clear the sprint field if they need to close a ticket before a sprint starts. But, it'd be far better if the bug was fixed. Please reconsider fixing this issue. ","author":"Jonathan Layes"},{"text":"I'm reopening this issue because a customer has experienced this recently.\r\n\r\nWhen starting a sprint, the user should be aware of all the issues that will be in the sprint.","author":"Nara So"},{"text":"This is also relevant for us, we are experiencing the same problem. ","author":"Gerben Bosch"},{"text":"This is an issue in my organisation too. JIRA Server, v7.1.10","author":"Ersan Hakki"},{"text":"This has happened in our organisation also - JIRA cloud","author":"Gerben Bosch"},{"text":"Same problem here. JIRA Server 7.2.2","author":"CGM"},{"text":"We're experiencing the same issue in JIRA 7.2.8","author":"Shafinaz Elahi"},{"text":"We're experiencing the same issue in JIRA 7.2.8","author":"Shafinaz Elahi"},{"text":"We're experiencing the same issue in JIRA 7.3.1","author":"Keimpe de Jong"},{"text":"I am experiencing this as well, although closed issues will sometimes not appear on the Backlog view and other times they appear.","author":"Kristin Lyons"},{"text":"Same happens to me. \r\n\r\nSurprinsing that this bug was reported 4 years ago and remains unsolved....","author":"Deleted Account"},{"text":"We're experiencing the same issue.","author":"Mergen Yazılım A.S."},{"text":"8.17.1 - still impacting\r\nThis bug is really annoying - confuses our users and even our internal support team like crazy, as we thought its an indexing problem at first. Alot of wasted resource to troubleshoot it.\r\n\r\nPlease get it fix!","author":"Azfar Masut"},{"text":"For us goes the same, still impacting. Please fix!","author":"Gerben Bosch"},{"text":"If default behavior can't be changed, would be good to make it configurable. ","author":"Maryia Smouzh"},{"text":"This is still an issue. We can work around it if team member clears the sprint field when they close a ticket before a sprint starts. Not everyone remembers to do that every time.","author":"Danielle Zhu"},{"text":"same issue – please help!","author":"Nikhil Laddha"},{"text":"Still an issue 2023.  Our team is experiencing this.  Jira, can you BUMP this on YOUR backlog?  The users have spoken.  Where's your product owner?\r\n\r\nJeez, looks like this issue was discovered in 2015.  SMH\r\n\r\n ","author":"Gregory Teng"},{"text":"+1 bump, this has just happened to me. Started a sprint with with about 12 issues and about 15 \"done\" issues from previous sprints suddenly appeared. All the sprint stats are now shot. Very, very disappointing and frustrating.","author":"Paul Wilson"},{"text":"This is causing reporting issues as well.  Please move this up on the list to be fixed. ","author":"jodi.klein"}]},{"summary":"Agile Board Column Configuration Missing Statuses","key":"JSWSERVER-11623","url":"https://jira.atlassian.com/browse/JSWSERVER-11623","type":"Bug","priority":"","description":"*Summary:*\r\n The JIRA Agile column configuration screen does not properly identify the statuses which belong to the board when the conditions below are met:\r\n # There is an issue type using a custom workflow, with different statuses, AND\r\n # The JQL filter used by the Board references the issue type above, OR\r\n ** e.g. Using the filter {{project = P AND issuetype = custom_type OR project = P}} will cause this problem, even though it should return the same results as the filter '_project = P_'.\r\n # The JQL filter used by the board reference to text\r\n ** e.g Using the filter {{project = P AND text ~ \"testtext\"}}\r\n\r\nThe problem happens when the project/board is configured in such a way that it has multiple workflows (for different issue types). The board seems to only consider the statuses from the first workflow listed under its workflow scheme. The other statuses from the rest of workflow in the same workflow scheme will have a warning triangle indicating that the board doesn't recognize them.\r\n\r\nMoving any of the status with the warning triangle to the 'Unmapped statuses' column will make them disappear from the column configuration screen.\r\n\r\n*Steps to Reproduce:*\r\n # Restore the attached XML backup ([^column_issue.zip]).\r\n # Navigate to Agile > Sample Scrum Project A.\r\n # Go to Board > Configure.\r\n # Go to Columns - All statuses are displayed and properly mapped to columns.\r\n # Go to General and change the 'Working Filter SSPA' to the 'Broken Filter SSPA'.\r\n # Refresh the Board configuration page for the new filter to be applied.\r\n # Click on Columns again - The status which do not belong to the workflow used by the issue type \"Test Issue Type\" will have a warning triangle with the message below:\r\n \"This status is not available in any of the workflows used by this board. To remove, drag it to unmapped statuses where it will no longer be available.\"\r\n # Dragging any of those statuses to the *Unmapped Statuses* column will make the status disappear from the column configuration screen.\r\n\r\n*Workaround*\r\n Using the sample filter above\r\n * {{project = P AND issuetype = custom_type OR project = P}} and changing it to {{project = P AND issuetype = custom_type OR project = P and issuetype in (standardIssueTypes(),subTaskIssueTypes())}}, which yields the same results seems to resolve the problem.\r\n * {{project = P AND text ~ \"testtext\"}} is to be changed to {{project = P AND text ~ \"testtext\" AND issuetype in (standardIssueTypes(),subTaskIssueTypes())}}","createDate":"2014-12-26T17:32:15.000+0000","comments":[{"text":"Could the filter be changed to just 'project = P'? This should resolve the problem as well.","author":"David Tang"},{"text":"We experience a similar issue.\r\n\r\nWhen we added the following to our Scrum Board filter:\r\nOR issuetype in (Enhancement, Defect, \"Related Defect\") \r\n\r\nall statuses not pertaining pertaining to Enhancement, Defect or \"Related Defect\" issue types were not available for mapping to board columns. Note that it was an \"OR\"  condition, and other issue types were returned from the filter. In our case, we had a \"Task\" issue type with a status of \"In Progress\" that was not available for mapping once we put in that clause. \r\n\r\nTo work around this, we temporarily removed that clause from the filter, mapped the \"In Progress\" status into a Scrum board column, and then added the clause back in. The Scrum configuration is giving us a warning that the \"In Progress\" status is not used by any workflow (even though it also notes there are 12 issues in that status), but the status mapping is persisting and working. ","author":"Robert Ramirez"},{"text":"We're seeing exactly what Robert R. is seeing. The workaround he describes in the last paragraph worked for us and we see the same warning (even though it shows there are x amount of issues in that status).","author":"Shaunt Kojabashian"},{"text":"I raised the same issue GHS-23202 and we found a work around using the sub filter.","author":"Jamie Cole"},{"text":"Good point Jamie - to be clear this was on a scrum board for us (so no sub-filter).","author":"Brian Keefe"},{"text":"This is happening to us as well. We use a custom field to define different scrum teams that work within the same Jira project. So our filter is \"project = P and 'team name'= XYZ OR project = P and issuetype = Epic\". Since multiple teams can work on one Epic, we don't want to restrict Epics to one team, and Epics have a simpler workflow than the stories, so the available mapped statuses only showed the Epic statuses\r\nIt seems that the board is filtering the statuses to the least common denominator of specified issue types (even in an OR statement)\r\nThe workaround did work for a temporary fix, but I do think that this should be higher than minor","author":"Courtney Wilson"},{"text":"-","author":"Courtney Wilson"},{"text":"We face the same problem. Our filter had the format 'project = \"PROJECT\" or id in (ID1, ID2)'. Removing the \"OR\" and the second term solved the problem for us.","author":"Julia Lahn"},{"text":"We see this on JIRA 6.4.12 with JIRA Agile 6.7.12 as well.","author":"David Marshall"},{"text":"We are seeing the same issue. Our queries referenced the project. In our case, we have a project with issue types that are tied to one of four workflows. Two workflows have custom statuses. Those statues do not show up as unmapped statuses. Therefore, the issues in those statuses do not show up on the Plan or Work board. The Sprint Report recognizes the issues but shows them as Issues Removed From Sprint. \r\n\r\nBased on the comments above, I edited the queries to specify each issue type in the project. The custom statuses now appear as unmapped statuses and can be associated with columns on the board. The issues now appear in all three modes.\r\n\r\nWe are on JIRA 6.2.5 and JIRA Agile 6.6.51","author":"Colleen Adams"},{"text":"+1 Colleen, thanks, that workaround got me out of the ditch !","author":"Kelly Arrey"},{"text":"+1 Colleen, thanks.\r\n\r\nThis bug is still present on JIRA Software 7.2.2.","author":"Luís GÓIS"},{"text":"We still see this bug as well. We found that even a simple query like {{project = MYPROJ ORDER BY Rank ASC}} was failing to pull in five different statuses. Instead, using a query like {{project = MYPROJ AND type in (standardIssueTypes(), subTaskIssueTypes()) ORDER BY Rank ASC}} works just fine and will not require maintenance in the future. \r\nI believe this is due to the complex nature of the project, with 10+ issue types and 5 workflows.","author":"Steven Behnke"},{"text":"@Steven we also had the problem before modifying the query as you did, v7.2.2 on a standard agile project here (story, bug, epic and task), one single workflow (simplified, 3 statuses).","author":"Luís GÓIS"},{"text":"Still seeing this issue on 7.3.0","author":"Jonathan Krengel"},{"text":"I'm still having this problem as well, and it's frustrating.","author":"Marta Dawes"},{"text":"Considering the issue has been around for two years, I would like to see it prioritized higher – I'm tired of see this problem in my board configurations!\r\n\r\n ","author":"Chris Mitchell"},{"text":"The same problem occurred recently in one project that had only two workflows (one of them was the {color:#205081}_The default JIRA workflow_{color} which is read-only). An issue was set to status {{Reopened}} from {{Closed}} but did not appear in the Agile board of the project. The JQL of the filter was \r\n {{project = <projectkey> ORDER BY Rank ASC}}\r\n\r\nIn the respective board configuration one could not see the status Reopened to be chosen for any column. The solution was - as mentioned above - to add the issue types.\r\n\r\nIs this a caching issue? I do not think that this an issue on behalf of the index because re-indexing did not help as well.\r\n\r\n+BTW:+ JIRA (server) version ist 7.3.6 (build number 73017) with JIRA agile 7.3.0 (build number f1feac4e04079fdc)","author":"Adi Wehrli"},{"text":"Dear Atlassian,\r\n\r\nI don't know if I have the same problem.\r\n\r\nThe project using custom and standard issue types, custom workflow and custom statuses.\r\n\r\nThe JQL is the following: \r\n{code:java}\r\nProject in (\"P\") AND labels in (L) AND status not in (Closed, Resolved) OR key in (P-6577, P-6593) ORDER BY Rank ASC\r\n{code}\r\nFor this, I got 13 JQL, some of are in the status: _Tested_. This status not appearing at the Kanban column mapping page.\r\n\r\nJust to review the issue, I create the same JQL (saved to another name), with a different kanban board and the _possible mapping statuses are different_ - but there is no _Tested_ again. \r\n\r\nReindex, restart, did not help.\r\n\r\nShould I create a support ticket for you to investigate this, or it may be the same issue?\r\n\r\nBest: Peter\r\n\r\n \r\n\r\n*Update*: we found that other technical issue was involved. Please delete this comment. :)\r\nBest: Peter","author":"Peter Cselotei - Lupus Consulting Zrt."},{"text":"I don't see this issue having to do with filters. For me it seems to be workflow scheme related.\r\n\r\nIn some cases, it seems that when you have a workflow scheme with a workflow assigned to one issue type and one to \"all unassigned\", the default workflow is not being picked up by the agile boards. The workaround is to go to the workflow scheme and instead of using \"all unassigned\", specifically assign all other issue types to that worfklow. Actually assigning even one issue type will cause the workflow to be picked up.\r\n\r\nI'm not entirely sure why this happens as it doesn't seem to happen every time but it's definitely the boards not picking up the workflow for \"all unassigned issue types\".","author":"Evangelos Vrocharis"},{"text":"We have noted this in JIRA Software 7.1.6. We're very interested to know the root cause as we have yet to identify it.","author":"Graham Horsman"},{"text":"My team has experienced this same issue in JIRA Server v7.5.2.\r\n\r\nIs there any timeline on when this issue will be addressed?","author":"Raj Vora"},{"text":"Issue seems to occur in Jira Server 8.0.2 as well","author":"Maciej Tkaczyk"},{"text":"I think I ran into this failure mode as well.\r\n* I had a project without a workflow scheme, which seems to map all issue-type names to the default\r\n* I created a workflow scheme and mapped a single issue-type name to a custom workflow\r\n\r\nThen the board refused to acknowledge the existence of the new status in the custom workflow\r\n* the new status does not show up as unmapped on the board=>columns settings\r\n* if I transition an issue to the new status, it simply disappears from the board (because it is not mapped, and apparently not mappable)\r\n\r\nI tried modifying the board filter to include another project, which then enabled the capture of some new status, but only from the new project.\r\nI deleted the project I care about, saved; then added back, saved.  Still no cigar\r\nNext will attempt some of the suggestions from earlier commentators' (modifying the filter to explicitly capture status details)\r\n\r\n...\r\nh3. Solved\r\nI managed to solve this by a seemingly trivial modification of the filter.\r\n* was: this AND that OR other AND another\r\n* changed to explicitly group: (this AND that) OR (other AND another) \r\n\r\nThat did the trick - picked up all the previously-unmapped status in every workflow, and I was able to map the new one that I cared about using.  Also note: jira still sees these explicit groupings as redundant, and ultimately deletes the parentheses in the saved filter query.  i.e., there is no actual evidence remaining after you save the new and explicitly-grouped filter query.  Next time you view it, the explicit grouping is omitted.  But the act of having done it seems to tickle the failure-mechanism in a way that provides for an effective work-around.  It hints that the underlying root-cause is a bug with the JQL parser.","author":"Mark Caruso"},{"text":"I found that if there are issues with 2 different workflows involved but they share a common status, that the board will \"decide\" which issue workflow to map the status to and only allow to drag/drop transition an that issue and not others. \r\n\r\nFor example: my filter finds Stories and Sub-Tasks. The workflow is different for the 2 issue types, but both have a status of \"In Progress\". I found that \"In Progress\" works for Sub-Tasks and I can drag them from 'New' to 'In Progress'. But I can't drag the Story from 'Backlog' to 'In Progress' - I have to edit the story and transition it and then it shows up on the board 'In Progress'\r\n\r\n ","author":"Keith Lanier"},{"text":"Solution by Mark - changed to explicitly group: (this AND that) OR (other AND another) solved the problem for us. But the user had 80 filters in 80 boards and he has to change all of them.\r\n\r\nWhen will the fix be out? Its still there in Jira 8.5.","author":"Divya TV"},{"text":"Your suggested work around did not work, but making my query super simple, saving it, and then editing again to re-complexify it worked like a charm.","author":"Tomi Bates"},{"text":"I also ran into this issue. At least I think I did. My project contains the issuetypes Improvement, Task and Sub-Task. The kanban board filter query used to be project = p ORDER by rank which resulted in no status being shown in the board configuration at all. Chaging it to project = p AND issuetypes in (standardIssueTypes(), subTaskIssueTypes()) worked. \r\n\r\nI find this really annoying as the filter returns the same issues and actually it makes no sense to me at all. Took me half a day of work. \r\n\r\nI'm running Jira 8.5.3.","author":"Manuel Bähnisch"},{"text":"I ran into this issue as well, my project contained the issueType Epic for a secondary part of the filter (an OR condition) as well as the ORDER by Rank ASC. Changing it to Project = p AND issueTypes in (standardIssueTypes(), subTaskIssueTypes()) worked for me too...didn't change anything else in my filter. \r\n\r\nI had to then \"fix\" all of the reported issues that were resolved prior to Completing the Sprint that should have stayed done with that sprint, but instead moved to the next sprint incorrectly.  Took quite a bit of work and time to get this resolved because of this.  ","author":"Jenn Rakestraw"},{"text":"Bug found in 8.13.10 as well.","author":"prusty"},{"text":"Still happening in 8.15.1.\r\nSolved by adding \r\nAND type in (standardIssueTypes(), subTaskIssueTypes()) \r\nafter the projects were declared in the JQL","author":"Jennifer D. Smith"},{"text":"Ran into this issue with Jira Data Center 8.20.2 using the following board query:\r\n \r\nproject = MyProject AND (Team = 44 OR issuetype = Epic) ORDER BY Rank ASC\r\n \r\nChanging it to this fixed the issue:\r\n \r\nproject = MyProject AND issuetype in (standardIssueTypes(),subTaskIssueTypes()) AND (Team = 44 OR issuetype = Epic) ORDER BY Rank ASC\r\n \r\n ","author":"Chris Steenwyk"},{"text":"Currently affected by this in 8.18.2","author":"Zachary Beach"},{"text":"+1","author":"Nutanix_Jira-admin"},{"text":"This is affecting Jira 8.13.4 too.","author":"Eshwar Palem"},{"text":"This is affecting Jira 8.20.2 also","author":"Muhammed Hisham Pulukkool"},{"text":"We recently updated and simplified some board *filters* and ran into the same problem. Before changing the filter we checked if the new filter was showing the same list with issues. which it did. Now we have to add additional information to the filter again to make the board work again.\r\n\r\nVery strange. It should be fixed. Affects version 8.20.8\r\nIf a filter shows the correct list of issues, it simply also must work on the Agile board. ","author":"Marcel Plomp"},{"text":"Just switched from Kanban to Scrum Board. Took the same basic filter for the Scrum Board which is already in use by the Kanban Board. Jira tells me that some statuses I want to map (which can be mapped w/o problems on the Kanban Board) aren't available for the issue types in the Filter results and therefore not available to be mapped to columns. This is nonsense since running the query manually I get issues with the missing statuses.\r\n\r\nThe query is nested.\r\n\r\n \r\n{code:java}\r\nproject = VP AND (Epos-Verknüpfung in (VP-3328, VP-4988, VP-5085) OR issue in issuessubtasks(\"Epos-Verknüpfung in ('VP-3328', 'VP-4988', 'VP-4992', 'VP-5085')\")) ORDER BY Rang {code}","author":"Danny Who"},{"text":"Doesnt seem to be seeing fix anytime soon.","author":"Vickey Palzor Lepcha"},{"text":"Having this issue still as well. The workaround posted worked for me (including the following in query).\r\n{code:java}\r\nand issuetype in (standardIssueTypes(),subTaskIssueTypes()){code}\r\nSeems it's the statuses that are unique to my sub-tasks are not appearing","author":"Jamie"},{"text":"Our users are experiencing this problem in Jira 8.20.12","author":"Emma"},{"text":"Is there any plan to fix this issue? ","author":"Danielle McGrath"},{"text":"Not sure if it is the same bug. But I have a board that includes two projects. The board column configuration page missed all status from one particular workflow of one of the projects. After identifying and removing the part of the query that caused the problem, all status appeared. I moved that part of the filter query to a subfilter and everything works as intended.\r\n\r\nOriginal query:\r\n{code:java}\r\nproject = \"Project A\" AND issuetype in standardIssueTypes() AND Sprint in openSprints() AND Sprint not in futureSprints()) OR (project = \"Project B\" AND (status not in (StatusA, StatusB) OR status in (StatusA, StatusB) AND updated > -1d)) ORDER BY Rank ASC{code}\r\nProblematic part that I moved to a subfilter\r\n{code:java}\r\nstatus not in (StatusA, StatusB) OR status in (StatusA, StatusB) AND updated > -1d{code}\r\n ","author":"Frank Scheffler"},{"text":"Hi,\r\n\r\nIssue encountered in 8.13.2.\r\n\r\nSolved with\r\n{code:java}\r\nand issuetype in (standardIssueTypes(),subTaskIssueTypes()) {code}\r\nRegards.\r\n\r\nSylvain MF","author":"Sylvain Martin-Faltot [CACIB]"},{"text":"I have added some new workflows in my scheme but sometimes all of them are displayed and applicable but sometimes some of them are missing even though you can find them in the workflow they are not fetched in the ddl of the issue. Any help please?","author":"zacharoula.brinia"},{"text":"The bug is still available in Jira 9.4.6 :(.","author":"Simone Kaiser"},{"text":"provided workaround is not working for me. If I map specific status with the done column, any issue with that status would disappear from inactive sprint. ","author":"Niteshkumar Shah"}]},{"summary":"Unable to Find Shared Saved Filter when creating a New Board","key":"JSWSERVER-11403","url":"https://jira.atlassian.com/browse/JSWSERVER-11403","type":"Bug","priority":"","description":"h3. Summary\r\n\r\nWhen attempting to create a new board or update a saved filter in the existing board, the user may be unable to retrieve the shared filter depending upon where it is returned in the search results.\r\n\r\nh3. Steps to Reproduce\r\n\r\n# Create the following saved filters:\r\n{noformat}\r\nCash Management - A\r\nCash Management - B\r\nCash Management - C\r\nCash Management - D\r\nCash Management - E\r\nCash Management - F\r\nCash Management - G\r\nCash Management - H\r\nCash Management - I\r\nCash Management - J\r\nCash Management - K\r\nCash Management - L\r\nCash Management - M\r\nCash Management - N\r\nCash Management - O\r\nCash Management - P\r\nCash Management - Q\r\nCash Management - R\r\nCash Management - S\r\nCash Management - T\r\nCash Management - U\r\nCash Management - V\r\nCash Management - W\r\nCash Management - X\r\nCash Management - Y\r\nCash Management - Z\r\nMan ABC\r\nMan Man\r\nMan_Man\r\n{noformat}\r\n# Create a new JIRA Agile board from an existing Saved Filter.\r\n# Attempt to enter \"Man Man\" or \"Man_Man\".\r\n\r\nh3. Expected Results\r\n\r\nThe filters are returned.\r\n\r\nh3. Actual Results\r\n\r\nThe filters are not returned.\r\n\r\nh3. Notes\r\n\r\nIt appears that there is a limitation in the number of results that the drop-down can return, and if the filter is returned after those results it does not appear. If all the 'Cash Management' filters do not exist, 'Man_Man' and 'Man Man' will appear.\r\n\r\nh3. Workaround\r\n\r\nRename the filter something else temporarily, such as A Man ABC, and then use that as it will appear at the top of the list.","createDate":"2014-10-31T14:42:27.000+0000","comments":[{"text":"Our Agile board already upgraded to version 6.6.13 and it wasn't resolve the issue.","author":"Treethawat Thanawachiramate"},{"text":"We are also impacted by this issue.  It appears when we have a number of saved filters beginning with the same number\r\n\r\nETA - We are on JIRA Data Centre 6.4.2 Jira Agile 6.7.0","author":"Lauren Eardley"},{"text":"is this problem really limited to JIRA Agile?\r\nI also can't search for filters containing a dash when i create a pie chart gadget on the dashboard","author":"Dieter Greiner"},{"text":"I have the same issue on version 6.4.11. Re-saving the filter can resolve this even in the same name.","author":"Wendy Yi"},{"text":"I am experiencing the same issue with JIRA 6.4.12 and JIRA agile 6.7.12","author":"Nayanajith Chandradasa"},{"text":"I am on 6.4.x  We renamed the filter to include an 'a' before the name and were able to use the filter.","author":"Amy Bell"},{"text":"Why is this only a minor bug? I have tried to create additional filters and none or those are showing up either. I've noticed that most of our filters are no longer showing up. I can't use these filters in either a new board or dashboard items. We have over a dozen projects and many more to add but can no longer continue. This should be a major bug.","author":"Anthony Buck"},{"text":"This is still a problem in 7.3.x...","author":"Joel Rydén"},{"text":"I'm expericencing the same with JIRA 7.2.2.\r\n\r\nAhhhhhhhhhh, I hate that, is anyone can help?\r\n\r\n \r\n\r\n \r\n\r\nThanks,","author":"Nguyễn Hải Vân"},{"text":"Dear all,\r\n\r\nJust change the filter name to a unique one and create Board then change the name again :). \r\n\r\nLike: I can't search for saved filter named AAAA_TASK_DONE then i change its name to U1NY ==> Create board with U1NY, then rename U1NY to AAAA_TASK_DONE.\r\n\r\nI do know this problem will occur again and again and we all do not know when will this problem be solved so just consider above solution as a workaround way\r\n\r\n \r\n\r\nThanks,","author":"Tran Van Huu"},{"text":"Can you update this bug to include 7.3.x?\r\n\r\n ","author":"Deleted Account"},{"text":"This is happening in the cloud version. At least the workaround worked.","author":"Liz Kao"},{"text":"We have a ton of filters in our system, and users regularly have to add special characters to the beginning of their filter names in order for it to show up in the list when selecting a filter for a board.\r\n\r\nPlease fix!","author":"Shane Wignall"},{"text":"It is so confusing and we need to explain the bug to different users all the time. Please fix the issue as soon as possible. Thank you.","author":"Frost Lai"},{"text":"I opened this ticket since I had been an administrator of Jira since 2014. My roles changed 2 years later and I'm a Jira user currently of the same company.\r\n\r\nToday the ticket still remains the same as the first day. Could Atlassian change the priority to be a higher one please?","author":"Treethawat Thanawachiramate"},{"text":"We have the same issue in Jira 7.6.6.  We have 5300 users in Jira ...  This problem we have often.  please increase priority for this issue.","author":"Jozef Cervenansky"},{"text":"Dear.\r\n\r\nBy managing programs and big projects in Jira, you can have that issue really often. Please increase the priority in order to get that solved quickly. Having this bug since 4-5 years is not professional imho (especially considering the price of the Atlassian Ecosystem).\r\n\r\n \r\n\r\nThank you.","author":"Mathieu Triquoit"},{"text":"Hello All, \r\n\r\nIt looks like the bug is triggered by using special characters in the title of your jql filter. If you re-save your filters with no capitalization and no special characters (i.e. !@#&*)(\"_\") you should be able to find them via search. It worked at least for me.","author":"Jedediah Russell"},{"text":"Same issue in Jira 8.0.2\r\n\r\nplease fix it\r\n\r\n \r\n\r\n ","author":"testcf"},{"text":"Still happening, I believe you have this issue since 2014.\r\n\r\nI agree that the severity is not \"blocker\" but man, if I add all the time trying to get 1 single filter to show on a kanban board, I think it pays it self to solve it.","author":"Ra Acosta"},{"text":"Would be great to get this fixed.  Still happening.","author":"Trudi Ersvaer"},{"text":"Yes still happening and a massive PITA. Please can we get this fixed.","author":"stevie.heyes"},{"text":"Just got caught with this too, on Jira Cloud.  Firstly the dropdown has no affordance or hint that it is scrollable. Secondly, the Filter creation dialog does allow special characters, but the selection mechanism for this dropdown doesn't find them.\r\n\r\nFor such a well-funded, well-hyped company I expected a _lot_ better.  Just how much \"gathering impact\" (read: this issue isn't sexy enough to work on) must we endure before frustrating bugs like this get addressed?","author":"John Hawksley"},{"text":"Hit with the same issue... \r\n\r\nwe have one project which has multiple teams and all teams prefer to have there team name before the filter but due to this bug its not possible to have filters after certain limit. which is a problem. Could this be fixed. i see its open from 2014 and no action is taken it . If its not planned to be fixed then the same restriction should apply to creation of filter as well it should not allow with same prefix after certain number of filters. ","author":"Mahesh Kumar"},{"text":"Same issue for me. We are an enterprise business and need to be able to find a saved filter when searching a list of filters in Wallboard gadget for example.\r\n\r\nHave tried to save filters with different names, prefix and even prefix \"aa \" and nothing seems to work. Jira has a limit on how many filters can show up in the scroll field?","author":"Paul Loveday"},{"text":"We also hit this problem. Would be great to have this fixed. ","author":"Andreas von Euw"},{"text":"Since this was initially reported in 2015, is there any chance this will get assigned to anyone soon?  It's been 4 years.  How many customers (55 right now) have to want it fixed before it gets prioritized?  Any info you can provide on the process would be helpful.  Thanks.","author":"Kelly Jaxheimer"},{"text":"We have also found out this issue and see that this is trending topic... \r\nAny idea of when would it probably be fixed?","author":"Banco de España"},{"text":"We encountered a similar issue, not with Shared Filters, but actually with Portfolio for Jira plugin and the ability to Assign Issue Sources to a Team.  The Issue Source is a searchable drop-down of Agile Boards.\r\n\r\nIt seems if you also create around 20 Agile Boards all beginning with the same string, and including special characters like hyphen or underscore, a similar bug manifests in that the drop-down doesn't list some of the Agile Boards at all (the list gets truncated somehow).\r\n\r\nEx: Create agile boards ABC_one, ABC_two, ABC_three, ABC_four, etc. and the Issue Source drop-down (in Portfolio) stops listing any boards after ABC_twenty.","author":"Jeffrey Thornsen"},{"text":"Yes, I also got same issue. Was clueless and stuck , till I searched and found that a defect is logged. \r\n\r\nWill be really helpful if this can be solved. ","author":"Santanu Kar"},{"text":"Hi All,\r\n\r\nWhat ever filter name?\r\n\r\nJust an heads up as alternative workaround \"On searching just paste exact filter name in search box\"","author":"Dharnesh"},{"text":"For us the workaround to paste the filter name does not work (Jira cloud):(","author":"Bernd Lorenz"},{"text":"Are we waiting for GOD to comment on this Jira to get this fix :)  why cant we just fix it from last 6years this Jira is open ","author":"Mahesh Kumar"},{"text":"Reporting the same issue. When will this be fixed. After migrating to Jira cloud - cannot find recently saved filters while creating new boards (scrum & kanban). It used to work before the cloud migration.\r\n\r\nHad to remove the special character - from the filter name to workaround this issue.","author":"Missy Ann Mathews"},{"text":"Hi Atlassian Team,\r\n\r\nWe faced the same issue using Jira Server 8.13.0.\r\n\r\nOur Jira users use many filters, and therefore decided to name them using special patterns. For example,\r\n{quote}tsspe.ph3.ssp.planning.long.all_tasks\r\n{quote}\r\n, where _tsspe.ph3.ssp_ is a filter prefix. And there are many filter starting from this prefix (let it be 50).\r\n\r\nAnd filter from example above is not appearing while creating or editing Kanban/Scrum Board. Copy-pasting full filter name, trying to populate it char by char do not help.\r\n\r\nAlthough, it is still available while creating/editing gadgets.\r\n\r\nAs mentioned above, workaround is to rename the whole filter to something unique, add it to a board, and then rename it to its initial name. \r\n\r\nBut this is odd and causes additional effort from teams' side.\r\n\r\nPlease take a look at this issue.","author":"Artem Tikhobaev"},{"text":"This is also impacting our environment, as users heavily rely on searches and shared filters. \r\n\r\nPlease give some priority to this. Thanks!\r\n\r\nJira 8.5.3 - Datacenter","author":"Paulo Salvador"},{"text":"Paulo - I've been frustrated by this issue as well... but saw on another thread (which I can't find the link) that the best workaround is to do the following;\r\n\r\n \r\n # Create your query w/ the exact parameters you want, but add a single quotation mark at the beginning of the query name (\"QueryName). By doing that (\"QueryName) your query will come up as one of the first items on the search.\r\n # Go to the board configuration ('General and filter') page & try to find your query in the 'Saved Filter' section (it should be right at the top).\r\n # Once you've found it, select it and leverage it for your board.\r\n # Then go back to your issue queue (\"QueryName) and remove the \" at the beginning of your query name (since you were able to find it - and it's no longer required :) ).\r\n\r\n \r\n\r\nHope the steps above helps... I know I'll be leveraging it for a while (until Atlassian fixes the issue).","author":"Samuel Hallenberg"},{"text":"Is there a cloud ticket for this? We are having the same issue there.","author":"Josh Costella"},{"text":"I have the same issue.","author":"Martin Renaud"},{"text":"Did anyone find a solution?","author":"Dav Anson"},{"text":"I have the same problem, would be great with a solution.","author":"Malin Diallo"},{"text":"I am unable to update or create a board with a specific filter b/c the drop down is not showing it, even when I enter the entire name of the shared filter.  For Cloud.","author":"Karri Adkins"},{"text":"I am also having this issue and wondering if there is any update from Jira team on this.\r\n\r\nCurrently I'm using the workaround of saving the filter as A0, A1 etc but that will only work up to 15 boards (=number of filters listed in the \"Saved filter\" dropdown). We're on Jira Cloud.\r\n\r\nThe way our teams and initiatives are set up, we will soon exceed that number (and I can confirm that the board is impacted once the associated filter drops off the \"Saved filter\" dropdown list)","author":"Siva Chandrasekaran"},{"text":"This cost us an hour too. Frustrating.","author":"evan prothro"},{"text":"Is there any update on this? ","author":"Surbhi Soni"},{"text":"We spent several hours troubleshooting this until we found this bug.  Please fix this.","author":"Anna Bosnick"},{"text":"Same issue on our end. Extremely frustrating.\r\n\r\nI've just created a copy of the board (just not to spend time for configuring from scratch). I've edited a filter and saved it as a new one... BUT I can't use it cause it does not appear in a drop-down list and I CAN'T create a new filter for an existing board cause it only allows me to edit saved filter which is currently used by the board.\r\n\r\n*{color:#de350b}bad user experience (n)(n)(n){color}* \r\n\r\n ","author":"Evgeny Bochkarev"},{"text":"Same here - very frustrating to see that this bug exists since 2014 :-o","author":"Sven Mueller"},{"text":"Wow Atlassian, this is absolutely terrible! I'm part of big org, that is not happy about this...lets get this fixed ASAP","author":"William Diaz"},{"text":"Hello All, \r\n\r\nIt looks like the bug is triggered by using special characters in the title of your jql filter. If you re-save your filters with no capitalization and no special characters (i.e. !@#&*)(\"_\") you should be able to find them via search. It worked at least for me.\r\n \r\n ","author":"Karen Souza"},{"text":"Thank you @Karen Souza, but please Jira fix it!","author":"Daniel Enrique Deternoz Milano"},{"text":"The same for Jira Plans. \r\n\r\nWhen creating plan you can't choose your filter if it's not named \"correctly\".\r\n\r\nThat causes people to keep creating duplicated filters :( blowing up JIRA.\r\n\r\nVery bad user experience.\r\n\r\n \r\n\r\n ","author":"Joanna Maciag"},{"text":"still an issue, limits usability severely","author":"Francisco Schulz"},{"text":"This issue affects Jira v9.4.9","author":"Yan Zhou"},{"text":"This is still happening on the cloud version of Jira too. ","author":"Spiro Kalapodis"},{"text":"WOW. This is so bad. This is the last straw. Moving to Azure instead. Its been a long relationship Atlassian but this is basic functionality that should be working. The number of clients that you are going to start losing is going to be considerable.","author":"Lucy Dilts"},{"text":"This issue affects v9.4.15","author":"Trenton Minx"},{"text":"This issue affects Jira v9.12.14","author":"abdelbar anakkar"}]},{"summary":"Cloned issues inherit the Completed Sprint value and can't be removed","key":"JSWSERVER-10548","url":"https://jira.atlassian.com/browse/JSWSERVER-10548","type":"Bug","priority":"","description":"Cloning issues that are with completed sprint value will inherit the value and can't be removed from UI.\r\n\r\nThe cloned issues however won't show up in the completed sprint reports.\r\n\r\nh4. Workaround 1\r\nRemove the sprint value from its field via JIRA issue navigator bulk edit:\r\n# search for the affected issues in the Issue Navigator;\r\n# click *Tools > Bulk Edit*;\r\n# select the issue and click *Next*, then select *Edit Issues* and click *Next*;\r\n# select _Change Sprint_ and edit the value accordingly - if you don't want the issue to be associated with any sprints, leave the field empty;\r\n# click *Next* and proceed with the instructions to complete the change.\r\n\r\nh4.Workaround 2:\r\n- [Clear Sprint information when cloning JIRA issue | https://confluence.atlassian.com/jirakb/clear-sprint-information-when-cloning-jira-issue-779159157.html]","createDate":"2014-03-27T15:06:15.000+0000","comments":[{"text":"IMHO this is not minor as cloning an issue is a common used feature to handle typical tasks (maintenance, bugfixing etc) but the link to the origin issue´s sprint is mixing up the reports...","author":"Hans-Hermann Hunfeld"},{"text":"This one is also related to this: \r\nhttps://jira.atlassian.com/browse/GHS-6541","author":"Hans-Hermann Hunfeld"},{"text":"The Workaround sounds easy to follow, but I got the message in that Sprint Field: \"An error occurred whilst rendering this message. ...\"","author":"Jose M."},{"text":"Hi. I have empted the field, than it works.","author":"Jose M."},{"text":"I agree this is NOT minor.  Needs to be fixed ASAP (in GHS-6541).","author":"Rob Haughey"},{"text":"Atlassian, we, too, are running into this problem - please FIX!!\r\n","author":"Chris Gray"},{"text":"It seem we have already implemented sensible logic for FixVersion values. We should do the same with Sprint values.\r\nIf the value is archived/closed, then the Cloning process should leave the value behind (not carry it into the new jira).\r\n\r\n","author":"Beth Brawley"},{"text":"Same issue here - any news on a fix?","author":"Alexis Baker"},{"text":"@Jose M. To clarify the work around... the new value must be the 'Sprint ID' value not it's name. The way I find sprint ID is to hover over the 'View in Issue Navigator' button on the Planning screen.\r\n !screenshot-1.png|thumbnail! ","author":"Rob Haughey"},{"text":" !image-2016-07-22-13-20-14-058.png|thumbnail! \r\n\r\nNot allowed to change the sprint with the bulk","author":"Silvi"},{"text":"t","author":"Atlassiansales"},{"text":"Same issue here. ","author":"Aashay Joshi"},{"text":"Putting an empty value in bulk edit does not do anything, the old sprint remains there.","author":"Hanna Walinen"},{"text":"Same issue here. When I clone an epic, all cloned issues in that epic inherit all previous sprint values, and I can't remove them. I can add a new sprint, but I can't remove the old ones.","author":"Alina"},{"text":"Such a pesky annoying thing. The choice should be left to users whether or not 'completed sprints' should be carried over at the time of cloning. 7 years since this was reported and no progress. ","author":"Kashyap K"},{"text":"More than pesky or annoying.  Either let the user remove previously completed sprint values from an issue (the bulk edit does NOT work, neither does editing an individual Issue); or give the user the choice to include/exclude the Sprint field values in the clone.\r\n\r\nHaving this fixed or not makes a big difference:  if not fixed, every Program Increment I must manually re-create a set of some 16 issues, rather than clone and tweak them for the new PI.  These represent a standard set of things we must do each PI. The difference is less than an hour vs. a full day of work.\r\n\r\nThank you.","author":"will.cummings"},{"text":"Also having this issue. In this case: \r\n * go to 'clone' for an issue with a closed sprint value\r\n * select any or none of the options (including or excluding sprint values)\r\n * Submit\r\n * Expected: Issue should clone\r\n * Actual: Get error, \"cannot clone issue, please check your connection\"\r\n\r\nI also noticed that this issue was completed in a sprint which is now closed, but the sprint value isn't showing in the main field-- it looks blank, with the \"+1\" for being in a closed sprint. That seems strange to me, and I'm pretty sure that didn't used to happen.\r\n\r\n \r\n\r\nETA: In our case, it is because we had a validation on the issue that required the affects version field, and the value in the original ticket had an archived fix version. We were able to get around this by unarchiving that version for the purposes of the clone, and then editing from there. Removing my report.","author":"Rabbit Stoddard"},{"text":"Would be great to have a way to delete a sprint out of the completed sprints field for a given ticket.","author":"Eric Sutherland"},{"text":"I've just come across this with a few of mine.  Users picked the wrong sprint, that sprint was closed.  Now can't remove the completed sprint from the list, but it was never worked on there or meant to be included.  Throws off the reports because of it, I just want to be able to clear the field, would even jump through hoops to do it, but nothing so far I've tried has worked.","author":"Shawn Berkstresser"},{"text":"How can this possibly not be fixed after 9 (NINE) years!?!?  if it's not possible, let us know, otherwise, please, you've got 114 reporting this, please take a look and fix.  Thx. ","author":"John West"},{"text":"Hi, our org is using Jira cloud. The workaround does not work. Neither does creating a fresh clone and ensuring not to clone sprint values. ","author":"Sam Speight"},{"text":"This is impacting our teams, please help to remove sprint information from Clone++","author":"Ranganath HV"},{"text":"Please fix this!","author":"Jack Robertson"},{"text":"This bug is affecting Easy Agile Programs customers who use issue cloning. \r\n\r\nWhen planning team-level issues in the app, users select a series of Jira sprints for each Increment. This means that the app shows the issues from those sprints, and issues planned in Easy Agile Programs will be added to those sprints in Jira. \r\n\r\nThe app also maintains two [custom fields|https://help.easyagile.com/easy-agile-programs/programs-custom-fields] for these issues based on these sprints. \r\n\r\n \r\n\r\nBecause cloned issues incorrectly receive sprint values, the app assumes that the issues should be in these sprints. It will show these cloned issues in the given sprints, and they'll also appear in JQL searches using the associated custom field. \r\n\r\nGiven the app uses sprints from Jira as a \"single source of truth\", we're unable to correctly handle cloned issues with incorrect sprint fields. \r\n\r\n \r\n\r\nThanks to the customer who was able to identify this bug as the root cause! ","author":"Henri Seymour {Easy Agile}"},{"text":"It would be very beneficial to my team if this bug were fixed.","author":"Katie Downing-Powell"},{"text":"[~86c315441630] - It's been over 10 years since this bug was first reported...  Doesn't look like Atlassian is interested in fixing it.\r\n\r\nI have found that _cloning a single Story_ gives you the choice to include sprint values or not.  But yeah, once the deed is done, there is no way to go back and clean it up.  Haven't tried the bulk-edit workaround in a while, but it wasn't working 3 years ago when I tried it.","author":"will.cummings"}]},{"summary":"Any gadget sends header limit error when the filter calls around 430 issues","key":"JSWCLOUD-20506","url":"https://jira.atlassian.com/browse/JSWCLOUD-20506","type":"Bug","priority":"","description":"h3. Issue Summary\r\nPie chart gadget sends header limit error when the filter calls around 430 issues.\r\nWhen clicking on any segment of the pay chart Jira sends all the called issues through the URL, if these are more that 430 the user receives a \"header too large error\"\r\n\r\nProblem is reported for other gadgets as well.\r\n\r\nh3. Steps to Reproduce\r\n # Create a filter with a JQL like issue in (ISS-1,ISS-2,ISS3,ISS-4...........) with more than 430 issues\r\n # Create a workload pie chart gadget and use the previously created filter\r\n # Click on a segment of the pie chart\r\n !screenshot-1.png|thumbnail! \r\n\r\nh3. Expected Results\r\nTo display the information or one error indicating what is the problem\r\n\r\nh3. Actual Results\r\nA 400 bad request header too large error is displayed\r\n\r\nh3. Workaround\r\n Currently there is no known workaround for this behavior. A workaround will be added here when available\r\n\r\nIn case that search does not work, it is possible to try a different approach:\r\n* Create a new filter and refer to the existing filter. e.g filter_new = <filter used in the dashboard>\r\n* Change the gadget to use the new filter. 400 error should be resolve in most of the case","createDate":"2020-07-07T16:29:11.000+0000","comments":[{"text":"Celso, how are you? We are trying to reproduce the case with the indications you suggested, we will comment on the result shortly.\r\nPlease do not close the request yet","author":"Gastón Barros"},{"text":"compare:\r\nhttps://jira.atlassian.com/browse/JRACLOUD-80076\r\nhttps://jira.atlassian.com/browse/JRACLOUD-76393\r\nhttps://jira.atlassian.com/browse/JRACLOUD-83196","author":"Florian Reichl"}]},{"summary":"Sending an email with an invalid attachment causes the attachment to fail to be added silently","key":"JSDSERVER-16135","url":"https://jira.atlassian.com/browse/JSDSERVER-16135","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nSending an email with an invalid attachment causes the attachment to fail to be added silently\r\nh3. Steps to Reproduce\r\n # Configure an incoming mail handler for the JSM project(Email Requests)\r\n # try sending an email to the incoming mail handler with an invalid attachment (ie jpeg file and saved as a png file extension)\r\n\r\nh3. Expected Results\r\n * The issue is created with the attachment added. Or\r\n * Show in the logs/ticket that the attachment failed to be attached\r\n\r\nh3. Actual Results\r\n * Attachment failed to be added silently and no errors were reported in the logs\r\n\r\nh3. Workaround\r\n\r\nCurrently not available\r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|_Example: 5.12.15_|_Yes_|\r\n|Most Recent Bug-Fix Release| | |\r\n|Previous Major Release| | |\r\n|Most Recent LTS| | |\r\n|Previous Supported LTS| | |\r\n|_Other Versions.._| | |\r\n|_(Add rows as needed)_| | |","createDate":"2025-04-01T11:38:20.000+0000","comments":[]},{"summary":"Decimal separator is removed when saving float values in Assets objects","key":"JSDSERVER-16134","url":"https://jira.atlassian.com/browse/JSDSERVER-16134","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen saving an attribute value using comma as the decimal separator, the separator is removed, leading to a wrong value. The problem is inverted (dot is removed) when using locales that default to comma (such as Dutch or German).\r\nh3. Steps to Reproduce\r\n\r\n*Modality 1 - English locale*\r\n # Create an object type with a float attribute.\r\n # Give it any value with a dot decimal separator, such as 1.5.\r\n # In the list view, edit the value to use a comma as the decimal separator, such as 1,5.\r\n # The separator is removed and the value is saved as 15.\r\n\r\n*Modality 2 - German locale*\r\n # Create an object type with a float attribute.\r\n # Give it any value with a comma decimal separator, such as 1,5.\r\n # In the list view, edit the value to use a dot as the decimal separator, such as 1.5.\r\n # The separator is removed and the value is saved as 15.\r\n\r\n(In the object edit view, the issue was not reproducible. In this case, the separator is replaced by a dot or comma, depending on the locale, but the value is not modified).\r\nh3. Expected Results\r\n\r\nAssets should fully respect the usage of the default decimal separator, as some locale settings use commas instead of dots (for example, Dutch and German). Editing of float attributes should be saved correctly, and the values should also be consistently displayed depending on the locale.\r\n\r\nIn previous versions, the error message \"Number is not valid (Float)\" would be displayed. Apparently, the \"fix\" on bug [JSDSERVER-15703|https://jira.atlassian.com/browse/JSDSERVER-15703] resulted in this new behaviour.\r\nh3. Actual Results\r\n\r\nThe value is modified, as the separator is lost.\r\nh3. Workaround\r\n\r\nUse a dot or comma as a decimal separator, depending on the case.\r\nh3. Versions Tested\r\n\r\n \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|10.3.5|Yes|\r\n|Most Recent Bug-Fix Release|10.5.0|Yes|\r\n|Previous Major Release|10.3.3|No|\r\n|Most Recent LTS|10.3.5|Yes|\r\n|Previous Supported LTS|10.3.3|No|","createDate":"2025-04-01T09:06:14.000+0000","comments":[]},{"summary":"Assets Confluence Macro object information pop-up is broken","key":"JSDSERVER-16133","url":"https://jira.atlassian.com/browse/JSDSERVER-16133","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen using the Assets Confluence Macro to display a list of objects from an object schema in Jira, hovering over attributes referencing other objects results in a pop-up. This pop-up is broken in version 9.2 of Confluence, showing only a grey box. In previous versions of Confluence, such as 8.5, the pop-up displays the correct information about the object.\r\nh3. Steps to Reproduce\r\n # Link Confluence and Jira.\r\n # Install the Assets Confluence Macro in Confluence.\r\n # Create a sample object schema in Jira. For test purposes, you can use the default Assets IT Service Management project with sample data in JSM.\r\n # Create a page in Confluence and add the macro.\r\n # Load all objects from the object schema on the page.\r\n # Find an object that contains an attribute referencing other objects, such as Business Service Owner in the sample schema.\r\n # Hover over an entry of this attribute type, such as the example \"Wes Shults\" for object \"TESTITSM-100\".\r\n\r\nh3. Expected Results\r\n\r\nThe object information is displayed correctly (Confluence 8.5):\r\n\r\n!nobug.png|width=281,height=260!\r\nh3. Actual Results\r\n\r\nA grey box appears, covering the data (Confluence 9.2):\r\n\r\n!bug.png|width=273,height=227!\r\nh3. Workaround\r\n\r\nCurrently, there is no known workaround for this behaviour. A workaround will be added here when available.\r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|_Confluence 9.2_|_Yes_|\r\n|Most Recent Bug-Fix Release| | |\r\n|Previous Major Release| | |\r\n|Most Recent LTS| | |\r\n|Previous Supported LTS| | |\r\n|_Other Versions.._| | |\r\n|_(Add rows as needed)_| | |","createDate":"2025-03-28T15:07:37.000+0000","comments":[]},{"summary":"Assignee, Reporter and Request Participant fields gets word wrapped","key":"JSDSERVER-16131","url":"https://jira.atlassian.com/browse/JSDSERVER-16131","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe Assignee, Reporter and Request Participant field now features word wrapping, which complicates the process of selecting the appropriate user for the list.\r\nh3. Steps to Reproduce\r\n # Create an issue in JSM project\r\n # Try to add any user with a long display name or email id.\r\n\r\nh3. Expected Results\r\n\r\nComplete email-id is being shown\r\n\r\n!image-2025-03-28-18-25-56-952.png|width=578,height=251!\r\nh3. !image-2025-03-28-18-27-11-252.png|width=849,height=70!\r\nh3. Actual Results\r\n\r\nEmail Id is getting word wrapped\r\n\r\n!image-2025-03-28-18-28-40-763.png|width=594,height=316!\r\n\r\n!image-2025-03-28-18-28-08-331.png|width=701,height=113!\r\nh3. Workaround\r\n # Right-click on the Issue View screen and select \"View Page Source.\"\r\n # Search for the keyword \"Assignee/Reporter/Request Participant\" and locate the relevant sections.\r\n{code:java}\r\n<label for=\"customfield_XXXXX\">Request participants:</label>\r\n...\r\n<span id=\"customfield_XXXXX-val>\" data-name=\"Request participants:\" data-fieldtype=\"sd-request-participants\" ...\r\n{code}\r\n# Extract the customfield span id from the span id section.\r\n# Add the announcement banner below with the correct span id.\r\n{code:java}\r\n<style>\r\n  #customfield_XXXXX-val {\r\n      width: 400px !important;\r\n      max-width: 100% !important;\r\n  }\r\n</style>{code}\r\n\r\n \r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|10.3.3|Yes|\r\n|Most Recent Bug-Fix Release| | |\r\n|Previous Major Release|10.0.0|No|\r\n|Most Recent LTS| | |\r\n|Previous Supported LTS| | |\r\n|_Other Versions.._|10.1.1 |Yes|\r\n|_(Add rows as needed)_| | |","createDate":"2025-03-28T13:03:25.000+0000","comments":[{"text":"Also see this at V10.3.4","author":"Sergio Filipe"}]},{"summary":"when using filter Issue scope AQL, empty text customfield is breaking IQL OR statement for validation","key":"JSDSERVER-16118","url":"https://jira.atlassian.com/browse/JSDSERVER-16118","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen using filter Issue scope AQL, empty text custom-field is breaking IQL OR statement for validation. Issue started after upgrade from 9.12 to 10.3. It works fine in older version.\r\nh3. Steps to Reproduce\r\n # Create two Assets CF -> *ContractCF* and *Party* *group* and one text CF-> *Customer* *user*\r\n # Create an assets schema test and three Assets object-Type -> {*}Contract{*}, *Party* {*}Group{*}, *User*\r\n # Contract ObjectType should have attribute referring to party group and user object.\r\n # Create objects in all three object-type.\r\n # Now set up the context of custom-field *Party* *group* to list down all party group objects.\r\n # Set-up the context of custom-field *contractCF* to list down all contract objects and specify filter Issue scope as below. Here customfield_10234 is for *PartyGroup* and customfield_56789 is for *customer* *user.* Filter issue scope: ->\r\n{quote}  **   \"Party Group\"= ${customfield_01234} OR \"Customer User\" in ${customfield_56789} {quote}\r\n # Add all the three CF to a test project and create issue screen. \r\n # Try to create an issue and select group object in *Party* *group*\r\n # Leave the *Customer user* field empty\r\n # Select contract object in *contractCF*\r\n # Click on create issue.\r\n\r\nloom video:\r\n[https://www.loom.com/share/4d3c7caee57d43668e7298fe91470cae?sid=ee0beb5c-35fb-4afb-a28d-c0afb55f11e0]\r\nh3. Expected Results\r\n\r\n Issue should be created without any issue\r\nh3. Actual Results\r\n\r\nissue is not created until we give any value in the text field userCF. It displays error for contract object.\r\n{noformat}\r\nCould not find Assets object/s (object key of selected contract object) {noformat}\r\nh3. Workaround\r\n # Remove the OR condition with text CF. \r\n # Give any random value like N/A and you can delete that later.\r\n\r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|_10.3.3_|_Yes_|\r\n|Most Recent Bug-Fix Release| | |\r\n|Previous Major Release| | |\r\n|Most Recent LTS|10.3.3|Yes|\r\n|Previous Supported LTS| | |\r\n|_Other Versions.._|9.12.4|No|\r\n|_(Add rows as needed)_| | |","createDate":"2025-03-20T08:04:57.000+0000","comments":[{"text":"Affected to 10.3.2 and 10.3.4 too.","author":"Cristina Sanz García"}]},{"summary":"Assets fails to handle Long values on Oracle DB","key":"JSDSERVER-16117","url":"https://jira.atlassian.com/browse/JSDSERVER-16117","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nFew Asset objects are currently missing from the Jira UI, and the clean reindex process fails due to an SQLException. Furthermore, the Jira assets custom field is generating an error: \"Error rendering ‘com.atlassian.jira.jira-view-issue-plugin:details-module’.\"\r\nh3. Steps to Reproduce\r\n\r\nJSM version 10.3.3 is configured with Oracle Database Server 19.26.0.0.0 and Oracle JDBC Driver 19.3. Users have reported that certain objects are missing in the user interface, and the asset clean reindex operation fails with an error. The Atlassian Jira logs are showing a recurring error: {{java.sql.SQLException: Cannot extract column 23 for type java.lang.Long}}\r\nh3. Expected Results\r\n\r\nAssets clean reindex should be completed without any errors. There should not be any objects missing in the schema, and the assets custom field should accurately display the objects.\r\nh3. Actual Results\r\n\r\nThe below exception is thrown in the Atlassian-jira.log file:\r\n{noformat}\r\n2025-03-17 11:17:44,858+0100 support-zip ERROR Anonymous user     [c.r.j.p.i.s.c.d.dao.sql.AbstractAOService] Error querying database:\r\njava.sql.SQLException: Cannot extract column 23 for type java.lang.Long\r\n    at com.riadalabs.jira.plugins.insight.services.core.dal.dao.sql.AbstractAOService.getObjectWithNullCheck(AbstractAOService.java:860)\r\n    at com.riadalabs.jira.plugins.insight.services.core.dal.dao.sql.AbstractAOService.findObjectAttributeValuesDTOs(AbstractAOService.java:718)\r\n    at com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectDalImpl.findDBObjectsInternal(ObjectDalImpl.java:578)\r\n    at com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectDalImpl.findDBObjects(ObjectDalImpl.java:538)\r\n    at com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectDalImpl.loadObject(ObjectDalImpl.java:358)\r\n    at io.riada.insight.index.model.ObjectIndexImpl.render(ObjectIndexImpl.java:294)\r\n    at io.riada.insight.index.model.ObjectIndexImpl.render(ObjectIndexImpl.java:65)\r\n    at io.riada.insight.index.model.InsightIndexBase$1.load(InsightIndexBase.java:101)\r\n    at io.riada.insight.index.model.InsightIndexBase$1.load(InsightIndexBase.java:98)\r\n    at com.google.common.cache.LocalCache$LoadingValueReference.loadFuture(LocalCache.java:3574)\r\n    at com.google.common.cache.LocalCache$Segment.loadSync(LocalCache.java:2316)\r\n    at com.google.common.cache.LocalCache$Segment.lockedGetOrLoad(LocalCache.java:2189)\r\n    at com.google.common.cache.LocalCache$Segment.get(LocalCache.java:2079)\r\n    at com.google.common.cache.LocalCache.get(LocalCache.java:4017)\r\n    at com.google.common.cache.LocalCache.getOrLoad(LocalCache.java:4040)\r\n    at com.google.common.cache.LocalCache$LocalLoadingCache.get(LocalCache.java:4989)\r\n    at io.riada.insight.index.model.InsightIndexBase.load(InsightIndexBase.java:71)\r\n    at io.riada.insight.index.model.ObjectIndexImpl.loadObject(ObjectIndexImpl.java:172)\r\n    at java.base/java.util.stream.ReferencePipeline$3$1.accept(Unknown Source)\r\n    at java.base/java.util.concurrent.ConcurrentHashMap$KeySpliterator.forEachRemaining(Unknown Source)\r\n    at java.base/java.util.stream.AbstractPipeline.copyInto(Unknown Source)\r\n    at java.base/java.util.stream.AbstractPipeline.wrapAndCopyInto(Unknown Source)\r\n    at java.base/java.util.stream.ReduceOps$ReduceOp.evaluateSequential(Unknown Source)\r\n    at java.base/java.util.stream.AbstractPipeline.evaluate(Unknown Source)\r\n    at java.base/java.util.stream.ReferencePipeline.collect(Unknown Source)\r\n    at io.riada.insight.index.filter.objectticketconnection.ObjectTicketConnectionFilterImpl.countObjectTicketConnectionsBySchema(ObjectTicketConnectionFilterImpl.java:51)\r\n    at com.riadalabs.jira.plugins.insight.services.analytics.service.InsightInstanceAnalyticsServiceImpl.getPerSchemaStats(InsightInstanceAnalyticsServiceImpl.java:102)\r\n    at com.riadalabs.jira.plugins.insight.services.analytics.service.InsightAtstSupportServiceImpl.getPerSchemaAnalytics(InsightAtstSupportServiceImpl.java:28)\r\n    at com.atlassian.troubleshooting.jira.bundle.AssetsSupportBundle.get {noformat}\r\nh3. Workaround\r\n\r\nRequired, if there is no workaround please state:\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available","createDate":"2025-03-20T07:54:24.000+0000","comments":[]},{"summary":"An Empty Date Field Caused an NPE in the Clone Action in Automation (A4J) Rule","key":"JSDSERVER-16116","url":"https://jira.atlassian.com/browse/JSDSERVER-16116","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe presence of the field Due Date in a project's screens causes a null pointer exception in a clone action automation involving an Assets field copying a value from the trigger issue.\r\n\r\nh3. Steps to Reproduce\r\n # Create a sample object schema and a few objects.\r\n # Create a sample project.\r\n # Create an Assets object custom field, associate it with the object schema and add it to the project.\r\n # In the screens for the project, add the field Due Date.\r\n # In the project, create an automation rule:\r\n ** When: Manually triggered\r\n ** Then: Clone issue into (Same project, same issue type, Assets field \"Copy Assets Field from Trigger issue\")\r\n ** Name it something like \"Assets Clone Issue\".\r\n # Create a new issue in the project and add an object to the Assets field.\r\n # Click on More > Assets Clone Issue. A message will state the rule was executed successfully.\r\n # Go to the automation audit logs and check that the rule failed with the following error:\r\n** {code:java}\r\nUnexpected error executing rule:\r\njava.lang.NullPointerException\r\n{code}\r\n# Now, remove the Due Date field from the project screens.\r\n# Try the clone action again. It will work.\r\n\r\n(!) Recent reports indicate that, similar to the 'Due Date' field, any field primarily a date type that remains empty can result in a Null Pointer Exception (NPE) error. This occurs when using the clone/create option, which involves an operation to copy the values of Asset fields within the Automation rule (A4J).\r\n\r\nh3. Expected Results\r\n\r\nThe issue is cloned successfully.\r\n\r\nh3. Actual Results\r\n\r\nThe automation rule fails.\r\n\r\nh3. Workaround\r\n\r\nIf only the Due Date or any other removable field is involved, it could be removed from the issue view. However, if the situation involves essential custom fields that must be copied, it is advisable to implement an IF condition in the rule to verify the value of these specific fields for the time being.","createDate":"2025-03-19T15:52:01.000+0000","comments":[]},{"summary":"The creation or editing of assets objects fails due to a NullPointerException.","key":"JSDSERVER-16066","url":"https://jira.atlassian.com/browse/JSDSERVER-16066","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nAssets have a limit on the number of object attributes set to the Java integer limit of 2,147,483,647. When the number of object attributes exceeds this limit, the code will fail with a Null Pointer Exception (NPE) when new objects are created or when additional attributes are added to existing objects.\r\nh3. Steps to Reproduce\r\n\r\nA straightforward method to replicate this issue is to check the maximum ID in the AO_8542F1_IFJ_OBJ_ATTR table or the sequence AO_8542F1_IFJ_OBJ_ATTR_ID_seq, ensuring it exceeds the value of 2,147,483,647.\r\nh3. Expected Results\r\n\r\nAsset object creation, editing, and deletion should function without encountering any NullPointerException.\r\nh3. Actual Results\r\n\r\nThe below exception is thrown in the Atlassian-jira.log file:\r\n{noformat}\r\n2025-02-19 08:40:07,027+0000 http-nio-8080-exec-61 WARN  /rest/insight/1.0/object/create \\[c.r.j.p.i.services.core.ObjectServiceImpl] Failed to create object Test (null)\r\njava.lang.NullPointerException\r\nat com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectAttributeDalImpl.addObjectAttributeValue(ObjectAttributeDalImpl.java:360)\r\nat java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:195)\r\nat java.base/java.util.stream.ReferencePipeline$2$1.accept(ReferencePipeline.java:177)\r\nat java.base/java.util.ArrayList$ArrayListSpliterator.forEachRemaining(ArrayList.java:1655)\r\nat java.base/java.util.stream.AbstractPipeline.copyInto(AbstractPipeline.java:484)\r\nat java.base/java.util.stream.AbstractPipeline.wrapAndCopyInto(AbstractPipeline.java:474)\r\nat java.base/java.util.stream.ReduceOps$ReduceOp.evaluateSequential(ReduceOps.java:913)\r\nat java.base/java.util.stream.AbstractPipeline.evaluate(AbstractPipeline.java:234)\r\nat java.base/java.util.stream.ReferencePipeline.collect(ReferencePipeline.java:578)\r\nat com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectAttributeDalImpl.handleValueBeans(ObjectAttributeDalImpl.java:316)\r\nat com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectAttributeDalImpl.storeValueToAttribute(ObjectAttributeDalImpl.java:254)\r\nat com.riadalabs.jira.plugins.insight.services.core.dal.impl.ObjectAttributeDalImpl.lambda$bulkChangeAttributeValues$11(ObjectAttributeDalImpl.java:660)\r\nat java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:195)\r\nat java.base/java.util.stream.ReferencePipeline$3$1.accept(ReferencePipeline.java:195)\r\nat java.base/java.util.ArrayList$ArrayListSpliterator.forEachRemaining(ArrayList.java:1655)\r\nat java.base/java.util.stream.AbstractPipeline.copyInto(AbstractPipeline.java:484)\r\nat java.base/java.util.stream.AbstractPipeline.wrapAndCopyInto(AbstractPipeline.java:474 {noformat}\r\nh3. Workaround\r\n\r\nRequired, if there is no workaround please state:\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available\r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|_Example: 9.14.2_|_(Yes / No)_|\r\n|Most Recent Bug-Fix Release| | |\r\n|Previous Major Release| | |\r\n|Most Recent LTS| | |\r\n|Previous Supported LTS| | |\r\n|_Other Versions.._| | |\r\n|_(Add rows as needed)_| | |","createDate":"2025-02-28T11:57:51.000+0000","comments":[]},{"summary":"User mentioned notifications are not sent after enabling notifications for agents acting as customers","key":"JSDSERVER-16061","url":"https://jira.atlassian.com/browse/JSDSERVER-16061","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe 'mention' notifications are not working for a user who is an Agent and a Customer even though the configuration settings are enabled as 'Yes, send customers both Jira Service Management and Jira notifications'.\r\nh3. Steps to Reproduce\r\n * Install JSM 5.17.0 or above\r\n * Go to Applications >> JSM Configuration >> Notifications >> Set 'Yes, send customers both Jira Service Management and Jira notifications'\r\n * Create a JSM project\r\n * Create a user and give them JSM license\r\n * Create an issue and add the newly created user as Reporter\r\n * Mention the Reporter in a comment and share it with the customers(public comment)\r\n\r\nh3. Expected Results\r\n\r\nThe Reporter user will get both 'mentioned' notification and the public comment added notification.\r\nh3. Actual Results\r\n\r\n\r\nThe Reporter only receives the public comment added notification.\r\nh3. Workaround\r\n\r\nCurrently, there is no known workaround for this behavior. A workaround will be added here when available.\r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|5.17.5|_Yes_|\r\n|Most Recent Bug-Fix Release|10.4.0|Yes|\r\n|Previous Major Release|10.0.0|Yes|\r\n|Most Recent LTS|10.3.2|Yes|\r\n|_Other Versions.._|5.16.5|No|","createDate":"2025-02-25T07:51:16.000+0000","comments":[]},{"summary":"Help Center | Requests: Incomplete and non-descriptive label for the button","key":"JSDSERVER-16057","url":"https://jira.atlassian.com/browse/JSDSERVER-16057","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nAn incomplete and non-descriptive label such as \"Edit\" is provided for the button.\r\nh3. Steps to Reproduce\r\n # Open the JSM DC Help Center instance.\r\n # Navigate to the \"Requests\" button and expand it.\r\n # Navigate to the \"All requests\" and activate it.\r\n # Using a screen reader, navigate to the mentioned button.\r\n # Listen and note that the button's label is incomplete and non-descriptive.\r\n\r\nh3. Screen Recording\r\n\r\n[^Non-descriptive label screen recording.mp4]\r\nh3. Actual Results\r\n\r\nWhen screen reader users navigate through the \"Requests\" page, they encounter an incomplete and  non-descriptive label, such as \"Edit\" for the button.\r\n\r\nAs a result, screen reader users may not fully understand the button's purpose.\r\nh3. Expected Results\r\n\r\nThe screen reader should announce unique and descriptive labels for buttons to ensure users can easily understand their purpose.\r\n\r\nIn this case, update the value of the \"aria-label\" attribute to \"Edit visible columns\" to provide a clear and specific description of the button’s function.\r\n\r\n\r\n{noformat}\r\nNote: Before implementing the label for this control, please consult with the content design team to determine the best label for this approach.\r\n{noformat}\r\n\r\n\r\n\r\nh3. Code Snippet:\r\n{code:java}\r\n<button class=\"edit-visible-columns\" data-testid=\"edit-visible-columns\" type=\"button\">\r\n    <span class=\"icon-container\">\r\n        <span data-vc=\"icon-undefined\" role=\"img\" aria-label=\"Edit visible columns\" class=\"icon\"></span>\r\n    </span>\r\n</button>\r\n {code}\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available\r\nh3. Environment\r\n\r\nMacBook Pro (16-inch, 2021)\r\nmacOS Sonoma 14.7\r\nOperations - Windows11\r\nChrome - Version 133.0.6943.127 (Official Build) (64-bit)\r\nSafari- Version 18.0\r\nFirefox- Version 135.0 (64-bit)\r\nJAWS- Version 2023\r\nNVDA- Version 2024.4.2\r\nVoiceOver - Version Latest","createDate":"2025-02-24T10:45:14.000+0000","comments":[]},{"summary":"Assets automation does not create Jira tickets","key":"JSDSERVER-16052","url":"https://jira.atlassian.com/browse/JSDSERVER-16052","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe Asset automation rule for creating Jira tickets fails when the Select List (single choice) custom field is set as required and has a default value configured.\r\nh3. Steps to Reproduce\r\n # Created a custom field of type “Select List (single choice).”\r\n # Added this custom field to the issue screen.\r\n # Under the field configuration, configure custom field as \"Required.\"\r\n # Configured a default value for the custom field.\r\n # Created a Asset automation rule to create a Jira issue when the object is updated.\r\n\r\nh3. Expected Results\r\n\r\nAsset automation should create a Jira ticket.\r\nh3. Actual Results\r\n\r\n Unfortunately, the Jira issue creation failed, and observed the below errors in the logs. In the logs below, \"select\" is the name of the Select List custom field that I created.\r\n{code:java}\r\n2025-02-14 06:25:58,554 [insight-event-0] | Execute Rule action (AutomationRuleCreateJiraIssueAction): Start, id: 2, event [id: 1, aql: No aql], condition: objectType = \"SOT\"\r\n2025-02-14 06:25:58,560 [insight-event-0] | AutomationRuleCreateJiraIssueAction, Unexpected error: com.atlassian.jira.util.SimpleErrorCollection@291ce2e4[errors={customfield_10700=Select is required.},errorMessages=[],reasons=[VALIDATION_FAILED]]\r\ncom.riadalabs.jira.plugins.insight.common.exception.JiraServiceInsightException: com.atlassian.jira.util.SimpleErrorCollection@291ce2e4[errors={customfield_10700=Select is required.},errorMessages=[],reasons=[VALIDATION_FAILED]]\r\n    at com.riadalabs.jira.plugins.insight.services.jira.JIRAServiceImpl.createIssue(JIRAServiceImpl.java:590) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.jira.JIRAServiceImpl.createIssue(JIRAServiceImpl.java:543) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.action.AutomationRuleCreateJiraIssueAction.doActionSafe(AutomationRuleCreateJiraIssueAction.java:64) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.action.AbstractInsightAutomationAction.doAction(AbstractInsightAutomationAction.java:107) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.rule.impl.AutomationRuleEngineImpl.executeAction(AutomationRuleEngineImpl.java:692) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.rule.impl.AutomationRuleEngineImpl.executeActions(AutomationRuleEngineImpl.java:677) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.rule.impl.AutomationRuleEngineImpl.matchConditionAndExecuteActions(AutomationRuleEngineImpl.java:470) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.rule.impl.AutomationRuleEngineImpl.executeAsConfiguredUser(AutomationRuleEngineImpl.java:268) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.rule.impl.AutomationRuleEngineImpl.handleAsyncEvent(AutomationRuleEngineImpl.java:218) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at com.riadalabs.jira.plugins.insight.services.automation.event.AutomationRuleEventListener.onAsyncEvent(AutomationRuleEventListener.java:94) ~[insight-10.12.1-QR-0273.jar:?]\r\n    at jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method) ~[?:?]\r\n    at jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77) ~[?:?]\r\n    at jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43) ~[?:?]\r\n    at java.lang.reflect.Method.invoke(Method.java:569) ~[?:?]\r\n    at com.google.common.eventbus.Subscriber.invokeSubscriberMethod(Subscriber.java:85) ~[guava-32.1.1-jre.jar:?]\r\n    at com.google.common.eventbus.Subscriber.lambda$dispatchEvent$0(Subscriber.java:71) ~[guava-32.1.1-jre.jar:?]\r\n    at com.atlassian.sal.core.executor.ThreadLocalDelegateRunnable.run(ThreadLocalDelegateRunnable.java:34) ~[?:?]\r\n    at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1136) ~[?:?]\r\n    at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:635) ~[?:?]\r\n    at java.lang.Thread.run(Thread.java:840) ~[?:?] {code}\r\nh3. Workaround\r\n\r\nReconfiguring the automation action to utilize an HTTP Request or executing a Groovy script can serve as a viable workaround, if feasible.","createDate":"2025-02-21T02:52:22.000+0000","comments":[]},{"summary":"SLA does not stop if the \"Resolution\" has been set twice within a workflow transition","key":"JSDSERVER-16048","url":"https://jira.atlassian.com/browse/JSDSERVER-16048","type":"Bug","priority":"","description":"h3. Issue Summary\r\nSLA does not stop if the \"Resolution\" has been twice in the same workflow transition.\r\nFor example, setting a \"Resolution\" field through workflow transition post function, whilst closing the issue through REST endpoint and setting the \"Resolution\" value within.\r\n\r\nThis is reproducible on Data Center: yes\r\n\r\nh3. Steps to Reproduce\r\n# Modify used workflow and add a post function to set Resolution field (e.g. to \"Done\"). Publish the workflow\r\n# Create a SLA that has Stop condition \"Entered Status: Done\"\r\n# Create a JSM issue that has the SLA from step 2 applied, and running once the issue is created\r\n# Close a request through REST endpoint [for issue transition| https://docs.atlassian.com/software/jira/docs/api/REST/9.12.0/#api/2/issue-doTransition]. Make sure to include \"Resolution\" value \"Done\" in the REST request body.\r\n\r\nh3. Expected Results\r\nThe SLA stops, regardless if the issue has been closed through REST request or through UI.\r\n\r\nh3. Actual Results\r\nThe SLA keeps running once the issue has been closed through REST endpoint.\r\n\r\nh3. Workaround\r\nh5. Workaround 1\r\nOne needs to make sure that the \"Resolution\" value is set only once:\r\n* Through Workflow screen pop-up,\r\n* Through Workflow post-function,\r\n* or through REST request.\r\n\r\nh5. Workaround 2\r\nMove the post function step to after the issue history event, then the problem can be avoided as JSM will see the original history item.\r\n","createDate":"2025-02-18T07:55:25.000+0000","comments":[]},{"summary":"Assets reference custom field shows error when attempting Jira move","key":"JSDSERVER-16046","url":"https://jira.atlassian.com/browse/JSDSERVER-16046","type":"Bug","priority":"","description":"h3. Problem\r\n\r\nWhen moving issues with Asset Custom Fields that have Filter Issue Scope defined, it fails to move the issue due to error {*}Could not find Asset object/s{*}.\r\n\r\nThis issue does not occur in JSM 5.12.\r\nh3. Environment\r\n\r\nJSM 10.x\r\nh3. Steps to Reproduce\r\n # Import object schema [^jsm-error-move-issue-obj-sche_2025-02-13T02_14_04.814Z.zip]\r\n ** The object schema contains 4 objects:\r\n *** !screenshot-1.png|thumbnail!\r\n # Create 2 Asset custom fields and associate them with Create/View screens:\r\n ** Product:\r\n *** !screenshot-2.png|thumbnail!\r\n ** Model:\r\n *** !screenshot-3.png|thumbnail!\r\n # Create a ticket with the Product and Model fields filled:\r\n ** !screenshot-4.png|thumbnail!\r\n # Move this ticket to another issue type in the same project:\r\n ** !screenshot-5.png|thumbnail!\r\n\r\nh3. Expected Results\r\n\r\nIn JSM 5.12 (Jira 9.12), the Move Issue screen does not prompt updating the Model field:\r\n * !screenshot-6.png|thumbnail!\r\n\r\nThis is expected as both Product and Model are not required fields.\r\nh3. Actual Results\r\n\r\nIn JSM 10 (Jira 10), the Move Issue screen prompts updating the Model field:\r\n * !screenshot-7.png|thumbnail!\r\n\r\nAfter selecting a value from the dropdown menu, it prompts error *Could not find Asset object/s* and the Move Issue process can't proceed:\r\n * !screenshot-8.png|thumbnail!\r\n\r\nh3. Workarounds\r\n\r\nDisable the dark feature assets.aql.scope.filtering.on.issue.update by:\r\n - Going to the page: <JIRA_BASE_URL>/secure/SiteDarkFeatures!default.jspa\r\n - Adding assets.aql.scope.filtering.on.issue.update.disabled to the list of dark features","createDate":"2025-02-16T02:41:58.000+0000","comments":[]},{"summary":"Help Center | Report server for fix: Description list mark-up used unnecessarily","key":"JSDSERVER-15806","url":"https://jira.atlassian.com/browse/JSDSERVER-15806","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nUnnecessary description list is provided for the mentioned instance on the page.\r\nh3. Steps to Reproduce\r\n # Open \"JSM System Dashboard\" page.\r\n # Navigate to the \"Projects\" in the header section and choose any ITSM project from the options.\r\n # Navigate to the \"Raise a request\" link in the side navigation and activate it.\r\n # Select \"Sample JSM\" link from portal page.\r\n # Select \"Report a server for fix\" link.\r\n # Navigate onto the \"Browse affected server\" > \"Show graph\" > \"Configure\" buttons and activate them.\r\n # Using screen reader navigate using left right arrow keys to the mentioned content.\r\n # Listen that the mentioned text is marked up as description list unnecessarily.\r\n\r\nh3. Screenshot\r\n\r\n!Screenshot 2024-12-11 at 6.42.38 PM.png|width=471,height=259!\r\nh3. Actual Results\r\n\r\nThe content such as \"Reference depth:\", \"Inbound References\", \"The max. number of Inbound References from the same Object Type...\" and so on is marked up as description list unnecessarily. As a result, screen reader users found it difficult to understand the content structure.\r\nh3. Expected Results\r\n\r\nScreen reader should announce the content as plain text for their users.\r\n\r\nRemove description list from the mentioned content and code it within <div> element. In addition, if required CSS can be used to maintain the presentation of the page if required.\r\n\r\n*Code Example*\r\n{code:java}\r\n<div class=\"rlabs-graph-sidebar-attribute\">\r\n<div class=\"rlabs-graph-sidebar-left-column rlabs-graph-sidebar-left-column--wider\">\r\n<label for=\"rlabs-graph-reference-depth\">Reference depth:</label></div> \r\n(...)\r\n</div>\r\n<div class=\"rlabs-graph-sidebar-attribute\">\r\n<div class=\"rlabs-graph-sidebar-left-column rlabs-graph-sidebar-left-column--wider\">\r\n<label for=\"rlabs-graph-reference-mx\">Inbound References</label></div>\r\n(...)\r\n</div>\r\n(...){code}\r\nh3. Environment\r\n\r\nMacBook Pro (16-inch, 2021)\r\nmacOs Sonoma 14.7\r\nChrome - 131.0.6778.86 (Official Build) (arm64)\r\nFirefox- Version 92.0 (64-bit) \r\nSafari- Version 118.1.1 (19619.2.8.111.7)\r\nJAWS- Version 2023\r\nNVDA- Version 2021.2 \r\nVoiceover - Version Latest\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available\r\n ","createDate":"2024-12-11T12:01:31.000+0000","comments":[]},{"summary":"Help Center | report server for fix: Incomplete labels for form fields","key":"JSDSERVER-15804","url":"https://jira.atlassian.com/browse/JSDSERVER-15804","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nThe label provided to the image button seems to be incomplete.\r\nh3. Steps to Reproduce\r\n # Navigate to the Projects dropdown.\r\n # Select \"Sample JSM\" option.\r\n # Now activate \"Raise a request\" link from the side navigation.\r\n # Select \"Sample JSM\" link from portal page.\r\n # Select \"Report a server for fix\" link.\r\n # Observe that \"Help Center - report server for fix\" page has been appeared on the screen.\r\n # Activate the \"Browse affected server\" button.\r\n # Observe that a \"Select affected server\" modal dialog has been appeared on the screen.\r\n # Now select \"Shoe graph\" button.\r\n # Inspect the code and verify that label is incomplete.\r\n\r\nh3. Screenshot\r\n\r\n!image-2024-12-12-11-42-45-927.png|thumbnail!\r\nh3. Actual Results\r\n\r\nIncomplete label \"Hide\" is specified for the \"Hide side panel\" button.\r\nAs a result, screen reader users will not understand the purpose of the button.\r\nh3. Expected Results\r\n\r\nUpdate the hidden text for the mentioned button. As the label of the button should be descriptive enough to understand the the purpose of the button.\r\n\r\n*Code Snippet*\r\n{code:java}\r\n<button class=\"aui-button aui-button-subtle js-rlabs-graph-sidebar-hide\" title=\"Hide\" resolved=\"\"><span class=\"rlabs-graph-sidebar-icon aui-icon aui-icon-small aui-iconfont-arrows-right\">Hide side panel</span></button> {code}\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available\r\nh3. Environments\r\n\r\nMacBook Pro (16-inch, 2021)\r\nmacOS Sonoma Version 14.6 (23G93)  \r\nChrome - Version 129.0.6668.60 (Official Build) (arm64)\r\nFirefox- Version 112.0.1 (64-bit)\r\nSafari- Version 18.0 (19619.1.26.111.10, 19619)\r\nJAWS- Version 2023\r\nNVDA- Version 2020.3","createDate":"2024-12-11T11:43:29.000+0000","comments":[]},{"summary":"Help center | Home: Search results not programmatically identified","key":"JSDSERVER-15738","url":"https://jira.atlassian.com/browse/JSDSERVER-15738","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nOn the \"Help center - Home\" page, As soon as user start entering in the \"What do you need help with?\" input field, The matching results gets populated below the input field.   \r\nh3. Steps to Reproduce\r\n # Open the \"Help center - Home\" page.\r\n # Navigate to the main content.\r\n # Using screen reader, type any invalid character in \"What do you need help with? input field.\r\n # Listen that the dynamically updating content is not announced by screen reader.\r\n\r\nh3. Screen Recording\r\n\r\nScreen Recording\r\n\r\n[^Help Center - Service project - Google Chrome 2024-12-09 18-01-12.mp4]\r\nh3. Actual Results\r\n\r\nWhen the users perform a valid “Search” operation in the “What do you need help with?” input field, search results are getting updated below the respective input field and for invalid search operations the message such as \"No matching search results\" displayed on the page which is not announced by screen reader. The programmatic means of identifying the presence of search result messages and suggestions are not used, so assistive technologies such as screen readers are not able to alert users to the presence of the status message/search results. Although this interaction is easier to understand for sighted users, it is not intuitive for the visually impaired.\r\nh3. Expected Results\r\n\r\nApply the following changes\r\n * Ensure that the search results/status messages that become available when the user search for inputted data in the “What do you need help with?” input field should get announced by the screen reader.\r\n * Provide the aria-live region for the search result message such as \"No matching search results\" which becomes available when the user performs an invalid search operation.\r\n * Screen reader users should be notified when the suggestions get updated in the below along with the count of suggestions. For eg: “ 4 results found” Live regions can be used to achieve this behaviour.\r\n * If this is not feasible, a hidden instruction should be announced (when the search input receives focus), notifying the users of the dynamic change. For eg: Typing letters in the search input fields update the search results, press the tab key to view the list of suggestions.”.\r\n\r\nh3. Workaround\r\n\r\nCurrently there is no known workaround for this behavior. A workaround will be added here when available\r\nh3. Environment\r\n\r\nEnvironment\r\n\r\nMacBook Pro (16-inch, 2021)\r\nmacOs Monterey Version 12.3.1\r\nChrome - Version 101.0.4606.81 (Official Build) (64-bit)\r\nFirefox- Version 93.0 (32-bit)\r\nSafari- Version 15.3 (17612.4.9.1.5)\r\nJAWS- Version 2022\r\nNVDA- Version 2020.3\r\nVoiceover - Version Latest","createDate":"2024-12-09T12:08:48.000+0000","comments":[{"text":"Closed by https://bulldog.internal.atlassian.com/browse/A11Y-617","author":"Bohdan Hulovatyi"}]},{"summary":"Behavior when editing float values is inconsistent when using German locale","key":"JSDSERVER-15703","url":"https://jira.atlassian.com/browse/JSDSERVER-15703","type":"Bug","priority":"","description":"h3. Issue Summary\r\n\r\nWhen using Jira with German locale, the behavior for editing float values is not consistent.\r\nh3. Steps to Reproduce\r\n # Set up a Jira environment with *German* [locale.|https://confluence.atlassian.com/jirakb/change-locale-for-jira-server-314450433.html]\r\n # Create a test object schema.\r\n # For any object, create an attribute of type {*}float{*}.\r\n # When adding or editing a value for a float attribute in the *Object Schema* view, if you add the number using a comma (the standard for German locale), the error message \"{_}Value is not valid (Float){_}\" will be shown. The error does not happen if a dot is used instead of a comma, but the value will be displayed correctly with the comma.\r\n # When adding or editing a value for the same attribute in the *Object* view, however, it is possible to do so using a comma *OR* a dot. However, the value is then displayed with a dot.\r\n\r\nh3. Expected Results\r\n\r\nAssets should fully respect the German locale settings and allow editing of float attributes with a comma. The values should also be consistently displayed with a comma.\r\nh3. Actual Results\r\n * When adding or editing a value for a float attribute in the Object Schema view, if you add the number using a comma (the standard for German locale), the error message \"Value is not valid (Float)\" will be shown. The error does not happen if a dot is used instead of a comma, but the value will be displayed correctly with the comma.\r\n * When adding or editing a value for the same attribute in the Object view, however, it is possible to do so using a comma OR a dot. However, the value is then displayed with a dot.\r\n\r\nh3. Workaround\r\nh3. Versions Tested\r\n\r\nPlease confirm all versions that have been tested for this issue, and indicate whether the tested version is affected or not affected, below: \r\n||Testing Requirements||Version||Affected Version||\r\n|Customers Reported Version|5.17.4|Yes|\r\n|Most Recent Bug-Fix Release|10.2.1|Yes|\r\n|Previous Major Release| | |\r\n|Most Recent LTS|5.12.15|Yes|\r\n|Previous Supported LTS| | |\r\n|_Other Versions.._| | |\r\n|_(Add rows as needed)_| | |","createDate":"2024-11-25T14:50:07.000+0000","comments":[{"text":"Hi there, quick addition we noticed also that this problem occurs in version 10.3.3","author":"Maxim Granzotto"},{"text":"floated value is consistent.","author":"Mohan Rao"}]}]